anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
FullGuidedRfState fullGuidedRfState;
Nrf24PassiveSpectrumReport fullGuidedNrf24Report;
Cc1101PassiveSpectrumReport fullGuidedCc1101Report;
std::uint64_t fullGuidedRfStartAfterUs = 0;
enum class FullGuidedArtifactStep : std::uint8_t {
    Idle,
    Recover,
    LibraryJson,
    LibraryCsv,
    CapturePcap,
    DisposableCommit,
    DisposableRemountExport,
    DisposableCleanup,
    ProductVerify,
    Complete,
    Failed,
    Cancelled,
};
const char* fullGuidedArtifactStepName(FullGuidedArtifactStep step) {
    switch (step) {
        case FullGuidedArtifactStep::Idle: return "idle";
        case FullGuidedArtifactStep::Recover: return "recover";
        case FullGuidedArtifactStep::LibraryJson: return "library_json";
        case FullGuidedArtifactStep::LibraryCsv: return "library_csv";
        case FullGuidedArtifactStep::CapturePcap: return "capture_pcap";
        case FullGuidedArtifactStep::DisposableCommit:
            return "disposable_commit";
        case FullGuidedArtifactStep::DisposableRemountExport:
            return "disposable_remount_export";
        case FullGuidedArtifactStep::DisposableCleanup:
            return "disposable_cleanup";
        case FullGuidedArtifactStep::ProductVerify: return "product_verify";
        case FullGuidedArtifactStep::Complete: return "complete";
        case FullGuidedArtifactStep::Failed: return "failed";
        case FullGuidedArtifactStep::Cancelled: return "cancelled";
    }
    return "unknown";
}
struct FullGuidedArtifactState final {
    FullGuidedArtifactStep step = FullGuidedArtifactStep::Idle;
    char expectedFingerprint[33] = {};
    bool recoveryComplete = false;
    bool recoveryPassed = false;
    bool libraryComplete = false;
    bool libraryPassed = false;
    bool captureComplete = false;
    bool captureApplicable = false;
    bool capturePassed = false;
    bool cleanupComplete = true;
    std::uint32_t generationBefore = 0;
    std::uint32_t generationAfter = 0;
    std::size_t observationsBefore = 0;
    std::size_t observationsAfter = 0;
    std::size_t jsonBytes = 0;
    std::size_t metadataBytes = 0;
    std::size_t csvBytes = 0;
    std::size_t csvRecords = 0;
    std::size_t csvIndex = 0;
    std::size_t pcapBytes = 0;
    std::size_t pcapFrames = 0;
    std::uint32_t pcapFnv1a = 2166136261U;
    std::uint32_t blockedWriteAttempts = 0;
    bool disposableCommitComplete = false;
    bool disposableCommitPassed = false;
    bool disposableRemountComplete = false;
    bool disposableRemountPassed = false;
    bool disposableExportComplete = false;
    bool disposableExportPassed = false;
    bool disposableCleanupComplete = false;
    bool disposableCleanupPassed = false;
    bool productVerifyComplete = false;
    bool productVerifyPassed = false;
    bool disposableResourceAcquired = false;
    bool disposableResourceReleased = true;
    bool disposableIdentityPassed = false;
    bool scratchPreexisting = false;
    bool scratchCreated = false;
    bool scratchRemoved = false;
    bool workflowPassed = true;
    char disposableObservedFingerprint[33] = {};
    char disposableScratchPath[leshy1::storage::kScratchPathMax] = {};
    std::uint32_t disposableGeneration = 0;
    std::size_t disposableObservations = 0;
    std::size_t disposableJsonBytes = 0;
    std::size_t disposableMetadataBytes = 0;
    std::size_t disposableCsvBytes = 0;
    std::size_t disposableCsvRecords = 0;
    std::uint64_t disposableStorageWriteBytes = 0;
    std::uint32_t disposableStorageWriteCalls = 0;
    std::uint32_t disposableFileSyncs = 0;
    std::uint32_t disposableDirectorySyncs = 0;
    std::uint16_t disposableFilesRemoved = 0;
    std::uint32_t productGenerationFinal = 0;
    std::size_t productObservationsFinal = 0;
};
struct FullGuidedPcapSink final {
    std::size_t bytes = 0;
    std::uint32_t fnv1a = 2166136261U;
};
bool writeFullGuidedPcapBytes(const std::uint8_t* data, std::size_t size,
                              void* context) {
    if ((data == nullptr && size != 0) || context == nullptr) return false;
    auto* sink = static_cast<FullGuidedPcapSink*>(context);
    for (std::size_t index = 0; index < size; ++index) {
        sink->fnv1a ^= data[index];
        sink->fnv1a *= 16777619U;
    }
    sink->bytes += size;
    return true;
}
FullGuidedArtifactState fullGuidedArtifactState;
std::uint64_t fullGuidedArtifactStartAfterUs = 0;
enum class RfSpectrumKind : std::uint8_t {
    Nrf24,
    Cc1101,
};
enum class RfSpectrumView : std::uint8_t {
    None,
    SourceMenu,
    Live,
};
const char* rfSpectrumViewName(RfSpectrumView view) {
    switch (view) {
        case RfSpectrumView::None: return "none";
        case RfSpectrumView::SourceMenu: return "source_menu";
        case RfSpectrumView::Live: return "live";
    }
    return "unknown";
}
RfSpectrumView rfSpectrumView = RfSpectrumView::None;
RfSpectrumKind rfSpectrumKind = RfSpectrumKind::Nrf24;
std::uint8_t rfSpectrumSelection = 0;
std::uint64_t nextNrf24SpectrumSweepUs = 0;
BoardWifiPassiveCapture wifiFrameCapture;
constexpr WifiFrameCapturePlan kProductWifiFrameCapturePlan{};
std::uint64_t nextCaptureUiRefreshUs = 0;
enum class CapturePersistState : std::uint8_t {
    Result,
    Confirm,
    Saving,
    Saved,
    Failed,
};
struct CaptureStoreEvent final {
    const char* status = "not_started";
    bool valid = false;
    bool cleanupComplete = false;
    std::uint32_t generation = 0;
    leshy1::storage::SessionStoreStatus storeStatus =
        leshy1::storage::SessionStoreStatus::InvalidArgument;
};
CapturePersistState capturePersistState = CapturePersistState::Result;
const char* capturePersistStatus = "volatile";
std::uint32_t capturePersistGeneration = 0;
QueueHandle_t captureStoreEvents = nullptr;
TaskHandle_t captureStoreTaskHandle = nullptr;
const char* capturePersistStateName(CapturePersistState state) {
    switch (state) {
        case CapturePersistState::Result: return "volatile";
        case CapturePersistState::Confirm: return "confirm";
        case CapturePersistState::Saving: return "saving";
        case CapturePersistState::Saved: return "saved";
        case CapturePersistState::Failed: return "failed";
    }
    return "failed";
}
constexpr std::size_t kConsoleCommandCapacity = 192;
constexpr char kLongestConsoleCommand[] =
    "storage.littlefs.reset recover read-only "
    "ffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffff "
    "s3-littlefs-reset-20260818-b6 6";
static_assert(sizeof(kLongestConsoleCommand) <= kConsoleCommandCapacity,
              "console command buffer cannot hold the longest command");
char usbCommand[kConsoleCommandCapacity] = {};
char uartCommand[kConsoleCommandCapacity] = {};
std::size_t usbLength = 0;
std::size_t uartLength = 0;
std::uint8_t lastInputRaw = 0xFF;
Pcf8574ButtonInput physicalButtonInput;

struct PhysicalInputEvent final {
    UiAction action = UiAction::Unknown;
    std::uint8_t raw = 0xFF;
    std::uint32_t atMs = 0;
    std::uint64_t atUs = 0;
};

constexpr UBaseType_t kPhysicalInputQueueCapacity = 64;
QueueHandle_t physicalInputEvents = nullptr;
TaskHandle_t physicalInputTaskHandle = nullptr;
portMUX_TYPE physicalInputMux = portMUX_INITIALIZER_UNLOCKED;
std::uint32_t physicalInputQueueDrops = 0;
std::uint32_t physicalInputQueueHighWater = 0;
std::uint32_t physicalInputDispatchedPresses = 0;
UiAction lastPhysicalInputAction = UiAction::Unknown;
bool lastPhysicalInputChanged = false;
std::uint64_t lastPhysicalInputQueueUs = 0;
std::uint64_t maximumPhysicalInputQueueUs = 0;
std::uint64_t lastPhysicalInputRenderUs = 0;
std::uint64_t lastPhysicalInputEndToEndUs = 0;
std::uint64_t maximumPhysicalInputEndToEndUs = 0;
bool physicalInputTaskStarted = false;
std::uint32_t touchHandledPresses = 0;
std::uint32_t touchMissedPresses = 0;
std::uint32_t syntheticTouchPresses = 0;
TouchPoint lastTouchPoint{};
bool lastTouchChanged = false;

struct ProductBootRecoveryState final {
    const char* status = "not_started";
    char expectedFingerprint[33] = {};
    char observedFingerprint[33] = {};
    bool enrolled = false;
    bool fingerprintMatched = false;
    bool mountedReadOnly = false;
    bool readOnlyGuaranteed = false;
    bool rootExists = false;
    bool opened = false;
    bool catalogAdmitted = false;
    bool cleanupComplete = false;
    leshy1::storage::ProductStoreAccessStatus permitStatus =
        leshy1::storage::ProductStoreAccessStatus::MissingMedia;
    leshy1::apps::library::SessionCatalogResult catalog{};
    std::uint32_t ownedDuring = 0;
    std::uint32_t ownedAfter = 0;
    std::uint32_t blockedWriteAttempts = 0;
    std::uint8_t attempts = 0;
    std::uint8_t transientRetries = 0;
    std::uint8_t timeoutRestarts = 0;
};

ProductBootRecoveryState productBootRecovery;
constexpr std::uint32_t kProductBootRetryRtcMagic = 0x4C425231U;
constexpr std::uint32_t kProductBootWatchdogTestRtcMagic = 0x4C425754U;
RTC_NOINIT_ATTR std::uint32_t productBootRetryRtcMagic;
RTC_NOINIT_ATTR volatile std::uint32_t productBootRetryRestarts;
RTC_NOINIT_ATTR std::uint32_t productBootRetryAppIdentity;
RTC_NOINIT_ATTR volatile std::uint32_t productBootRetryTimeouts;
RTC_NOINIT_ATTR std::uint32_t productBootWatchdogTestRtcState;
constexpr std::uint32_t kLittleFsResetRtcMagic = 0x4C465231U;
struct LittleFsResetRtcState final {
    std::uint32_t magic;
    std::uint32_t boundary;
    std::uint8_t token[32];
};
RTC_NOINIT_ATTR LittleFsResetRtcState littleFsResetRtcState;
TaskHandle_t productBootRecoveryWatchdogTask = nullptr;
bool productBootRecoveryTaskWatchdogAdded = false;
volatile std::uint32_t productBootRecoveryWatchdogArmed = 0;

