anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
static_assert(CONFIG_ESP_TASK_WDT_EN && CONFIG_ESP_TASK_WDT_INIT &&
                  CONFIG_ESP_TASK_WDT_PANIC,
              "boot recovery requires the panic-enabled Task WDT");
static_assert(
    leshy1::storage::kProductBootRecoveryHardwareWatchdogMs ==
        CONFIG_ESP_TASK_WDT_TIMEOUT_S * 1000U,
    "boot recovery hardware watchdog policy must match the SDK configuration");

struct ProductSurveyRuntimeState final {
    const char* status = "idle";
    bool selected = false;
    bool backendOpen = false;
    bool identityCleanupComplete = true;
    bool filesystemAttempted = false;
    bool scannerCleanupComplete = true;
    bool cleanupComplete = true;
    std::uint8_t identityAttempts = 0;
    std::uint8_t identityTransientRetries = 0;
    leshy1::storage::SdTransportRunStatus identityStatus =
        leshy1::storage::SdTransportRunStatus::InvalidPlan;
    char expectedFingerprint[33] = {};
    char observedFingerprint[33] = {};
    std::uint64_t cardCapacityBytes = 0;
    std::uint64_t cachedFreeBytes = 0;
    leshy1::storage::ProductStoreAccessStatus storeStatus =
        leshy1::storage::ProductStoreAccessStatus::MissingMedia;
    leshy1::apps::survey::ProductSurveyAdmissionStatus admissionStatus =
        leshy1::apps::survey::ProductSurveyAdmissionStatus::ExplicitStartRequired;
    BoardWifiPassiveScanResult scan{};
    BoardBlePassiveScanResult bleScan{};
    bool workerReady = false;
    bool sourceActive = false;
    bool sourceStartAttempted = false;
    bool sourceFailureInjected = false;
    bool runtimeSourceFailureInjected = false;
    std::uint8_t runtimeSourceFailureInjectedMask = 0;
    bool storeOpenAttempted = false;
    std::uint64_t storeBytesWritten = 0;
    bool cancelRequestedDuringScan = false;
    std::uint32_t scanCycles = 0;
    std::uint32_t wifiScanCycles = 0;
    std::uint32_t bleScanCycles = 0;
    std::uint64_t startActionUs = 0;
    std::uint64_t stopActionUs = 0;
    std::uint8_t selectedSourceMask = 0;
    std::uint8_t activeSourceMask = 0;
    std::uint8_t unavailableSourceMask = 0;
    const char* timelineStatus = "idle";
    const char* timelineArchiveStatus = "idle";
    const char* timelineFailureStatus = "none";
    const char* timelineFailureStage = "none";
    std::uint64_t timelineFailureEventUs = 0;
    std::uint64_t timelineFailureLatestUs = 0;
    bool timelineHealthy = true;
    std::uint32_t timelineArchivedWindows = 0;
};

ProductSurveyRuntimeState productSurveyRuntime;

enum class ProductSurveyWorkerControl : std::uint8_t {
    Idle,
    Starting,
    Running,
    Paused,
    PauseRequested,
    StopRequested,
    CancelRequested,
};

enum class ProductSurveyWorkerEventKind : std::uint8_t {
    Prepared,
    ScanStarted,
    Scan,
    SourceUnavailable,
    Paused,
    Stopped,
    Cancelled,
    Failed,
};

struct ProductSurveyWorkerReport final {
    const char* status = "idle";
    bool backendOpen = false;
    bool identityCleanupComplete = true;
    bool filesystemAttempted = false;
    bool scannerCleanupComplete = true;
    bool cleanupComplete = true;
    bool sourceActive = false;
    bool sourceStartAttempted = false;
    bool sourceFailureInjected = false;
    bool runtimeSourceFailureInjected = false;
    std::uint8_t runtimeSourceFailureInjectedMask = 0;
    bool storeOpenAttempted = false;
    std::uint64_t storeBytesWritten = 0;
    std::uint8_t identityAttempts = 0;
    std::uint8_t identityTransientRetries = 0;
    leshy1::storage::SdTransportRunStatus identityStatus =
        leshy1::storage::SdTransportRunStatus::InvalidPlan;
    char expectedFingerprint[33] = {};
    char observedFingerprint[33] = {};
    std::uint64_t cardCapacityBytes = 0;
    std::uint64_t cachedFreeBytes = 0;
    leshy1::storage::ProductStoreAccessStatus storeStatus =
        leshy1::storage::ProductStoreAccessStatus::MissingMedia;
    leshy1::apps::survey::ProductSurveyAdmissionStatus admissionStatus =
        leshy1::apps::survey::ProductSurveyAdmissionStatus::ExplicitStartRequired;
    std::uint8_t selectedSourceMask = 0;
    std::uint8_t activeSourceMask = 0;
    std::uint8_t unavailableSourceMask = 0;
};

struct ProductSurveyWorkerEvent final {
    ProductSurveyWorkerEventKind kind = ProductSurveyWorkerEventKind::Failed;
    ProductSurveyWorkerReport report{};
    RadioKind source = RadioKind::Wifi;
    BoardWifiPassiveScanResult scan{};
    BoardBlePassiveScanResult bleScan{};
    std::uint32_t scanCycles = 0;
    std::uint32_t sourceScanCycles = 0;
    std::uint64_t eventUs = 0;
    std::uint64_t scanStartedUs = 0;
    std::uint64_t scanEndedUs = 0;
    std::uint16_t scanDropped = 0;
    SourceWindowState failureState = SourceWindowState::Fault;
    SourceWindowReason failureReason = SourceWindowReason::DriverFault;
};

constexpr UBaseType_t kProductSurveyWorkerEventCapacity = 8;
constexpr UBaseType_t kProductSurveyObservationCapacity =
    leshy1::services::survey::SurveySession::kObservationCapacity;
constexpr std::uint32_t kProductSurveyScanIntervalMs = 1000;
QueueHandle_t productSurveyWorkerEvents = nullptr;
QueueHandle_t productSurveyObservations = nullptr;
StaticSemaphore_t productSurveyScanStartGateStorage{};
SemaphoreHandle_t productSurveyScanStartGate = nullptr;
TaskHandle_t productSurveyWorkerTaskHandle = nullptr;
portMUX_TYPE productSurveyWorkerMux = portMUX_INITIALIZER_UNLOCKED;
ProductSurveyWorkerControl productSurveyWorkerControl =
    ProductSurveyWorkerControl::Idle;
std::uint32_t productSurveyWorkerOwnedResources = 0;
bool productSurveyWorkerReady = false;
bool productSurveyWorkerScanActive = false;
bool productSurveySourceUnavailableOnce = false;
std::uint8_t productSurveyRuntimeUnavailableOnceMask = 0;

void renderInteractiveScreen(bool clearContent = true);
void broadcast(const char* line);

bool lastUiActionUsedIncrementalRender = false;
bool lastUiRenderWasIncremental = false;
std::uint64_t lastUiRenderUs = 0;

struct SdPhysicalEvidenceWorkspace final {
    char line[5120] = {};
    char summaryA[512] = {};
    char summaryB[512] = {};
    char summaryC[512] = {};
    char cidHex[33] = {};
    std::array<std::uint8_t, 512> sectorA{};
    std::array<std::uint8_t, 512> sectorB{};
    std::array<std::uint8_t, 512> sectorC{};
    std::array<std::uint64_t, kSdThroughputSamples> commitUs{};
};

SdPhysicalEvidenceWorkspace sdPhysicalEvidence;
// Diagnostic replies and explicit physical-storage commands run serially on the
// main loop. Reuse their largest scratch line instead of reserving a second 5 KiB
// buffer that would permanently reduce the no-PSRAM product heap.
auto& diagnosticJson = sdPhysicalEvidence.line;

struct StoredGenerationEvidence final {
    std::uint32_t expectedSegmentCrc = 0;
    std::uint32_t observedSegmentCrc = 0;
    std::uint32_t expectedManifestCrc = 0;
    std::uint32_t observedManifestCrc = 0;
    std::size_t expectedSegmentSize = 0;
    std::size_t observedSegmentSize = 0;
    std::size_t expectedManifestSize = 0;
    std::size_t observedManifestSize = 0;
    bool unchanged = false;
};

