anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool clearProductFingerprint() {
    char existing[33] = {};
    if (!loadProductFingerprint(existing, sizeof(existing))) return true;
    Preferences preferences;
    if (!preferences.begin(kProductEnrollmentNamespace, false)) return false;
    const bool removed = preferences.remove(kProductEnrollmentKey);
    preferences.end();
    char verified[33] = {};
    return removed && !loadProductFingerprint(verified, sizeof(verified));
}

UiLanguage loadUiLanguage() {
    Preferences preferences;
    if (!preferences.begin(kUiPreferencesNamespace, true)) {
        return UiLanguage::English;
    }
    const std::uint8_t stored = preferences.getUChar(kUiLanguageKey, 0);
    preferences.end();
    return stored == static_cast<std::uint8_t>(UiLanguage::Russian)
               ? UiLanguage::Russian
               : UiLanguage::English;
}

bool saveUiLanguage(UiLanguage language) {
    Preferences preferences;
    if (!preferences.begin(kUiPreferencesNamespace, false)) return false;
    const std::size_t written = preferences.putUChar(
        kUiLanguageKey, static_cast<std::uint8_t>(language));
    preferences.end();
    return written == sizeof(std::uint8_t);
}

bool closeProductSurveyBackend() {
    productSurveyRuntime.storeBytesWritten = productSurveyStore.bytesWritten();
    productSurveyStore.end();
    const bool filesystemWasMounted = productSurveyFilesystem.mounted();
    if (filesystemWasMounted) productSurveyFilesystem.end();
    surveyStoreRouter.bind(ramSessionStore);
    productSurveyRuntime.backendOpen = false;
    const bool filesystemCleanup =
        !productSurveyRuntime.filesystemAttempted ||
        productSurveyFilesystem.cleanupComplete();
    productSurveyRuntime.cleanupComplete =
        productSurveyRuntime.identityCleanupComplete &&
        productSurveyRuntime.scannerCleanupComplete && filesystemCleanup &&
        !productSurveyFilesystem.mounted() &&
        surveyStoreRouter.boundTo(ramSessionStore);
    return productSurveyRuntime.cleanupComplete;
}

ProductSurveyWorkerControl productSurveyControl() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const ProductSurveyWorkerControl control = productSurveyWorkerControl;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return control;
}

void setProductSurveyControl(ProductSurveyWorkerControl control) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    productSurveyWorkerControl = control;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

bool transitionProductSurveyControl(ProductSurveyWorkerControl expected,
                                    ProductSurveyWorkerControl next) {
    bool changed = false;
    portENTER_CRITICAL(&productSurveyWorkerMux);
    if (productSurveyWorkerControl == expected) {
        productSurveyWorkerControl = next;
        changed = true;
    }
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return changed;
}

bool productSurveyStopRequested() {
    const ProductSurveyWorkerControl control = productSurveyControl();
    return control == ProductSurveyWorkerControl::PauseRequested ||
           control == ProductSurveyWorkerControl::StopRequested ||
           control == ProductSurveyWorkerControl::CancelRequested;
}

bool productSurveyCancelRequested() {
    return productSurveyControl() ==
           ProductSurveyWorkerControl::CancelRequested;
}

bool productSurveyScanActive() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool active = productSurveyWorkerScanActive;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return active;
}

bool productSurveySourceUnavailableInjectionArmed() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool armed = productSurveySourceUnavailableOnce;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return armed;
}

void setProductSurveySourceUnavailableInjection(bool armed) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    productSurveySourceUnavailableOnce = armed;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

bool consumeProductSurveySourceUnavailableInjection() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool injected = productSurveySourceUnavailableOnce;
    productSurveySourceUnavailableOnce = false;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return injected;
}

std::uint8_t productSurveyRuntimeUnavailableInjectionMask() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const std::uint8_t mask = productSurveyRuntimeUnavailableOnceMask;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return mask;
}

void setProductSurveyRuntimeUnavailableInjection(std::uint8_t mask) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    productSurveyRuntimeUnavailableOnceMask = static_cast<std::uint8_t>(
        mask & leshy1::services::survey::kSupportedSourceMask);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

bool consumeProductSurveyRuntimeUnavailableInjection(RadioKind source) {
    const std::uint8_t mask = leshy1::services::survey::sourceMask(source);
    bool injected = false;
    portENTER_CRITICAL(&productSurveyWorkerMux);
    if ((productSurveyRuntimeUnavailableOnceMask & mask) != 0) {
        productSurveyRuntimeUnavailableOnceMask = static_cast<std::uint8_t>(
            productSurveyRuntimeUnavailableOnceMask &
            static_cast<std::uint8_t>(~mask));
        injected = true;
    }
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return injected;
}

bool productSurveySourceUnavailableVisible() {
    return productSurveyRuntime.selected &&
        productSurveyRuntime.cleanupComplete &&
        productSurveyRuntime.admissionStatus ==
            leshy1::apps::survey::ProductSurveyAdmissionStatus::SourceUnavailable &&
        std::strcmp(productSurveyRuntime.status, "source_unavailable") == 0;
}

void setProductSurveyScanActive(bool active) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    productSurveyWorkerScanActive = active;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

void applyProductSurveyWorkerReport(
    const ProductSurveyWorkerReport& report) {
    productSurveyRuntime.backendOpen = report.backendOpen;
    productSurveyRuntime.identityCleanupComplete =
        report.identityCleanupComplete;
    productSurveyRuntime.filesystemAttempted = report.filesystemAttempted;
    productSurveyRuntime.scannerCleanupComplete =
        report.scannerCleanupComplete;
    productSurveyRuntime.cleanupComplete = report.cleanupComplete;
    productSurveyRuntime.sourceActive = report.sourceActive;
    productSurveyRuntime.sourceStartAttempted = report.sourceStartAttempted;
    productSurveyRuntime.sourceFailureInjected = report.sourceFailureInjected;
    productSurveyRuntime.runtimeSourceFailureInjected =
        report.runtimeSourceFailureInjected;
    productSurveyRuntime.runtimeSourceFailureInjectedMask =
        report.runtimeSourceFailureInjectedMask;
    productSurveyRuntime.storeOpenAttempted = report.storeOpenAttempted;
    productSurveyRuntime.storeBytesWritten = report.storeBytesWritten;
    productSurveyRuntime.identityAttempts = report.identityAttempts;
    productSurveyRuntime.identityTransientRetries =
        report.identityTransientRetries;
    productSurveyRuntime.identityStatus = report.identityStatus;
    std::memcpy(productSurveyRuntime.expectedFingerprint,
                report.expectedFingerprint,
                sizeof(productSurveyRuntime.expectedFingerprint));
    std::memcpy(productSurveyRuntime.observedFingerprint,
                report.observedFingerprint,
                sizeof(productSurveyRuntime.observedFingerprint));
    productSurveyRuntime.cardCapacityBytes = report.cardCapacityBytes;
    productSurveyRuntime.cachedFreeBytes = report.cachedFreeBytes;
    productSurveyRuntime.storeStatus = report.storeStatus;
    productSurveyRuntime.admissionStatus = report.admissionStatus;
    productSurveyRuntime.activeSourceMask = report.activeSourceMask;
    productSurveyRuntime.unavailableSourceMask = report.unavailableSourceMask;
}

void accumulateProductSurveyScan(BoardWifiPassiveScanResult* total,
                                 const BoardWifiPassiveScanResult& scan) {
    if (total == nullptr) return;
    total->status = scan.status;
    total->driverError = scan.driverError;
    total->durationUs += scan.durationUs;
    total->recordsReported = static_cast<std::uint16_t>(
        total->recordsReported + scan.recordsReported);
    total->recordsRead = static_cast<std::uint16_t>(
        total->recordsRead + scan.recordsRead);
    total->accepted = static_cast<std::uint16_t>(
        total->accepted + scan.accepted);
    total->rejected = static_cast<std::uint16_t>(
        total->rejected + scan.rejected);
    total->dropped = static_cast<std::uint16_t>(
        total->dropped + scan.dropped);
}

void accumulateProductSurveyBleScan(BoardBlePassiveScanResult* total,
                                    const BoardBlePassiveScanResult& scan) {
    if (total == nullptr) return;
    total->status = scan.status;
    total->durationUs += scan.durationUs;
    total->recordsReported = static_cast<std::uint16_t>(
        total->recordsReported + scan.recordsReported);
    total->recordsRead = static_cast<std::uint16_t>(
        total->recordsRead + scan.recordsRead);
    total->accepted = static_cast<std::uint16_t>(
        total->accepted + scan.accepted);
    total->rejected = static_cast<std::uint16_t>(
        total->rejected + scan.rejected);
    total->dropped = static_cast<std::uint16_t>(
        total->dropped + scan.dropped);
}

SourceFailureClass productSurveyFailureClass(
    RadioKind source, const BoardWifiPassiveScanResult& wifiScan,
    const BoardBlePassiveScanResult& bleScan) {
    if (source == RadioKind::Wifi) {
        return wifiScan.status ==
                       leshy1::platform::arduino::BoardWifiScanStatus::NotStarted
                   ? SourceFailureClass::Unavailable
                   : SourceFailureClass::Fault;
    }
    switch (bleScan.status) {
        case leshy1::platform::arduino::BoardBleScanStatus::NotStarted:
        case leshy1::platform::arduino::BoardBleScanStatus::StackInitFailed:
        case leshy1::platform::arduino::BoardBleScanStatus::ScannerUnavailable:
            return SourceFailureClass::Unavailable;
        case leshy1::platform::arduino::BoardBleScanStatus::Valid:
        case leshy1::platform::arduino::BoardBleScanStatus::InvalidPlan:
        case leshy1::platform::arduino::BoardBleScanStatus::ScanTimedOut:
            return SourceFailureClass::Fault;
    }
    return SourceFailureClass::Fault;
}

WifiRecordDisposition enqueueProductSurveyWorkerRecord(
    const WifiScanRecord& record, std::uint64_t monotonicUs, void*) {
    Observation observation;
    if (!leshy1::drivers::wifi::normalizePassiveRecord(
            record, monotonicUs, &observation)) {
        return WifiRecordDisposition::Rejected;
    }
    if (productSurveyObservations == nullptr ||
        xQueueSend(productSurveyObservations, &observation, 0) != pdTRUE) {
        return WifiRecordDisposition::Dropped;
    }
    return WifiRecordDisposition::Accepted;
}

