anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    report.filesystemAttempted = true;
    if (!productSurveyFilesystem.begin()) {
        report.status = "mount_failed";
        return report;
    }
    if (productSurveyCancelRequested()) {
        report.status = "cancelled";
        return report;
    }
    report.cardCapacityBytes = productSurveyFilesystem.cardCapacityBytes();
    report.cachedFreeBytes = productSurveyFilesystem.cachedFreeBytes();
    const bool capacityMatched =
        report.cardCapacityBytes != 0 &&
        report.cardCapacityBytes == identity.identity.capacityBytes;
    const bool rootExists = productSurveyFilesystem.exists(
        leshy1::storage::kProductSessionStoreRoot);

    leshy1::storage::MediaIdentity media;
    media.present = capacityMatched;
    media.kind = leshy1::storage::MediaKind::Sd;
    media.fingerprint = report.observedFingerprint;
    media.capacityBytes = report.cardCapacityBytes;
    media.freeBytes = report.cachedFreeBytes;
    leshy1::storage::ProductStoreRequest storeRequest;
    storeRequest.operation =
        leshy1::storage::ProductStoreOperation::CommitSession;
    storeRequest.explicitlySelected = true;
    storeRequest.expectedFingerprint = report.expectedFingerprint;
    storeRequest.rootPath = leshy1::storage::kProductSessionStoreRoot;
    storeRequest.rootExists = rootExists;
    storeRequest.driverWriteEnabled = true;
    storeRequest.requiredBytes = kProductSurveyCommitBytes;
    storeRequest.reserveBytes = kProductSurveyReserveBytes;
    storeRequest.ownedResources = ownedResources;
    const leshy1::storage::ProductStorePermit storePermit =
        leshy1::storage::authorizeProductStore(media, storeRequest);
    report.storeStatus = storePermit.status;
    if (!storePermit.allowed()) {
        report.status =
            leshy1::storage::productStoreAccessStatusName(storePermit.status);
        return report;
    }

    report.sourceFailureInjected =
        consumeProductSurveySourceUnavailableInjection();
    if (report.sourceFailureInjected) {
        report.sourceStartAttempted = false;
        report.activeSourceMask = 0;
        report.unavailableSourceMask = selectedSourceMask;
        leshy1::apps::survey::ProductSurveyRequest unavailableRequest;
        unavailableRequest.explicitStart = true;
        unavailableRequest.sourceAvailable = false;
        unavailableRequest.selectedSourceMask = selectedSourceMask;
        unavailableRequest.availableSourceMask = 0;
        unavailableRequest.scanPlan =
            leshy1::drivers::wifi::defaultPassivePlan();
        unavailableRequest.bleScanPlan =
            leshy1::drivers::ble::defaultPassivePlan();
        unavailableRequest.storePermit = storePermit;
        unavailableRequest.ownedResources = ownedResources;
        const auto unavailablePermit =
            leshy1::apps::survey::authorizeProductSurvey(unavailableRequest);
        report.admissionStatus = unavailablePermit.status;
        report.scannerCleanupComplete = true;
        report.status =
            leshy1::apps::survey::productSurveyAdmissionStatusName(
                unavailablePermit.status);
        return report;
    }

    // Validate the writable store before starting Wi-Fi/BLE, then release the
    // FAT/SDSPI stack completely.  The radio stacks and SDSPI both depend on
    // scarce DMA-capable internal heap on this no-PSRAM board and must not have
    // overlapping lifetimes.  The exact CID is checked again and the store is
    // reopened only after both scanners have stopped, immediately before the
    // atomic terminal commit.
    report.storeOpenAttempted = true;
    if (!productSurveyStore.selectDrive(productSurveyFilesystem.driveNumber()) ||
        !productSurveyStore.openExistingWritable(storePermit)) {
        report.status = "store_open_failed";
        return report;
    }
    productSurveyStore.end();
    productSurveyFilesystem.end();
    surveyStoreRouter.bind(ramSessionStore);
    report.backendOpen = false;
    if (!productSurveyFilesystem.cleanupComplete() ||
        productSurveyFilesystem.mounted() ||
        !surveyStoreRouter.boundTo(ramSessionStore)) {
        report.status = "storage_release_failed";
        return report;
    }
    if (productSurveyCancelRequested()) {
        report.status = "cancelled";
        return report;
    }

    report.sourceStartAttempted = selectedSourceMask != 0;
    const std::uint8_t wifiMask =
        leshy1::services::survey::sourceMask(RadioKind::Wifi);
    const std::uint8_t bleMask =
        leshy1::services::survey::sourceMask(RadioKind::Ble);
    const bool wifiSelected = (selectedSourceMask & wifiMask) != 0;
    const bool bleSelected = (selectedSourceMask & bleMask) != 0;
    const bool wifiBegun = wifiSelected ? wifiScanner->begin() : false;
    const bool bleBegun = bleSelected ? bleScanner->begin() : false;
    report.activeSourceMask = static_cast<std::uint8_t>(
        (wifiBegun ? wifiMask : 0U) | (bleBegun ? bleMask : 0U));
    report.unavailableSourceMask = static_cast<std::uint8_t>(
        selectedSourceMask & ~report.activeSourceMask);
    leshy1::apps::survey::ProductSurveyRequest surveyRequest;
    surveyRequest.explicitStart = true;
    surveyRequest.sourceAvailable = report.activeSourceMask != 0;
    surveyRequest.selectedSourceMask = selectedSourceMask;
    surveyRequest.availableSourceMask = report.activeSourceMask;
    surveyRequest.scanPlan = leshy1::drivers::wifi::defaultPassivePlan();
    surveyRequest.bleScanPlan = leshy1::drivers::ble::defaultPassivePlan();
    surveyRequest.storePermit = storePermit;
    surveyRequest.ownedResources = ownedResources;
    const leshy1::apps::survey::ProductSurveyPermit surveyPermit =
        leshy1::apps::survey::authorizeProductSurvey(surveyRequest);
    report.admissionStatus = surveyPermit.status;
    report.scannerCleanupComplete = !wifiBegun && !bleBegun;
    if (!surveyPermit.allowed()) {
        report.status =
            leshy1::apps::survey::productSurveyAdmissionStatusName(
                surveyPermit.status);
        return report;
    }
    if (productSurveyCancelRequested()) {
        report.status = "cancelled";
        return report;
    }
    report.sourceActive = true;
    report.status = "prepared";
    return report;
}

void runProductSurveyWorker(void*) {
    for (;;) {
        ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
        if (productSurveyControl() != ProductSurveyWorkerControl::Starting) {
            continue;
        }
        if (productSurveyObservations != nullptr) {
            xQueueReset(productSurveyObservations);
        }
        setProductSurveyScanActive(false);
        BoardWifiPassiveScanner wifiScanner;
        BoardBlePassiveScanner bleScanner;
        ProductSurveyWorkerReport report =
            prepareProductSurveyWorker(&wifiScanner, &bleScanner);
        if (std::strcmp(report.status, "prepared") != 0) {
            const bool wifiCleanup = wifiScanner.end();
            const bool bleCleanup = bleScanner.end();
            report.scannerCleanupComplete = wifiCleanup && bleCleanup;
            report.sourceActive = false;
            cleanupProductSurveyWorkerHardware(&report);
            const bool cancelled = productSurveyCancelRequested() ||
                std::strcmp(report.status, "cancelled") == 0;
            sendProductSurveyWorkerEvent(
                cancelled ? ProductSurveyWorkerEventKind::Cancelled
                          : ProductSurveyWorkerEventKind::Failed,
                report);
            continue;
        }

        if (!transitionProductSurveyControl(
                ProductSurveyWorkerControl::Starting,
                ProductSurveyWorkerControl::Running)) {
            report.status = "cancelled";
            const bool wifiCleanup = wifiScanner.end();
            const bool bleCleanup = bleScanner.end();
            report.scannerCleanupComplete = wifiCleanup && bleCleanup;
            report.sourceActive = false;
            cleanupProductSurveyWorkerHardware(&report);
            sendProductSurveyWorkerEvent(
                ProductSurveyWorkerEventKind::Cancelled, report);
            continue;
        }
        sendProductSurveyWorkerEvent(
            ProductSurveyWorkerEventKind::Prepared, report);
        BoardWifiPassiveScanResult wifiAggregate;
        BoardBlePassiveScanResult bleAggregate;
        std::uint32_t scanCycles = 0;
        std::uint32_t wifiScanCycles = 0;
        std::uint32_t bleScanCycles = 0;
        bool scanFailed = false;
        bool pendingScanWindow = false;
        RadioKind pendingScanSource = RadioKind::Wifi;
        std::uint64_t pendingScanStartedUs = 0;
        std::uint64_t pendingScanEndedUs = 0;
        std::uint16_t pendingScanDropped = 0;
        while (!productSurveyStopRequested()) {
            const std::array<RadioKind, 2> schedule{
                RadioKind::Wifi, RadioKind::Ble};
            for (const RadioKind source : schedule) {
                const std::uint8_t mask =
                    leshy1::services::survey::sourceMask(source);
                if ((report.activeSourceMask & mask) == 0) continue;
                if (productSurveyStopRequested()) break;
                std::uint64_t scanStartedUs =
                    static_cast<std::uint64_t>(esp_timer_get_time());
                if (scanStartedUs == 0) scanStartedUs = 1;
                const std::uint32_t sourceCycles =
                    source == RadioKind::Wifi ? wifiScanCycles : bleScanCycles;
                // Event and observation queues cannot establish ordering with
                // each other. Clear any stale acknowledgement, publish the
                // window transition, and wait until the UI task has made this
                // source Active before its driver can emit observations.
                xSemaphoreTake(productSurveyScanStartGate, 0);
                sendProductSurveyWorkerEvent(
                    ProductSurveyWorkerEventKind::ScanStarted, report, source,
                    wifiAggregate, bleAggregate, scanCycles, sourceCycles,
                    scanStartedUs, scanStartedUs);
                xSemaphoreTake(productSurveyScanStartGate, portMAX_DELAY);
                if (productSurveyStopRequested()) break;
                setProductSurveyScanActive(true);
                BoardWifiPassiveScanResult wifiScan;
                BoardBlePassiveScanResult bleScan;
                const bool runtimeUnavailableInjected =
                    consumeProductSurveyRuntimeUnavailableInjection(source);
                if (runtimeUnavailableInjected) {
                    report.runtimeSourceFailureInjected = true;
                    report.runtimeSourceFailureInjectedMask =
                        static_cast<std::uint8_t>(
                            report.runtimeSourceFailureInjectedMask | mask);
                } else if (source == RadioKind::Wifi) {
                    wifiScan = wifiScanner.scan(
                        leshy1::drivers::wifi::defaultPassivePlan(),
                        enqueueProductSurveyWorkerRecord, nullptr);
                } else {
                    bleScan = bleScanner.scan(
                        leshy1::drivers::ble::defaultPassivePlan(),
                        enqueueProductSurveyWorkerBleRecord, nullptr);
                }
                setProductSurveyScanActive(false);
                std::uint64_t scanEndedUs =
                    static_cast<std::uint64_t>(esp_timer_get_time());
                if (scanEndedUs < scanStartedUs) scanEndedUs = scanStartedUs;
                pendingScanWindow = true;
                pendingScanSource = source;
                pendingScanStartedUs = scanStartedUs;
                pendingScanEndedUs = scanEndedUs;
                pendingScanDropped = source == RadioKind::Wifi
                    ? wifiScan.dropped : bleScan.dropped;
                if (productSurveyStopRequested()) break;
                const bool valid = source == RadioKind::Wifi
                    ? wifiScan.valid() : bleScan.valid();
                if (!valid) {
                    if (source == RadioKind::Wifi) {
                        accumulateProductSurveyScan(&wifiAggregate, wifiScan);
                    } else {
                        accumulateProductSurveyBleScan(&bleAggregate, bleScan);
                    }
                    const auto degradation =
                        leshy1::services::survey::decideSourceDegradation(
                            report.activeSourceMask,
                            report.unavailableSourceMask, source,
                            productSurveyFailureClass(
                                source, wifiScan, bleScan));
                    if (!degradation.valid) {
                        report.status = "invalid_source_failure";
                        scanFailed = true;
                        break;
                    }
                    report.activeSourceMask = degradation.activeSourceMask;
                    report.unavailableSourceMask =
                        degradation.unavailableSourceMask;
                    report.status = degradation.status;
                    sendProductSurveyWorkerEvent(
                        ProductSurveyWorkerEventKind::SourceUnavailable,
                        report, source, wifiAggregate, bleAggregate,
                        scanCycles, sourceCycles, scanEndedUs,
                        scanStartedUs, scanEndedUs, pendingScanDropped,
                        degradation.windowState,
                        degradation.windowReason);
                    pendingScanWindow = false;
                    if (!degradation.continueSession) {
                        scanFailed = true;
                        break;
                    }
                    continue;
                }
                if (source == RadioKind::Wifi) {
                    ++wifiScanCycles;
                    accumulateProductSurveyScan(&wifiAggregate, wifiScan);
                } else {
                    ++bleScanCycles;
                    accumulateProductSurveyBleScan(&bleAggregate, bleScan);
                }
                const bool wifiActive =
                    (report.activeSourceMask &
                     leshy1::services::survey::sourceMask(RadioKind::Wifi)) != 0;
                const bool bleActive =
                    (report.activeSourceMask &
                     leshy1::services::survey::sourceMask(RadioKind::Ble)) != 0;
                scanCycles = wifiActive && bleActive
                    ? (wifiScanCycles < bleScanCycles
                           ? wifiScanCycles : bleScanCycles)
                    : (wifiActive ? wifiScanCycles : bleScanCycles);
                sendProductSurveyWorkerEvent(
                    ProductSurveyWorkerEventKind::Scan, report, source,
                    wifiAggregate, bleAggregate, scanCycles,
                    source == RadioKind::Wifi ? wifiScanCycles : bleScanCycles,
                    scanEndedUs, scanStartedUs, scanEndedUs,
                    pendingScanDropped);
                pendingScanWindow = false;
            }
            if (productSurveyStopRequested() || scanFailed) break;
            ulTaskNotifyTake(
                pdTRUE, pdMS_TO_TICKS(kProductSurveyScanIntervalMs));
        }

        const ProductSurveyWorkerControl terminalControl =
            productSurveyControl();
        setProductSurveyScanActive(false);
        const bool wifiCleanup = wifiScanner.end();
        const bool bleCleanup = bleScanner.end();
        report.scannerCleanupComplete = wifiCleanup && bleCleanup;
        report.sourceActive = false;
        std::uint64_t terminalUs =
            static_cast<std::uint64_t>(esp_timer_get_time());
        if (terminalUs == 0) terminalUs = 1;
        if (scanFailed ||
            terminalControl == ProductSurveyWorkerControl::CancelRequested) {
            cleanupProductSurveyWorkerHardware(&report);
        }
        if (scanFailed) {
            sendProductSurveyWorkerEvent(
                ProductSurveyWorkerEventKind::Failed,
                report, pendingScanSource, wifiAggregate, bleAggregate,
                scanCycles,
                pendingScanSource == RadioKind::Wifi
                    ? wifiScanCycles : bleScanCycles,
                terminalUs,
                pendingScanWindow ? pendingScanStartedUs : 0,
                pendingScanWindow ? pendingScanEndedUs : 0,
                pendingScanWindow ? pendingScanDropped : 0);
        } else if (terminalControl ==
                   ProductSurveyWorkerControl::PauseRequested) {
            report.status = "paused";
            sendProductSurveyWorkerEvent(
                ProductSurveyWorkerEventKind::Paused,
                report, pendingScanSource, wifiAggregate, bleAggregate,
                scanCycles,
                pendingScanSource == RadioKind::Wifi
                    ? wifiScanCycles : bleScanCycles,
                terminalUs,
                pendingScanWindow ? pendingScanStartedUs : 0,
                pendingScanWindow ? pendingScanEndedUs : 0,
                pendingScanWindow ? pendingScanDropped : 0);
        } else if (terminalControl ==
                   ProductSurveyWorkerControl::StopRequested) {
            report.status = "stopped";
            sendProductSurveyWorkerEvent(
                ProductSurveyWorkerEventKind::Stopped,
                report, pendingScanSource, wifiAggregate, bleAggregate,
                scanCycles,
                pendingScanSource == RadioKind::Wifi
                    ? wifiScanCycles : bleScanCycles,
                terminalUs,
                pendingScanWindow ? pendingScanStartedUs : 0,
                pendingScanWindow ? pendingScanEndedUs : 0,
                pendingScanWindow ? pendingScanDropped : 0);
        } else {
            report.status = "cancelled";
            sendProductSurveyWorkerEvent(
                ProductSurveyWorkerEventKind::Cancelled,
                report, pendingScanSource, wifiAggregate, bleAggregate,
                scanCycles,
                pendingScanSource == RadioKind::Wifi
                    ? wifiScanCycles : bleScanCycles,
                terminalUs,
                pendingScanWindow ? pendingScanStartedUs : 0,
                pendingScanWindow ? pendingScanEndedUs : 0,
                pendingScanWindow ? pendingScanDropped : 0);
        }
    }
}

bool initializeProductSurveyWorker() {
    productSurveyScanStartGate = xSemaphoreCreateBinaryStatic(
        &productSurveyScanStartGateStorage);
    productSurveyWorkerEvents = xQueueCreate(
        kProductSurveyWorkerEventCapacity,
        sizeof(ProductSurveyWorkerEvent));
    productSurveyObservations = xQueueCreate(
        kProductSurveyObservationCapacity, sizeof(Observation));
    if (productSurveyScanStartGate == nullptr ||
        productSurveyWorkerEvents == nullptr ||
        productSurveyObservations == nullptr) {
        if (productSurveyWorkerEvents != nullptr) {
            vQueueDelete(productSurveyWorkerEvents);
            productSurveyWorkerEvents = nullptr;
        }
        if (productSurveyObservations != nullptr) {
            vQueueDelete(productSurveyObservations);
            productSurveyObservations = nullptr;
        }
        return false;
    }
    const bool started = xTaskCreatePinnedToCore(
        runProductSurveyWorker, "leshy-survey", 8192, nullptr, 1,
        &productSurveyWorkerTaskHandle, 0) == pdPASS;
    if (!started) {
        vQueueDelete(productSurveyWorkerEvents);
        vQueueDelete(productSurveyObservations);
        productSurveyWorkerEvents = nullptr;
        productSurveyObservations = nullptr;
        productSurveyScanStartGate = nullptr;
    }
    return started;
}

bool failProductSurveyStart(const char* status) {
    if (surveyWorkflow.state() == SurveyWorkflowState::Running) {
        surveyPipeline.cancel();
    }
    closeProductSurveyBackend();
    productSurveyRuntime.status = productSurveyRuntime.cleanupComplete
                                      ? status
                                      : "cleanup_failed";
    lastRuntimeEvent = productSurveyRuntime.status;
    return false;
}

