anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool startProductSurvey() {
    const std::uint64_t actionStartedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (!productSurveyWorkerReady ||
        productSurveyControl() != ProductSurveyWorkerControl::Idle ||
        productSurveyWorkerTaskHandle == nullptr) {
        productSurveyRuntime.status = "worker_unavailable";
        lastRuntimeEvent = productSurveyRuntime.status;
        return false;
    }
    productSurveyRuntime = {};
    productSurveyTimeline.reset();
    productSurveyRuntime.status = "preparing";
    productSurveyRuntime.selected = true;
    productSurveyRuntime.selectedSourceMask =
        surveySourceController.selectedMask();
    productSurveyRuntime.timelineStatus = "preparing";
    if (productSurveyRuntime.selectedSourceMask == 0) {
        productSurveyRuntime.status = "source_plan_empty";
        productSurveyRuntime.timelineStatus = "invalid_mask";
        lastRuntimeEvent = productSurveyRuntime.status;
        return false;
    }
    productSurveyRuntime.cleanupComplete = false;
    productSurveyRuntime.workerReady = true;
    portENTER_CRITICAL(&productSurveyWorkerMux);
    productSurveyWorkerOwnedResources = appRuntime.activeResources();
    productSurveyWorkerScanActive = false;
    productSurveyWorkerControl = ProductSurveyWorkerControl::Starting;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    xTaskNotifyGive(productSurveyWorkerTaskHandle);
    productSurveyRuntime.startActionUs =
        static_cast<std::uint64_t>(esp_timer_get_time()) - actionStartedUs;
    lastRuntimeEvent = "product_survey_preparing";
    return true;
}

bool reopenProductSurveyBackendForCommit() {
    const auto required =
        leshy1::kernel::runtime::resourceMask(Resource::UiForeground) |
        leshy1::kernel::runtime::resourceMask(Resource::EspRf) |
        leshy1::kernel::runtime::resourceMask(Resource::Storage) |
        leshy1::kernel::runtime::resourceMask(Resource::RadioSpi);
    const auto ownedResources = appRuntime.activeResources();
    char enrolledFingerprint[33] = {};
    if ((ownedResources & required) != required ||
        !exactCidFingerprint(productSurveyRuntime.expectedFingerprint) ||
        !loadProductFingerprint(enrolledFingerprint,
                                sizeof(enrolledFingerprint)) ||
        std::strcmp(enrolledFingerprint,
                    productSurveyRuntime.expectedFingerprint) != 0) {
        return false;
    }

    leshy1::storage::SdTransportRunResult identity;
    for (std::uint8_t attempt = 1;
         attempt <= leshy1::storage::kProductStartMaximumIdentityAttempts;
         ++attempt) {
        BoardSdSpiTransport identityTransport;
        const bool identityBegun = identityTransport.begin();
        identity = {};
        if (identityBegun) {
            leshy1::storage::SdTransportRunPolicy policy;
            policy.allowPhysical = true;
            policy.explicitlySelected = true;
            policy.identificationOnly = true;
            policy.ownedResources = ownedResources;
            identity = leshy1::storage::runSdIdentificationStateMachine(
                leshy1::storage::defaultSdIdentificationPlan(),
                identityTransport, policy);
            identityTransport.end();
        }
        productSurveyRuntime.identityAttempts = attempt;
        productSurveyRuntime.identityTransientRetries =
            static_cast<std::uint8_t>(attempt - 1U);
        productSurveyRuntime.identityStatus = identity.status;
        productSurveyRuntime.identityCleanupComplete =
            identityTransport.cleanupComplete();
        formatCidFingerprint(identity.identity,
                             productSurveyRuntime.observedFingerprint,
                             sizeof(productSurveyRuntime.observedFingerprint));
        if (productSurveyRuntime.identityCleanupComplete &&
            identity.status ==
                leshy1::storage::SdTransportRunStatus::Valid) {
            break;
        }
        const leshy1::storage::ProductStartIdentityRetryEvidence retryEvidence{
            true,
            true,
            true,
            (ownedResources & required) == required,
            identityTransport.physicalSpiStarted(),
            identity.status,
            std::strcmp(productSurveyRuntime.observedFingerprint,
                        "00000000000000000000000000000000") == 0,
            productSurveyRuntime.identityCleanupComplete,
            false,
        };
        if (!leshy1::storage::shouldRetryProductStartIdentity(
                retryEvidence, attempt)) {
            break;
        }
        vTaskDelay(pdMS_TO_TICKS(
            leshy1::storage::productStartIdentityRetryDelayMs(attempt)));
    }
    if (!productSurveyRuntime.identityCleanupComplete ||
        identity.status != leshy1::storage::SdTransportRunStatus::Valid ||
        std::strcmp(productSurveyRuntime.expectedFingerprint,
                    productSurveyRuntime.observedFingerprint) != 0) {
        return false;
    }

    productSurveyRuntime.filesystemAttempted = true;
    if (!productSurveyFilesystem.begin()) return false;
    productSurveyRuntime.cardCapacityBytes =
        productSurveyFilesystem.cardCapacityBytes();
    productSurveyRuntime.cachedFreeBytes =
        productSurveyFilesystem.cachedFreeBytes();
    const bool capacityMatched =
        productSurveyRuntime.cardCapacityBytes != 0 &&
        productSurveyRuntime.cardCapacityBytes == identity.identity.capacityBytes;
    const bool rootExists = productSurveyFilesystem.exists(
        leshy1::storage::kProductSessionStoreRoot);

    leshy1::storage::MediaIdentity media;
    media.present = capacityMatched;
    media.kind = leshy1::storage::MediaKind::Sd;
    media.fingerprint = productSurveyRuntime.observedFingerprint;
    media.capacityBytes = productSurveyRuntime.cardCapacityBytes;
    media.freeBytes = productSurveyRuntime.cachedFreeBytes;
    leshy1::storage::ProductStoreRequest storeRequest;
    storeRequest.operation =
        leshy1::storage::ProductStoreOperation::CommitSession;
    storeRequest.explicitlySelected = true;
    storeRequest.expectedFingerprint =
        productSurveyRuntime.expectedFingerprint;
    storeRequest.rootPath = leshy1::storage::kProductSessionStoreRoot;
    storeRequest.rootExists = rootExists;
    storeRequest.driverWriteEnabled = true;
    storeRequest.requiredBytes = kProductSurveyCommitBytes;
    storeRequest.reserveBytes = kProductSurveyReserveBytes;
    storeRequest.ownedResources = ownedResources;
    const leshy1::storage::ProductStorePermit storePermit =
        leshy1::storage::authorizeProductStore(media, storeRequest);
    productSurveyRuntime.storeStatus = storePermit.status;
    if (!storePermit.allowed() ||
        !productSurveyStore.selectDrive(productSurveyFilesystem.driveNumber()) ||
        !productSurveyStore.openExistingWritable(storePermit)) {
        return false;
    }
    surveyStoreRouter.bind(productSurveyStore);
    productSurveyRuntime.backendOpen = true;
    productSurveyRuntime.cleanupComplete = false;
    return true;
}

