anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
SurveyPipelineStatus stopProductSurvey() {
    if (!reopenProductSurveyBackendForCommit()) {
        const bool cleanup = closeProductSurveyBackend();
        productSurveyRuntime.status = cleanup
            ? "commit_backend_failed" : "cleanup_failed";
        lastRuntimeEvent = productSurveyRuntime.status;
        return SurveyPipelineStatus::WorkflowRejected;
    }
    const SurveyPipelineStatus status = surveyPipeline.stopAndCommit(
        static_cast<std::uint64_t>(esp_timer_get_time()));
    const bool cleanup = closeProductSurveyBackend();
    productSurveyRuntime.status =
        status == SurveyPipelineStatus::Committed
            ? (cleanup ? "committed" : "cleanup_failed")
            : (cleanup ? "commit_failed" : "cleanup_failed");
    lastRuntimeEvent = productSurveyRuntime.status;
    return status;
}

void releaseProductSurveyAfterTerminal(const char* status, bool returnHome);

bool requestProductSurveyWorkerStop(bool cancel) {
    const std::uint64_t actionStartedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    const ProductSurveyWorkerControl control = productSurveyControl();
    if (control != ProductSurveyWorkerControl::Starting &&
        control != ProductSurveyWorkerControl::Running) {
        return false;
    }
    const bool scanWasActive = productSurveyScanActive();
    setProductSurveyControl(
        cancel ? ProductSurveyWorkerControl::CancelRequested
               : ProductSurveyWorkerControl::StopRequested);
    if (cancel) {
        productSurveyRuntime.cancelRequestedDuringScan = scanWasActive;
    }
    productSurveyRuntime.status = cancel ? "cancelling" : "stopping";
    productSurveyRuntime.stopActionUs =
        static_cast<std::uint64_t>(esp_timer_get_time()) - actionStartedUs;
    lastRuntimeEvent = cancel ? "product_survey_cancelling"
                              : "product_survey_stopping";
    BoardWifiPassiveScanner::cancelActiveScan();
    BoardBlePassiveScanner::cancelActiveScan();
    if (productSurveyWorkerTaskHandle != nullptr) {
        xTaskNotifyGive(productSurveyWorkerTaskHandle);
    }
    return true;
}

bool requestProductSurveyWorkerPause() {
    const std::uint64_t actionStartedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (productSurveyControl() != ProductSurveyWorkerControl::Running) {
        return false;
    }
    setProductSurveyControl(ProductSurveyWorkerControl::PauseRequested);
    productSurveyRuntime.status = "pausing";
    productSurveyRuntime.stopActionUs =
        static_cast<std::uint64_t>(esp_timer_get_time()) - actionStartedUs;
    lastRuntimeEvent = "product_survey_pausing";
    BoardWifiPassiveScanner::cancelActiveScan();
    BoardBlePassiveScanner::cancelActiveScan();
    if (productSurveyWorkerTaskHandle != nullptr) {
        xTaskNotifyGive(productSurveyWorkerTaskHandle);
    }
    return true;
}

bool commitPausedProductSurvey() {
    if (productSurveyControl() != ProductSurveyWorkerControl::Paused) {
        return false;
    }
    const SurveyPipelineStatus committed = stopProductSurvey();
    if (committed == SurveyPipelineStatus::Committed) {
        constexpr ProductSurveyWorkerControl terminalControl =
            ProductSurveyWorkerControl::Idle;
        setProductSurveyControl(terminalControl);
        return true;
    }
    releaseProductSurveyAfterTerminal("commit_failed", true);
    return false;
}

bool applyProductSurveyTimelineStatus(
    SourceTimelineStatus status, SourceTimelineStatus expected,
    const char* stage = "unspecified", std::uint64_t eventUs = 0) {
    productSurveyRuntime.timelineStatus =
        leshy1::services::survey::sourceTimelineStatusName(status);
    if (status != expected) {
        if (std::strcmp(productSurveyRuntime.timelineFailureStatus, "none") == 0) {
            productSurveyRuntime.timelineFailureStatus =
                productSurveyRuntime.timelineStatus;
            productSurveyRuntime.timelineFailureStage = stage;
            productSurveyRuntime.timelineFailureEventUs = eventUs;
            productSurveyRuntime.timelineFailureLatestUs =
                productSurveyTimeline.latestUs();
        }
        productSurveyRuntime.timelineHealthy = false;
    }
    return status == expected;
}

bool drainProductSurveyTimelineWindows() {
    leshy1::services::survey::SourceWindow window;
    while (true) {
        const SourceTimelineStatus dequeued = productSurveyTimeline.pop(&window);
        if (dequeued == SourceTimelineStatus::Empty) return true;
        if (dequeued != SourceTimelineStatus::WindowDequeued) {
            productSurveyRuntime.timelineArchiveStatus =
                leshy1::services::survey::sourceTimelineStatusName(dequeued);
            if (std::strcmp(productSurveyRuntime.timelineFailureStatus,
                            "none") == 0) {
                productSurveyRuntime.timelineFailureStatus =
                    productSurveyRuntime.timelineArchiveStatus;
                productSurveyRuntime.timelineFailureStage = "archive_pop";
                productSurveyRuntime.timelineFailureLatestUs =
                    productSurveyTimeline.latestUs();
            }
            productSurveyRuntime.timelineHealthy = false;
            return false;
        }
        const auto archived = surveySession.appendTimelineWindow(window);
        productSurveyRuntime.timelineArchiveStatus =
            leshy1::services::survey::sessionTimelineStatusName(archived);
        if (archived !=
            leshy1::services::survey::SessionTimelineStatus::Appended) {
            if (std::strcmp(productSurveyRuntime.timelineFailureStatus,
                            "none") == 0) {
                productSurveyRuntime.timelineFailureStatus =
                    productSurveyRuntime.timelineArchiveStatus;
                productSurveyRuntime.timelineFailureStage = "archive_append";
                productSurveyRuntime.timelineFailureEventUs = window.endedUs;
                productSurveyRuntime.timelineFailureLatestUs =
                    productSurveyTimeline.latestUs();
            }
            productSurveyRuntime.timelineHealthy = false;
            return false;
        }
        ++productSurveyRuntime.timelineArchivedWindows;
        window = {};
    }
}

