anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool recordProductSurveyTimelineDrops(RadioKind source, std::uint16_t count,
                                      std::uint64_t monotonicUs) {
    for (std::uint16_t index = 0; index < count; ++index) {
        const SourceTimelineStatus status =
            productSurveyTimeline.recordObservation(
                source, false, monotonicUs);
        if (!applyProductSurveyTimelineStatus(
                status, SourceTimelineStatus::ObservationRecorded,
                "driver_drop", monotonicUs)) {
            return false;
        }
    }
    return true;
}

bool drainProductSurveyWorkerObservations() {
    if (productSurveyObservations == nullptr ||
        surveyWorkflow.state() != SurveyWorkflowState::Running) {
        return false;
    }
    bool changed = false;
    Observation observation;
    while (xQueueReceive(productSurveyObservations, &observation, 0) == pdTRUE) {
        const SurveyPipelineStatus queued = surveyPipeline.enqueue(observation);
        const bool accepted = queued == SurveyPipelineStatus::Queued;
        const SourceTimelineStatus timelineStatus =
            productSurveyTimeline.recordObservation(
                observation.radio, accepted, observation.monotonicUs);
        if (!applyProductSurveyTimelineStatus(
                timelineStatus, SourceTimelineStatus::ObservationRecorded,
                "observation", observation.monotonicUs)) {
            productSurveyRuntime.status = "timeline_record_failed";
            lastRuntimeEvent = productSurveyRuntime.status;
        }
        changed = queued == SurveyPipelineStatus::Queued || changed;
        observation = {};
    }
    if (changed) {
        changed = surveyPipeline.drain(
            leshy1::services::survey::ObservationQueue::kCapacity) ==
            SurveyPipelineStatus::Drained;
    }
    return changed;
}

bool closeProductSurveyScanWindow(
    const ProductSurveyWorkerEvent& event,
    SourceWindowState nextState = SourceWindowState::Scheduled,
    SourceWindowReason nextReason = SourceWindowReason::DutyCycle) {
    if (event.scanStartedUs == 0 || event.scanEndedUs < event.scanStartedUs) {
        return true;
    }
    drainProductSurveyWorkerObservations();
    if (!productSurveyRuntime.timelineHealthy) return false;
    if (!recordProductSurveyTimelineDrops(event.source, event.scanDropped,
                                          event.scanEndedUs)) {
        return false;
    }
    const SourceTimelineStatus status = productSurveyTimeline.transition(
        event.source, nextState, nextReason, event.scanEndedUs);
    return applyProductSurveyTimelineStatus(
               status, SourceTimelineStatus::Transitioned,
               nextState == SourceWindowState::Fault
                   ? "scan_fault_close"
                   : nextState == SourceWindowState::Unavailable
                         ? "scan_unavailable_close" : "scan_close",
               event.scanEndedUs) &&
           drainProductSurveyTimelineWindows();
}

int hexNibble(char value) {
    if (value >= '0' && value <= '9') return value - '0';
    if (value >= 'a' && value <= 'f') return value - 'a' + 10;
    if (value >= 'A' && value <= 'F') return value - 'A' + 10;
    return -1;
}

CaptureMetadata productCaptureMetadata(std::uint8_t selectedSourceMask) {
    CaptureMetadata metadata;
    metadata.present = true;
    metadata.passive = true;
    metadata.selectedSourceMask = selectedSourceMask;
    const auto wifiPlan = leshy1::drivers::wifi::defaultPassivePlan();
    if ((selectedSourceMask & leshy1::services::survey::sourceMask(
            RadioKind::Wifi)) != 0) {
        metadata.wifiShowHidden = wifiPlan.showHidden;
        metadata.wifiMaxMsPerChannel = wifiPlan.maxMsPerChannel;
        metadata.wifiChannel = wifiPlan.channel;
    }
    const auto blePlan = leshy1::drivers::ble::defaultPassivePlan();
    if ((selectedSourceMask & leshy1::services::survey::sourceMask(
            RadioKind::Ble)) != 0) {
        metadata.bleDurationMs = blePlan.durationMs;
        metadata.bleIntervalMs = blePlan.intervalMs;
        metadata.bleWindowMs = blePlan.windowMs;
        metadata.bleMaximumRecords = blePlan.maximumRecords;
    }
    if (std::strlen(runningAppElfSha256) ==
        metadata.appIdentity.size() * 2U) {
        bool valid = true;
        for (std::size_t index = 0; index < metadata.appIdentity.size(); ++index) {
            const int high = hexNibble(runningAppElfSha256[index * 2U]);
            const int low = hexNibble(runningAppElfSha256[index * 2U + 1U]);
            if (high < 0 || low < 0) {
                valid = false;
                break;
            }
            metadata.appIdentity[index] = static_cast<std::uint8_t>(
                (static_cast<unsigned>(high) << 4U) |
                static_cast<unsigned>(low));
        }
        if (valid) {
            metadata.appIdentityLength = metadata.appIdentity.size();
        }
    }
    return metadata;
}

CaptureMetadata productWifiFrameCaptureMetadata() {
    CaptureMetadata metadata = productCaptureMetadata(
        leshy1::services::survey::sourceMask(RadioKind::Wifi));
    const auto& plan = wifiFrameCapture.capture().plan();
    const auto& stats = wifiFrameCapture.stats();
    metadata.wifiShowHidden = false;
    metadata.wifiMaxMsPerChannel = plan.channelDwellMs;
    metadata.wifiChannel = plan.channel;
    metadata.framePayloadCaptured = true;
    metadata.framePayloadBytes = stats.payloadBytes;
    metadata.framePayloadRecords = static_cast<std::uint16_t>(
        wifiFrameCapture.capture().size());
    metadata.framePayloadSnapLength = plan.snapLength;
    metadata.framePayloadFormat = FramePayloadFormat::Ieee80211;
    return metadata;
}

void runCaptureStoreWorker(void*) {
    CaptureStoreEvent event;
    event.status = "store_failed";
    bool identityCleanupComplete = true;
    bool filesystemAttempted = false;
    leshy1::storage::SdTransportRunResult identity;
    char expectedFingerprint[33] = {};
    char observedFingerprint[33] = {};
    do {
        const auto required =
            leshy1::kernel::runtime::resourceMask(Resource::UiForeground) |
            leshy1::kernel::runtime::resourceMask(Resource::Storage) |
            leshy1::kernel::runtime::resourceMask(Resource::RadioSpi);
        const auto owned = resourceBroker.ownedBy(AppRuntime::kForegroundOwner);
        if ((owned & required) != required) {
            event.status = "resources_missing";
            break;
        }
        if (!loadProductFingerprint(expectedFingerprint,
                                    sizeof(expectedFingerprint))) {
            event.status = "enrollment_missing";
            break;
        }
        for (std::uint8_t attempt = 1;
             attempt <= leshy1::storage::kProductStartMaximumIdentityAttempts;
             ++attempt) {
            BoardSdSpiTransport transport;
            const bool begun = transport.begin();
            identity = {};
            if (begun) {
                leshy1::storage::SdTransportRunPolicy policy;
                policy.allowPhysical = true;
                policy.explicitlySelected = true;
                policy.identificationOnly = true;
                policy.ownedResources = owned;
                identity = leshy1::storage::runSdIdentificationStateMachine(
                    leshy1::storage::defaultSdIdentificationPlan(), transport,
                    policy);
                transport.end();
            }
            identityCleanupComplete = transport.cleanupComplete();
            formatCidFingerprint(identity.identity, observedFingerprint,
                                 sizeof(observedFingerprint));
            if (identityCleanupComplete &&
                identity.status ==
                    leshy1::storage::SdTransportRunStatus::Valid) {
                break;
            }
            const leshy1::storage::ProductStartIdentityRetryEvidence evidence{
                true, true, exactCidFingerprint(expectedFingerprint),
                (owned & required) == required,
                transport.physicalSpiStarted(), identity.status,
                std::strcmp(observedFingerprint,
                            "00000000000000000000000000000000") == 0,
                identityCleanupComplete, filesystemAttempted,
            };
            if (!leshy1::storage::shouldRetryProductStartIdentity(
                    evidence, attempt)) {
                break;
            }
            vTaskDelay(pdMS_TO_TICKS(
                leshy1::storage::productStartIdentityRetryDelayMs(attempt)));
        }
        if (!identityCleanupComplete ||
            identity.status != leshy1::storage::SdTransportRunStatus::Valid) {
            event.status = "identity_failed";
            break;
        }
        if (std::strcmp(expectedFingerprint, observedFingerprint) != 0) {
            event.status = "fingerprint_mismatch";
            break;
        }
        filesystemAttempted = true;
        if (!productSurveyFilesystem.begin()) {
            event.status = "mount_failed";
            break;
        }
        const std::uint64_t cardCapacity =
            productSurveyFilesystem.cardCapacityBytes();
        const std::uint64_t cachedFree =
            productSurveyFilesystem.cachedFreeBytes();
        const bool rootExists = productSurveyFilesystem.exists(
            leshy1::storage::kProductSessionStoreRoot);
        leshy1::storage::MediaIdentity media;
        media.present = cardCapacity != 0 &&
            cardCapacity == identity.identity.capacityBytes;
        media.kind = leshy1::storage::MediaKind::Sd;
        media.fingerprint = observedFingerprint;
        media.capacityBytes = cardCapacity;
        media.freeBytes = cachedFree;
        leshy1::storage::ProductStoreRequest request;
        request.operation =
            leshy1::storage::ProductStoreOperation::CommitSession;
        request.explicitlySelected = true;
        request.expectedFingerprint = expectedFingerprint;
        request.rootPath = leshy1::storage::kProductSessionStoreRoot;
        request.rootExists = rootExists;
        request.driverWriteEnabled = true;
        request.requiredBytes = kProductSurveyCommitBytes;
        request.reserveBytes = kProductSurveyReserveBytes;
        request.ownedResources = owned;
        const leshy1::storage::ProductStorePermit permit =
            leshy1::storage::authorizeProductStore(media, request);
        if (!permit.allowed()) {
            event.status =
                leshy1::storage::productStoreAccessStatusName(permit.status);
            break;
        }
        if (!productSurveyStore.selectDrive(
                productSurveyFilesystem.driveNumber()) ||
            !productSurveyStore.openExistingWritable(permit)) {
            event.status = "store_open_failed";
            break;
        }

