anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    if (!identityBegun || identity.status !=
                              leshy1::storage::SdTransportRunStatus::Valid) {
        productBootRecovery.status = "identity_failed";
    } else if (!productBootRecovery.fingerprintMatched) {
        productBootRecovery.status = "fingerprint_mismatch";
    } else if (!mounted || !productBootRecovery.readOnlyGuaranteed) {
        productBootRecovery.status = "readonly_mount_failed";
    } else if (!permit.allowed()) {
        productBootRecovery.status =
            leshy1::storage::productStoreAccessStatusName(permit.status);
    } else if (!productBootRecovery.opened) {
        productBootRecovery.status = "open_failed";
    } else if (productBootRecovery.catalogAdmitted) {
        productBootRecovery.status = "admitted";
        libraryDemoReady = true;
    } else {
        productBootRecovery.status =
            leshy1::apps::library::sessionCatalogStatusName(
                productBootRecovery.catalog.status);
    }
    if (!productBootRecovery.cleanupComplete) {
        productBootRecovery.status = "cleanup_failed";
    }
}

bool IRAM_ATTR recordProductBootRecoveryTimeout() {
    if (__atomic_exchange_n(&productBootRecoveryWatchdogArmed, 0,
                            __ATOMIC_ACQ_REL) == 0) {
        return false;
    }
    if (productBootRetryRtcMagic == kProductBootRetryRtcMagic &&
        productBootRetryRestarts <
            leshy1::storage::kProductBootMaximumAttempts) {
        ++productBootRetryRestarts;
        ++productBootRetryTimeouts;
    }
    return true;
}

extern "C" void IRAM_ATTR esp_task_wdt_isr_user_handler() {
    // The Task WDT ISR is the last-resort path when the scheduler-based
    // watchdog cannot run. Only claim the already armed recovery attempt and
    // retain its reason; the configured panic path performs the reset.
    recordProductBootRecoveryTimeout();
}

void watchProductBootRecovery(void*) {
    delay(leshy1::storage::kProductBootRecoveryWatchdogMs);
    if (recordProductBootRecoveryTimeout()) {
        // Recovery may hold filesystem or console locks. Do not log, flush,
        // or run shutdown handlers here; retain the reason in RTC and force a
        // digital restart from this independent task.
        esp_restart_noos();
    }
    vTaskDelete(nullptr);
}

bool armProductBootRecoveryWatchdog() {
    productBootRecoveryTaskWatchdogAdded = false;
    const esp_err_t taskWatchdogStatus = esp_task_wdt_status(nullptr);
    if (taskWatchdogStatus == ESP_ERR_NOT_FOUND) {
        if (esp_task_wdt_add(nullptr) != ESP_OK) return false;
        productBootRecoveryTaskWatchdogAdded = true;
    } else if (taskWatchdogStatus != ESP_OK) {
        return false;
    }
    if (esp_task_wdt_reset() != ESP_OK) {
        if (productBootRecoveryTaskWatchdogAdded) {
            esp_task_wdt_delete(nullptr);
            productBootRecoveryTaskWatchdogAdded = false;
        }
        return false;
    }
    __atomic_store_n(&productBootRecoveryWatchdogArmed, 1,
                     __ATOMIC_RELEASE);
    productBootRecoveryWatchdogTask = nullptr;
    if (xTaskCreatePinnedToCore(
            watchProductBootRecovery, "leshy-sd-boot-watch", 2048, nullptr, 3,
            &productBootRecoveryWatchdogTask, 0) != pdPASS) {
        __atomic_store_n(&productBootRecoveryWatchdogArmed, 0,
                         __ATOMIC_RELEASE);
        productBootRecoveryWatchdogTask = nullptr;
        if (productBootRecoveryTaskWatchdogAdded) {
            esp_task_wdt_delete(nullptr);
            productBootRecoveryTaskWatchdogAdded = false;
        }
        return false;
    }
    return true;
}

bool disarmProductBootRecoveryWatchdog() {
    __atomic_store_n(&productBootRecoveryWatchdogArmed, 0,
                     __ATOMIC_RELEASE);
    TaskHandle_t task = productBootRecoveryWatchdogTask;
    productBootRecoveryWatchdogTask = nullptr;
    if (task != nullptr) vTaskDelete(task);
    if (!productBootRecoveryTaskWatchdogAdded) return true;
    productBootRecoveryTaskWatchdogAdded = false;
    return esp_task_wdt_delete(nullptr) == ESP_OK;
}

void recoverProductCatalogAtBoot() {
    const bool softwareReset =
        bootMetrics.resetReason == static_cast<std::uint32_t>(ESP_RST_SW);
    const bool watchdogReset =
        bootMetrics.resetReason == static_cast<std::uint32_t>(ESP_RST_PANIC) ||
        bootMetrics.resetReason == static_cast<std::uint32_t>(ESP_RST_INT_WDT) ||
        bootMetrics.resetReason == static_cast<std::uint32_t>(ESP_RST_TASK_WDT) ||
        bootMetrics.resetReason == static_cast<std::uint32_t>(ESP_RST_WDT);
    const bool retryReset = leshy1::storage::isProductBootRetryReset(
        softwareReset, watchdogReset, productBootRetryTimeouts > 0);
    std::uint32_t currentAppIdentity = 0;
    const esp_app_desc_t* appDescription = esp_app_get_description();
    if (appDescription != nullptr &&
        appDescription->magic_word == ESP_APP_DESC_MAGIC_WORD) {
        std::memcpy(&currentAppIdentity, appDescription->app_elf_sha256,
                    sizeof(currentAppIdentity));
    }
    if (leshy1::storage::shouldResetProductBootRetryState(
            retryReset,
            productBootRetryRtcMagic == kProductBootRetryRtcMagic,
            currentAppIdentity != 0,
            productBootRetryAppIdentity == currentAppIdentity)) {
        productBootRetryRtcMagic = kProductBootRetryRtcMagic;
        productBootRetryRestarts = 0;
        productBootRetryAppIdentity = currentAppIdentity;
        productBootRetryTimeouts = 0;
        productBootWatchdogTestRtcState = 0;
    }
    char expectedFingerprint[33] = {};
    if (!loadProductFingerprint(expectedFingerprint,
                                sizeof(expectedFingerprint))) {
        productBootRecovery = {};
        productBootRecovery.status = "unenrolled";
        productBootRecovery.cleanupComplete = true;
        productBootRetryRestarts = 0;
        productBootRetryTimeouts = 0;
        return;
    }
    if (productBootRetryRestarts >=
        leshy1::storage::kProductBootMaximumAttempts) {
        productBootRecovery = {};
        productBootRecovery.status = "recovery_timeout_exhausted";
        productBootRecovery.enrolled = true;
        std::snprintf(productBootRecovery.expectedFingerprint,
                      sizeof(productBootRecovery.expectedFingerprint), "%s",
                      expectedFingerprint);
        productBootRecovery.attempts =
            leshy1::storage::kProductBootMaximumAttempts;
        productBootRecovery.transientRetries = static_cast<std::uint8_t>(
            leshy1::storage::kProductBootMaximumAttempts - 1U);
        productBootRecovery.timeoutRestarts = static_cast<std::uint8_t>(
            productBootRetryTimeouts);
        productBootRecovery.cleanupComplete = false;
        productBootRetryRestarts = 0;
        productBootRetryTimeouts = 0;
        return;
    }
    if (!armProductBootRecoveryWatchdog()) {
        productBootRecovery = {};
        productBootRecovery.status = "recovery_watchdog_unavailable";
        productBootRecovery.enrolled = true;
        std::snprintf(productBootRecovery.expectedFingerprint,
                      sizeof(productBootRecovery.expectedFingerprint), "%s",
                      expectedFingerprint);
        productBootRecovery.attempts = static_cast<std::uint8_t>(
            productBootRetryRestarts + 1U);
        productBootRecovery.transientRetries = static_cast<std::uint8_t>(
            productBootRetryRestarts);
        productBootRecovery.timeoutRestarts = static_cast<std::uint8_t>(
            productBootRetryTimeouts);
        productBootRecovery.cleanupComplete = true;
        productBootRetryRestarts = 0;
        productBootRetryTimeouts = 0;
        return;
    }
    if (productBootWatchdogTestRtcState ==
        kProductBootWatchdogTestRtcMagic) {
        productBootWatchdogTestRtcState = 0;
        TaskHandle_t softwareWatchdog = productBootRecoveryWatchdogTask;
        productBootRecoveryWatchdogTask = nullptr;
        if (softwareWatchdog != nullptr) vTaskDelete(softwareWatchdog);
        for (;;) delay(1000);
    }
    recoverProductCatalogForFingerprint(expectedFingerprint, true);
    if (!disarmProductBootRecoveryWatchdog()) {
        productBootRecovery.status = "recovery_watchdog_cleanup_failed";
        productBootRecovery.cleanupComplete = false;
    }
    const std::uint8_t completedAttempts = static_cast<std::uint8_t>(
        productBootRetryRestarts + 1U);
    productBootRecovery.attempts = completedAttempts;
    productBootRecovery.transientRetries = static_cast<std::uint8_t>(
        productBootRetryRestarts);
    productBootRecovery.timeoutRestarts = static_cast<std::uint8_t>(
        productBootRetryTimeouts);
    const leshy1::storage::ProductBootRetryEvidence retryEvidence{
        std::strcmp(productBootRecovery.status, "identity_failed") == 0,
        productBootRecovery.enrolled,
        exactCidFingerprint(productBootRecovery.expectedFingerprint),
        std::strcmp(
            productBootRecovery.observedFingerprint,
            "00000000000000000000000000000000") == 0,
        productBootRecovery.fingerprintMatched,
        productBootRecovery.mountedReadOnly,
        productBootRecovery.rootExists,
        productBootRecovery.opened,
        productBootRecovery.catalogAdmitted,
        productBootRecovery.permitStatus ==
            leshy1::storage::ProductStoreAccessStatus::MissingMedia,
        productBootRecovery.cleanupComplete,
        productBootRecovery.blockedWriteAttempts,
        productBootRecovery.ownedAfter,
    };
    if (leshy1::storage::shouldRetryProductBootRecovery(
            retryEvidence, completedAttempts)) {
        ++productBootRetryRestarts;
        char line[320] = {};
        std::snprintf(
            line, sizeof(line),
            "{\"schema\":\"leshy.storage.product_boot_retry.v1\","
            "\"kind\":\"restart\",\"reason\":\"transient_missing_media\","
            "\"completed_attempts\":%u,\"next_attempt\":%u,"
            "\"delay_ms\":%lu,\"blocked_write_attempts\":0,"
            "\"owned_after\":0,\"cleanup_complete\":true}",
            static_cast<unsigned>(completedAttempts),
            static_cast<unsigned>(completedAttempts + 1U),
            static_cast<unsigned long>(
                leshy1::storage::productBootRetryDelayMs(completedAttempts)));
        broadcast(line);
        Serial.flush();
        Serial0.flush();
        delay(leshy1::storage::productBootRetryDelayMs(completedAttempts));
        esp_restart();
        return;
    }
    productBootRetryRestarts = 0;
    productBootRetryTimeouts = 0;
}

void emitProductBootRecovery(Stream& reply) {
    char line[1024] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.storage.product_boot_recovery.v1\","
        "\"kind\":\"state\",\"status\":\"%s\",\"enrolled\":%s,"
        "\"expected_fingerprint\":\"%s\",\"observed_fingerprint\":\"%s\","
        "\"fingerprint_matched\":%s,\"mounted_read_only\":%s,"
        "\"read_only_guaranteed\":%s,\"write_enabled\":false,"
        "\"blocked_write_attempts\":%lu,\"product_root\":\"%s\","
        "\"root_exists\":%s,\"permit_status\":\"%s\",\"opened\":%s,"
        "\"catalog_status\":\"%s\",\"catalog_admitted\":%s,"
        "\"generation\":%lu,\"observations\":%u,"
        "\"integrity\":\"%s\",\"attempts\":%u,\"transient_retries\":%u,"
        "\"timeout_restarts\":%u,"
        "\"owned_during\":%lu,\"owned_after\":%lu,"
        "\"cleanup_complete\":%s,\"physical_write_calls\":0}",
        productBootRecovery.status,
        productBootRecovery.enrolled ? "true" : "false",
        productBootRecovery.expectedFingerprint,
        productBootRecovery.observedFingerprint,
        productBootRecovery.fingerprintMatched ? "true" : "false",
        productBootRecovery.mountedReadOnly ? "true" : "false",
        productBootRecovery.readOnlyGuaranteed ? "true" : "false",
        static_cast<unsigned long>(productBootRecovery.blockedWriteAttempts),
        leshy1::storage::kProductSessionStoreRoot,
        productBootRecovery.rootExists ? "true" : "false",
        leshy1::storage::productStoreAccessStatusName(
            productBootRecovery.permitStatus),
        productBootRecovery.opened ? "true" : "false",
        leshy1::apps::library::sessionCatalogStatusName(
            productBootRecovery.catalog.status),
        productBootRecovery.catalogAdmitted ? "true" : "false",
        static_cast<unsigned long>(productBootRecovery.catalog.generation),
        static_cast<unsigned>(productBootRecovery.catalog.observations),
        leshy1::apps::library::sessionIntegrityName(
            productBootRecovery.catalog.integrity),
        static_cast<unsigned>(productBootRecovery.attempts),
        static_cast<unsigned>(productBootRecovery.transientRetries),
        static_cast<unsigned>(productBootRecovery.timeoutRestarts),
        static_cast<unsigned long>(productBootRecovery.ownedDuring),
        static_cast<unsigned long>(productBootRecovery.ownedAfter),
        productBootRecovery.cleanupComplete ? "true" : "false");
    reply.println(line);
}

void triggerProductBootWatchdogTest(Stream& reply) {
    if (!productBootRecovery.catalogAdmitted ||
        appRuntime.activeResources() != 0 ||
        productBootRecovery.ownedAfter != 0) {
        reply.println(
            "{\"schema\":\"leshy.storage.product_boot_watchdog_test.v1\","
            "\"kind\":\"result\",\"status\":\"not_ready\"}");
        return;
    }
    productBootWatchdogTestRtcState = kProductBootWatchdogTestRtcMagic;
    reply.println(
        "{\"schema\":\"leshy.storage.product_boot_watchdog_test.v1\","
        "\"kind\":\"armed\",\"status\":\"ready\","
        "\"filesystem_write_attempted\":false,"
        "\"physical_write_calls\":0}");
    reply.flush();
    delay(50);
    esp_restart();
}

