anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    if (uiController.page() == 6) {
        if (selfTestController.view() == SelfTestView::ModeMenu) {
            return {back, choose, enter};
        }
        if (selfTestController.view() == SelfTestView::Preflight) {
            return {{NavigationKey::Left, UiTextId::NavModes}, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavStart}};
        }
        if (selfTestController.view() == SelfTestView::VisualCheck) {
            return {{NavigationKey::Left, UiTextId::NavCancel}, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavNext}};
        }
        if (selfTestController.view() == SelfTestView::ActiveChecks) {
            return {{NavigationKey::Left, UiTextId::NavCancel}, {}, {}};
        }
        return {{NavigationKey::Left, UiTextId::NavModes}, {}, {}};
    }
    return {back, {}, {}};
}

void renderNavigationKey(NavigationKey key, Rect bounds) {
    const std::int16_t centerX = bounds.x + bounds.width / 2;
    const std::int16_t centerY = bounds.y + 6;
    if (key == NavigationKey::Left) {
        display.fillTriangle(centerX - 5, centerY, centerX + 3, centerY - 5,
                             centerX + 3, centerY + 5, Palette::Focus);
    } else if (key == NavigationKey::UpDown) {
        display.fillTriangle(centerX - 9, centerY + 1, centerX - 4,
                             centerY - 5, centerX + 1, centerY + 1,
                             Palette::Focus);
        display.fillTriangle(centerX + 3, centerY - 1, centerX + 8,
                             centerY + 5, centerX + 13, centerY - 1,
                             Palette::Focus);
    } else if (key == NavigationKey::RightAndSelect) {
        display.setTextColor(Palette::Focus, Palette::Surface);
        selectUiFont(UiTextRole::Meta);
        const char* ok = tr(UiTextId::NavOk);
        const std::int16_t okWidth = display.textWidth(ok);
        setUiCursor(UiTextRole::Meta, centerX - okWidth - 3,
                    bounds.y - 1);
        display.print(ok);
        display.fillTriangle(centerX + 5, centerY - 5, centerX + 5,
                             centerY + 5, centerX + 13, centerY,
                             Palette::Focus);
    }
}

void renderNavigationCell(std::uint8_t index, NavigationCell cell) {
    if (cell.key == NavigationKey::None || cell.label == UiTextId::Count) return;
    const Rect bounds = Components::navigationCell(index);
    display.fillRoundRect(bounds.x, bounds.y, bounds.width, bounds.height,
                          Layout::Radius, Palette::Surface);
    renderNavigationKey(cell.key, bounds);
    const char* label = tr(cell.label);
    selectUiFont(UiTextRole::Meta);
    const std::int16_t labelWidth = display.textWidth(label);
    display.setTextColor(Palette::TextSecondary, Palette::Surface);
    setUiCursor(UiTextRole::Meta,
                bounds.x + (bounds.width - labelWidth) / 2,
                bounds.y + 11);
    display.print(label);
}

void renderNavigationFooter() {
    const Rect hint = Components::footerHint();
    display.fillRect(hint.x, hint.y, hint.width, hint.height, Palette::Canvas);
    const NavigationFooter footer = navigationFooterForCurrentState();
    renderNavigationCell(0, footer.left);
    renderNavigationCell(1, footer.middle);
    renderNavigationCell(2, footer.right);
}

std::uint16_t toneColor(Tone tone) {
    switch (tone) {
        case Tone::Focus:
            return Palette::Focus;
        case Tone::Positive:
            return Palette::Positive;
        case Tone::Warning:
            return Palette::Warning;
        case Tone::Danger:
            return Palette::Danger;
        case Tone::Muted:
            return Palette::TextMuted;
        case Tone::Neutral:
        default:
            return Palette::TextSecondary;
    }
}

void renderHeader(const char* title, bool clearContent) {
    const Rect header = Components::header();
    display.fillRect(header.x, header.y, header.width, header.height,
                     Palette::Header);
    if (clearContent) {
        display.fillRect(0, header.y + header.height, Layout::ScreenWidth,
                         Layout::ScreenHeight - header.height,
                         Palette::Canvas);
    }
    display.setTextColor(Palette::TextPrimary, Palette::Header);
    display.setTextFont(4);
    activeDisplayFont = ActiveDisplayFont::None;
    display.setCursor(10, 9);
    display.print("LESHY 1.x");
    display.setTextColor(Palette::TextSecondary, Palette::Canvas);
    const Rect titleBounds = Components::title();
    setUiCursor(UiTextRole::Body, titleBounds.x + 2, titleBounds.y);
    display.print(title);
}

void renderFocusCue(Rect bounds, bool selected) {
    if (!selected) return;
    display.drawRoundRect(bounds.x, bounds.y, bounds.width, bounds.height,
                          Layout::Radius, Palette::Focus);
    const Rect marker = Components::focusMarker(bounds);
    display.fillTriangle(marker.x, marker.y,
                         marker.x, marker.y + marker.height,
                         marker.x + marker.width,
                         marker.y + marker.height / 2,
                         Palette::Focus);
}

void renderMenuRow(Rect bounds, const char* label, const char* note,
                   bool selected, bool enabled, Tone noteTone) {
    const std::uint16_t background = selected
        ? (enabled ? Palette::SurfaceFocus : Palette::SurfaceFocusDisabled)
        : Palette::Surface;
    display.fillRoundRect(bounds.x, bounds.y, bounds.width, bounds.height,
                          Layout::Radius, background);
    renderFocusCue(bounds, selected);
    display.setTextColor(selected ? Palette::Focus : Palette::TextSecondary,
                         background);
    setUiCursor(UiTextRole::Body, bounds.x + 10, bounds.y - 3);
    display.print(label);
    display.setTextColor(enabled ? toneColor(noteTone) : Palette::TextMuted,
                         background);
    setUiCursor(UiTextRole::Meta, bounds.x + 10, bounds.y + 11);
    display.print(note);
}

