anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void renderMetric(std::uint8_t index, const char* text,
                  Tone tone = Tone::Neutral) {
    const Rect bounds = Components::metricRow(index);
    display.setTextColor(toneColor(tone), Palette::Canvas);
    setUiCursor(UiTextRole::Body, bounds.x + 2, bounds.y - 2);
    display.print(text);
}

void renderStateCard(const char* state, const char* detail, Tone tone,
                     std::uint8_t step) {
    const Rect bounds = Components::stateCard();
    display.fillRoundRect(bounds.x, bounds.y, bounds.width, bounds.height,
                          Layout::Radius, Palette::Surface);
    display.drawRoundRect(bounds.x, bounds.y, bounds.width, bounds.height,
                          Layout::Radius, toneColor(tone));
    display.drawRect(bounds.x + 12, bounds.y + 15, 18, 18, toneColor(tone));
    display.setTextColor(toneColor(tone), Palette::Surface);
    setUiCursor(UiTextRole::Body, bounds.x + 40, bounds.y + 10);
    display.print(state);
    display.setTextColor(Palette::TextSecondary, Palette::Surface);
    setUiCursor(UiTextRole::Meta, bounds.x + 16, bounds.y + 50);
    display.print(detail);
    char line[40] = {};
    std::snprintf(line, sizeof(line), tr(UiTextId::VisualStepFormat),
                  static_cast<unsigned>(step + 1U));
    display.setTextColor(Palette::TextMuted, Palette::Surface);
    setUiCursor(UiTextRole::Meta, bounds.x + 16, bounds.y + 78);
    display.print(line);
}

UiTextId homeLabel(const AppMenuItem& item) {
    if (std::strcmp(item.id, "diagnostics") == 0) return UiTextId::AppDiagnostics;
    if (std::strcmp(item.id, "survey") == 0) return UiTextId::AppSurvey;
    if (std::strcmp(item.id, "library") == 0) return UiTextId::AppLibrary;
    if (std::strcmp(item.id, "capture") == 0) return UiTextId::AppCapture;
    if (std::strcmp(item.id, "language") == 0) return UiTextId::AppLanguage;
    return UiTextId::AppSelfTest;
}

UiTextId homeNote(const AppMenuItem& item) {
    if (std::strcmp(item.id, "survey") == 0) {
        if (item.simulated) return UiTextId::NoteSurveySimulated;
        if (!item.enabled) return UiTextId::NoteSurveyUnavailable;
        if (std::strcmp(item.reason, "passive / persistent") == 0) {
            return UiTextId::NoteSurveyPersistent;
        }
    }
    if (std::strcmp(item.id, "library") == 0) {
        if (item.simulated) return UiTextId::NoteLibrarySimulated;
        if (!item.enabled) return UiTextId::NoteLibraryUnavailable;
    }
    if (std::strcmp(item.id, "capture") == 0) {
        return item.enabled ? UiTextId::NoteCaptureReady
                            : UiTextId::NoteCaptureUnavailable;
    }
    if (std::strcmp(item.id, "language") == 0) return UiTextId::NoteLanguage;
    if (std::strcmp(item.id, "self-test") == 0) return UiTextId::NoteSelfTest;
    return UiTextId::Ready;
}

constexpr std::uint8_t kVisibleHomeRows = 3;

std::uint8_t homeFirstVisible(std::uint8_t selection) {
    return selection < kVisibleHomeRows
               ? 0U
               : static_cast<std::uint8_t>(selection -
                                           (kVisibleHomeRows - 1U));
}

void renderHomeRow(std::uint8_t index, std::uint8_t firstVisible) {
    const AppMenuItem* item = appCatalog.get(index);
    if (item == nullptr) return;
    if (index < firstVisible || index >= firstVisible + kVisibleHomeRows) return;
    const Rect bounds = Components::homeRow(
        static_cast<std::uint8_t>(index - firstVisible));
    const bool selected = uiController.selection() == index;
    renderMenuRow(bounds, tr(homeLabel(*item)), tr(homeNote(*item)), selected,
                  item->enabled,
                  item->enabled ? Tone::Positive : Tone::Muted);
}

void renderHome(bool clearContent) {
    renderHeader(tr(UiTextId::HomeTitle), clearContent);
    const std::uint8_t first = homeFirstVisible(uiController.selection());
    const std::size_t end = appCatalog.size() < first + kVisibleHomeRows
                                ? appCatalog.size()
                                : first + kVisibleHomeRows;
    for (std::uint8_t i = first; i < end; ++i) {
        renderHomeRow(i, first);
    }
}

void runShieldReceiverSelfTestProbe() {
    shieldReceiverProbeReport = {};
    shieldReceiverProbeReport.profileDeclared = BoardProfile::kRfShieldDeclared;
    shieldReceiverProbeReport.gpsExcludedByProfile = !BoardProfile::kGpsDeclared;
    shieldReceiverProbeReport.pn532ExcludedByProfile = !BoardProfile::kPn532Declared;
    const auto radioSpi = leshy1::kernel::runtime::resourceMask(Resource::RadioSpi);
    if (!resourceBroker.acquire(AppRuntime::kForegroundOwner, radioSpi)) {
        leshy1::drivers::radio::finalizeShieldReceiverProbe(
            &shieldReceiverProbeReport);
        return;
    }
    BoardShieldReceiverProbe probe;
    probe.run(resourceBroker.ownerOf(Resource::RadioSpi) ==
                  AppRuntime::kForegroundOwner,
              &shieldReceiverProbeReport);
    resourceBroker.release(AppRuntime::kForegroundOwner, radioSpi);
    shieldReceiverProbeReport.resourceReleased =
        resourceBroker.ownerOf(Resource::RadioSpi) ==
        leshy1::kernel::runtime::kNoOwner;
}

SelfTestFacts snapshotSelfTestFacts() {
    std::uint32_t inputQueueDrops = 0;
    portENTER_CRITICAL(&physicalInputMux);
    inputQueueDrops = physicalInputQueueDrops;
    portEXIT_CRITICAL(&physicalInputMux);

    const CapabilityRecord* profile = inventory.find("board.profile");
    const CapabilityRecord* persistentSurvey =
        inventory.find("survey.persistent_passive");
    const CapabilityRecord* passiveBle = inventory.find("radio.ble");
    const CapabilityRecord* passiveWifiCapture =
        inventory.find("capture.wifi_passive");
    const CapabilityRecord* persistentLibrary =
        inventory.find("library.persistent_session");
    const CapabilityRecord* persistentWifiCapture =
        inventory.find("capture.wifi_persistent");
    const auto uiOnly = leshy1::kernel::runtime::resourceMask(
        Resource::UiForeground);
    SelfTestFacts facts;
    facts.buildIdentityPresent = std::strlen(runningAppElfSha256) == 64;
    facts.profileMatched = profile != nullptr &&
                           profile->state == CapabilityState::Available;
    facts.displayReady = bootMetrics.displayReadyUs != 0;
    facts.touchFrontendReady = boardTouchInput.ready();
    facts.inputFrontendReady = physicalInputTaskStarted &&
                               bootMetrics.inputDetected;
    facts.inputQueueHealthy = physicalInputEvents != nullptr &&
                              inputQueueDrops == 0;
    facts.buzzerInactive = BoardSafeOutputs::buzzerHeldInactive();
    facts.heapFree = ESP.getFreeHeap();
    facts.heapMinimum = ESP.getMinFreeHeap();
    facts.inputQueueDrops = inputQueueDrops;
    facts.activeResources = appRuntime.activeResources();
    facts.resourceScopeClean = facts.activeResources == uiOnly;
    facts.persistentSurveyReady = persistentSurvey != nullptr &&
        persistentSurvey->state == CapabilityState::Available;
    facts.passiveBleReady = passiveBle != nullptr &&
        passiveBle->state == CapabilityState::Available;
    facts.passiveWifiCaptureReady = passiveWifiCapture != nullptr &&
        passiveWifiCapture->state == CapabilityState::Available;
    facts.enrolledStorageReady = productBootRecovery.enrolled &&
        productBootRecovery.fingerprintMatched &&
        productBootRecovery.catalogAdmitted &&
        productBootRecovery.readOnlyGuaranteed &&
        productBootRecovery.cleanupComplete &&
        productBootRecovery.ownedAfter == 0;
    facts.persistentLibraryReady = persistentLibrary != nullptr &&
        persistentLibrary->state == CapabilityState::Available;
    facts.persistentWifiCaptureReady = persistentWifiCapture != nullptr &&
        persistentWifiCapture->state == CapabilityState::Available;
    facts.gpsDeclared = BoardProfile::kGpsDeclared;
    facts.pn532Declared = BoardProfile::kPn532Declared;
    facts.irDeclared = BoardProfile::kIrDeclared;
    facts.shieldReceiversApplicable = BoardProfile::kRfShieldDeclared;
    facts.shieldReceiverProbeComplete =
        shieldReceiverProbeReport.status == ShieldReceiverProbeStatus::Pass ||
        shieldReceiverProbeReport.status == ShieldReceiverProbeStatus::Partial ||
        shieldReceiverProbeReport.status == ShieldReceiverProbeStatus::Failed;
    facts.shieldReceiverProbePassed =
        shieldReceiverProbeReport.status == ShieldReceiverProbeStatus::Pass &&
        shieldReceiverProbeReport.resourceReleased &&
        shieldReceiverProbeReport.cleanupComplete;
    facts.nrf24SpectrumExerciseComplete = fullGuidedRfState.nrf24Complete;
    facts.nrf24SpectrumExercisePassed = fullGuidedRfState.nrf24Passed;
    facts.cc1101SpectrumExerciseComplete = fullGuidedRfState.cc1101Complete;
    facts.cc1101SpectrumExercisePassed = fullGuidedRfState.cc1101Passed;
    facts.persistentRecoveryAuditComplete =
        fullGuidedArtifactState.recoveryComplete;
    facts.persistentRecoveryAuditPassed =
        fullGuidedArtifactState.recoveryPassed;
    facts.libraryExportAuditComplete = fullGuidedArtifactState.libraryComplete;
    facts.libraryExportAuditPassed = fullGuidedArtifactState.libraryPassed;
    facts.capturePcapAuditComplete = fullGuidedArtifactState.captureComplete;
    facts.capturePcapAuditApplicable =
        fullGuidedArtifactState.captureApplicable;
    facts.capturePcapAuditPassed = fullGuidedArtifactState.capturePassed;
    facts.disposableCommitComplete =
        fullGuidedArtifactState.disposableCommitComplete;
    facts.disposableCommitPassed =
        fullGuidedArtifactState.disposableCommitPassed;
    facts.disposableRemountComplete =
        fullGuidedArtifactState.disposableRemountComplete;
    facts.disposableRemountPassed =
        fullGuidedArtifactState.disposableRemountPassed;
    facts.disposableExportComplete =
        fullGuidedArtifactState.disposableExportComplete;
    facts.disposableExportPassed =
        fullGuidedArtifactState.disposableExportPassed;
    facts.disposableCleanupComplete =
        fullGuidedArtifactState.disposableCleanupComplete;
    facts.disposableCleanupPassed =
        fullGuidedArtifactState.disposableCleanupPassed &&
        fullGuidedArtifactState.productVerifyComplete &&
        fullGuidedArtifactState.productVerifyPassed;
    facts.disposableStorageWriteCalls =
        fullGuidedArtifactState.disposableStorageWriteCalls;
    facts.disposableStorageWriteBytes =
        fullGuidedArtifactState.disposableStorageWriteBytes;
    return facts;
}

void renderLanguageRow(std::uint8_t index) {
    const UiTextId labels[2] = {UiTextId::LanguageEnglish,
                                UiTextId::LanguageRussian};
    const UiTextId notes[2] = {UiTextId::LanguageEnglishNote,
                               UiTextId::LanguageRussianNote};
    if (index >= 2) return;
    renderMenuRow(Components::choiceRow(index), tr(labels[index]),
                  tr(notes[index]), languageController.selection() == index,
                  true,
                  languageController.active() ==
                          (index == 0 ? UiLanguage::English
                                      : UiLanguage::Russian)
                      ? Tone::Positive
                      : Tone::Neutral);
}

