anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
UiTextId surveySourceLabel(const SurveySourceOption& source) {
    return source.kind == SurveySourceKind::Wifi
        ? UiTextId::SourceWifiRow : UiTextId::SourceBleRow;
}

UiTextId surveySourceNote(const SurveySourceOption& source) {
    if (source.state == SurveySourceState::Available) {
        return source.selected ? UiTextId::SourceOnReady
                               : UiTextId::SourceOffReady;
    }
    if (source.state == SurveySourceState::Conflicted) {
        return UiTextId::SourceConflicted;
    }
    if (source.state == SurveySourceState::Fault) {
        return UiTextId::SourceFault;
    }
    return UiTextId::SourceDriverPending;
}

Rect surveyPlanRowBounds(std::uint8_t index) {
    return Components::choiceRow(index);
}

void renderSurveyPlanRow(std::uint8_t index) {
    if (index >= SurveySourceController::kPlanItemCount) return;
    char note[48] = {};
    const bool selected = surveySourceController.selection() == index;
    if (index == 0) {
        if (surveySourceController.simulatedPreview() &&
            surveySourceController.selectedCount() == 0) {
            std::snprintf(note, sizeof(note), "%s", tr(UiTextId::SourcesPreview));
        } else {
            std::snprintf(note, sizeof(note), tr(UiTextId::SourcesCountFormat),
                          static_cast<unsigned>(
                              surveySourceController.selectedCount()),
                          static_cast<unsigned>(
                              SurveySourceController::kSourceCount));
        }
        renderMenuRow(surveyPlanRowBounds(index), tr(UiTextId::PlanSources),
                      note, selected, true, Tone::Positive);
        return;
    }
    if (index == 1) {
        const bool available = BoardProfile::kRfShieldDeclared &&
            !BoardProfile::kGpsDeclared && !BoardProfile::kPn532Declared;
        renderMenuRow(surveyPlanRowBounds(index), tr(UiTextId::PlanSpectrum),
                      tr(available ? UiTextId::SpectrumReady
                                   : UiTextId::SpectrumUnavailable),
                      selected, available,
                      available ? Tone::Positive : Tone::Warning);
        return;
    }
    const bool preparing =
        std::strcmp(productSurveyRuntime.status, "preparing") == 0;
    const bool cancelling =
        std::strcmp(productSurveyRuntime.status, "cancelling") == 0;
    const bool ready = surveySourceController.canStart() &&
                       !preparing && !cancelling;
    const UiTextId startNote = preparing
        ? UiTextId::StartPreparing
        : (cancelling
               ? UiTextId::StartCancelling
               : (!ready
                      ? UiTextId::StartNeedsSource
                      : (surveySourceController.simulatedPreview()
                             ? UiTextId::StartPreview
                             : UiTextId::StartReady)));
    renderMenuRow(surveyPlanRowBounds(index), tr(UiTextId::PlanStart),
                  tr(startNote), selected, ready,
                  ready ? Tone::Positive : Tone::Warning);
}

void renderSurveySourceRow(std::uint8_t index) {
    const SurveySourceOption* source = surveySourceController.get(index);
    if (source == nullptr) return;
    const bool selected = surveySourceController.selection() == index;
    renderMenuRow(Components::choiceRow(index), tr(surveySourceLabel(*source)),
                  tr(surveySourceNote(*source)), selected,
                  source->available(),
                  source->selected ? Tone::Positive : Tone::Muted);
}

void renderRfSpectrumSourceRow(std::uint8_t index) {
    if (index >= 2) return;
    const bool selected = rfSpectrumSelection == index;
    const bool available = BoardProfile::kRfShieldDeclared &&
        !BoardProfile::kGpsDeclared && !BoardProfile::kPn532Declared;
    renderMenuRow(Components::choiceRow(index),
                  tr(index == 0 ? UiTextId::SpectrumNrf24
                                : UiTextId::SpectrumCc1101),
                  tr(available ? UiTextId::SpectrumRxReady
                               : UiTextId::SpectrumUnavailable),
                  selected, available,
                  available ? Tone::Positive : Tone::Muted);
}

void renderRfSpectrumSourceMenu(bool clearContent) {
    renderHeader(tr(UiTextId::SpectrumSources), clearContent);
    renderRfSpectrumSourceRow(0);
    renderRfSpectrumSourceRow(1);
    display.setTextColor(Palette::Positive, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 207);
    display.print(tr(UiTextId::SpectrumRxOnly));
}

std::uint16_t spectrumTone(std::uint8_t intensity) {
    if (intensity < 24U) return Palette::TextMuted;
    if (intensity < 96U) return Palette::Positive;
    if (intensity < 176U) return Palette::Focus;
    if (intensity < 232U) return Palette::Warning;
    return Palette::Danger;
}

void renderNrf24SpectrumPlot() {
    constexpr std::int16_t kPlotX = Layout::Edge;
    constexpr std::int16_t kPlotY = 94;
    constexpr std::int16_t kPlotWidth = Layout::ContentWidth;
    constexpr std::int16_t kPlotHeight = 80;
    display.fillRect(kPlotX, kPlotY, kPlotWidth, kPlotHeight,
                     Palette::Surface);
    for (std::int16_t x = 0; x < kPlotWidth; ++x) {
        const std::size_t bin = static_cast<std::size_t>(x) *
            Nrf24SpectrumController::kChannelCount / kPlotWidth;
        const std::uint8_t intensity = nrf24SpectrumController.intensity(bin);
        const std::int16_t height = intensity == 0
            ? 1
            : static_cast<std::int16_t>(1 +
                  static_cast<std::uint32_t>(intensity) *
                      (kPlotHeight - 2) / 255U);
        display.drawFastVLine(kPlotX + x, kPlotY + kPlotHeight - height,
                              height, spectrumTone(intensity));
    }
    display.drawRect(kPlotX, kPlotY, kPlotWidth, kPlotHeight,
                     Palette::Divider);
    display.setTextColor(Palette::TextMuted, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, kPlotX, 177);
    display.print(tr(UiTextId::SpectrumAxisFirst));
    setUiCursor(UiTextRole::Meta, 105, 177);
    display.print(tr(UiTextId::SpectrumAxisMiddle));
    setUiCursor(UiTextRole::Meta, 202, 177);
    display.print(tr(UiTextId::SpectrumAxisLast));
}

void renderNrf24SpectrumMetrics() {
    char line[64] = {};
    display.fillRect(Layout::Edge, 78, Layout::ContentWidth, 15,
                     Palette::Canvas);
    const Nrf24SpectrumViewState state = nrf24SpectrumController.state();
    const UiTextId stateText = state == Nrf24SpectrumViewState::Running
        ? UiTextId::SpectrumRunning
        : (state == Nrf24SpectrumViewState::Paused
               ? UiTextId::SpectrumPaused : UiTextId::SpectrumFault);
    display.setTextColor(state == Nrf24SpectrumViewState::Fault
                             ? Palette::Danger : Palette::Positive,
                         Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 78);
    display.print(tr(stateText));

