anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    display.fillRect(Layout::Edge, 193, Layout::ContentWidth, 41,
                     Palette::Canvas);
    std::snprintf(line, sizeof(line), tr(UiTextId::SpectrumSweepsFormat),
                  static_cast<unsigned long>(nrf24SpectrumController.sweeps()),
                  static_cast<unsigned long long>(
                      nrf24SpectrumController.totalHits()));
    display.setTextColor(Palette::TextSecondary, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 193);
    display.print(line);
    std::snprintf(line, sizeof(line), tr(UiTextId::SpectrumPeakFormat),
                  static_cast<unsigned>(2400U +
                      nrf24SpectrumController.hottestChannel()),
                  static_cast<unsigned>(nrf24SpectrumController.activeBins()));
    setUiCursor(UiTextRole::Meta, 14, 207);
    display.print(line);
    display.setTextColor(Palette::Positive, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 221);
    display.print(tr(UiTextId::SpectrumRxOnly));
}

void renderNrf24SpectrumPage(bool clearContent) {
    renderHeader(tr(UiTextId::SpectrumTitle), clearContent);
    renderNrf24SpectrumPlot();
    renderNrf24SpectrumMetrics();
}

void formatCcFrequency(std::uint32_t frequencyKHz, char* output,
                       std::size_t capacity) {
    if (output == nullptr || capacity == 0) return;
    std::snprintf(output, capacity, "%lu.%03lu",
                  static_cast<unsigned long>(frequencyKHz / 1000U),
                  static_cast<unsigned long>(frequencyKHz % 1000U));
}

void renderCc1101SpectrumPlot() {
    constexpr std::int16_t kPlotX = Layout::Edge;
    constexpr std::int16_t kPlotY = 94;
    constexpr std::int16_t kPlotWidth = Layout::ContentWidth;
    constexpr std::int16_t kPlotHeight = 80;
    display.fillRect(kPlotX, kPlotY, kPlotWidth, kPlotHeight,
                     Palette::Surface);
    for (std::int16_t x = 0; x < kPlotWidth; ++x) {
        const std::size_t bin = static_cast<std::size_t>(x) *
            Cc1101SpectrumController::kBinCount / kPlotWidth;
        const std::uint8_t intensity = cc1101SpectrumController.intensity(bin);
        const std::int16_t height = intensity == 0
            ? 1
            : static_cast<std::int16_t>(1 +
                  static_cast<std::uint32_t>(intensity) *
                      (kPlotHeight - 2) / 255U);
        display.drawFastVLine(kPlotX + x, kPlotY + kPlotHeight - height,
                              height, spectrumTone(intensity));
    }
    display.drawRect(kPlotX, kPlotY, kPlotWidth, kPlotHeight,
                     Palette::Divider);
    const Cc1101PassiveSpectrumPlan plan = cc1101SpectrumController.plan();
    char first[16] = {};
    char middle[16] = {};
    char last[16] = {};
    formatCcFrequency(plan.firstKHz, first, sizeof(first));
    formatCcFrequency(plan.firstKHz + (plan.lastKHz - plan.firstKHz) / 2U,
                      middle, sizeof(middle));
    formatCcFrequency(plan.lastKHz, last, sizeof(last));
    display.setTextColor(Palette::TextMuted, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, kPlotX, 177);
    display.print(first);
    setUiCursor(UiTextRole::Meta, 96, 177);
    display.print(middle);
    setUiCursor(UiTextRole::Meta, 185, 177);
    display.print(last);
}

void renderCc1101SpectrumMetrics() {
    char line[64] = {};
    display.fillRect(Layout::Edge, 78, Layout::ContentWidth, 15,
                     Palette::Canvas);
    const Cc1101SpectrumViewState state = cc1101SpectrumController.state();
    const UiTextId stateText = state == Cc1101SpectrumViewState::Running
        ? UiTextId::CcSpectrumRunning
        : (state == Cc1101SpectrumViewState::Paused
               ? UiTextId::CcSpectrumPaused : UiTextId::SpectrumFault);
    display.setTextColor(state == Cc1101SpectrumViewState::Fault
                             ? Palette::Danger : Palette::Positive,
                         Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 78);
    display.print(tr(stateText));

    display.fillRect(Layout::Edge, 193, Layout::ContentWidth, 41,
                     Palette::Canvas);
    std::snprintf(
        line, sizeof(line), tr(UiTextId::CcSpectrumBandFormat),
        leshy1::drivers::radio::cc1101SpectrumBandName(
            cc1101SpectrumController.band()));
    display.setTextColor(Palette::TextSecondary, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 193);
    display.print(line);
    std::snprintf(
        line, sizeof(line), tr(UiTextId::CcSpectrumSweepsFormat),
        static_cast<unsigned long>(cc1101SpectrumController.sweeps()),
        static_cast<unsigned long long>(cc1101SpectrumController.samples()));
    setUiCursor(UiTextRole::Meta, 14, 207);
    display.print(line);
    std::snprintf(
        line, sizeof(line), tr(UiTextId::CcSpectrumPeakFormat),
        static_cast<unsigned long>(cc1101SpectrumController.peakKHz()),
        static_cast<int>(cc1101SpectrumController.peakRssiDbm()));
    setUiCursor(UiTextRole::Meta, 14, 221);
    display.print(line);
}

void renderCc1101SpectrumPage(bool clearContent) {
    renderHeader(tr(UiTextId::CcSpectrumTitle), clearContent);
    renderCc1101SpectrumPlot();
    renderCc1101SpectrumMetrics();
}

void renderInventoryPage(bool clearContent) {
    char line[96] = {};
    if (rfSpectrumView == RfSpectrumView::SourceMenu) {
        renderRfSpectrumSourceMenu(clearContent);
        return;
    }
    if (rfSpectrumView == RfSpectrumView::Live) {
        if (rfSpectrumKind == RfSpectrumKind::Cc1101) {
            renderCc1101SpectrumPage(clearContent);
        } else {
            renderNrf24SpectrumPage(clearContent);
        }
        return;
    }
    if (productSurveySourceUnavailableVisible()) {
        renderHeader(tr(UiTextId::SurveyUnavailable), clearContent);
        display.setTextColor(Palette::Danger, Palette::Canvas);
        setUiCursor(UiTextRole::Body, 14, 82);
        display.print(tr(UiTextId::SourceUnavailableReason));
        display.setTextColor(Palette::TextSecondary, Palette::Canvas);
        setUiCursor(UiTextRole::Body, 14, 116);
        display.print(tr(UiTextId::NoSessionCreated));
        setUiCursor(UiTextRole::Body, 14, 150);
        display.print(tr(UiTextId::PriorLibraryPreserved));
        display.setTextColor(Palette::Positive, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 207);
        display.print(tr(UiTextId::BackNoRetry));
        return;
    }
    if (surveyWorkflow.state() == SurveyWorkflowState::Setup) {
        if (surveySourceController.view() == SurveySetupView::Sources) {
            renderHeader(tr(UiTextId::SurveySources), clearContent);
            for (std::uint8_t index = 0;
                 index < SurveySourceController::kSourceCount; ++index) {
                renderSurveySourceRow(index);
            }
        } else {
            renderHeader(tr(UiTextId::SurveySetup), clearContent);
            for (std::uint8_t index = 0;
                 index < SurveySourceController::kPlanItemCount; ++index) {
                renderSurveyPlanRow(index);
            }
        }
        if (surveySourceController.view() == SurveySetupView::Sources) {
            display.setTextColor(Palette::Positive, Palette::Canvas);
            setUiCursor(UiTextRole::Meta, 14, 207);
            display.print(surveyWorkflow.simulated()
                              ? tr(UiTextId::FifoNoRf)
                              : tr(UiTextId::FifoRxOnly));
        }
        return;
    }
    if (surveyWorkflow.state() == SurveyWorkflowState::Result) {
        renderHeader(tr(UiTextId::SurveyCommitted), clearContent);
        display.setTextColor(Palette::Focus, Palette::Canvas);
        setUiCursor(UiTextRole::Body, 14, 80);
        display.print(surveySession.id());
        display.setTextColor(Palette::TextSecondary, Palette::Canvas);
        std::snprintf(line, sizeof(line), tr(UiTextId::ObservationsFormat),
                      static_cast<unsigned>(surveySession.size()));
        setUiCursor(UiTextRole::Body, 14, 120);
        display.print(line);
        std::snprintf(line, sizeof(line), tr(UiTextId::GenerationFormat),
                      static_cast<unsigned long>(surveyWorkflow.generation()));
        setUiCursor(UiTextRole::Body, 14, 148);
        display.print(line);
        setUiCursor(UiTextRole::Body, 14, 176);
        display.print(surveyWorkflow.persistent()
                          ? tr(UiTextId::StorageProduct)
                          : tr(UiTextId::StorageRamOnly));
        const SurveyPipelineProgress progress = surveyPipeline.progress();
        std::snprintf(line, sizeof(line), tr(UiTextId::PipelineFormat),
                      static_cast<unsigned>(progress.queueHighWater),
                      static_cast<unsigned long long>(progress.dropped));
        setUiCursor(UiTextRole::Meta, 14, 196);
        display.print(line);
        display.setTextColor(Palette::Positive, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 211);
        display.print(tr(UiTextId::OneCommit));
        return;
    }
    if (surveyWorkflow.state() == SurveyWorkflowState::Error) {
        renderHeader(tr(UiTextId::SurveyError), clearContent);
        display.setTextColor(Palette::Danger, Palette::Canvas);
        setUiCursor(UiTextRole::Body, 14, 82);
        display.print(leshy1::apps::survey::surveyWorkflowStatusName(
            surveyWorkflow.lastStatus()));
        display.setTextColor(Palette::TextSecondary, Palette::Canvas);
        setUiCursor(UiTextRole::Body, 14, 122);
        display.print(tr(UiTextId::PriorLibraryPreserved));
        display.setTextColor(Palette::Positive, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 207);
        display.print(tr(UiTextId::BackNoRetry));
        return;
    }
    if (surveyController.view() == SurveyView::Filter) {
        renderHeader(tr(UiTextId::SurveyFilter), clearContent);
        for (std::uint8_t index = 0;
             index <= static_cast<std::uint8_t>(SurveyFilter::Ble); ++index) {
            renderSurveyFilterOption(index);
        }
        return;
    }
    if (surveyController.view() == SurveyView::Detail) {
        renderHeader(tr(UiTextId::SurveyDetail), clearContent);
        const Observation* observation = surveyController.selected();
        if (observation == nullptr) return;
        display.setTextFont(4);
        activeDisplayFont = ActiveDisplayFont::None;
        display.setTextColor(Palette::Focus, Palette::Canvas);
        display.setCursor(14, 88);
        display.print(observation->label.data());
        display.setTextColor(Palette::TextSecondary, Palette::Canvas);
        if (observation->radio == RadioKind::Ble) {
            setUiCursor(UiTextRole::Body, 14, 122);
            display.print(tr(UiTextId::BleSource));
            std::snprintf(
                line, sizeof(line), tr(UiTextId::BleAddressFormat),
                static_cast<unsigned>(observation->identity[0]),
                static_cast<unsigned>(observation->identity[1]),
                static_cast<unsigned>(observation->identity[2]),
                static_cast<unsigned>(observation->identity[3]),
                static_cast<unsigned>(observation->identity[4]),
                static_cast<unsigned>(observation->identity[5]));
            setUiCursor(UiTextRole::Meta, 14, 151);
            display.print(line);
        } else {
            std::snprintf(line, sizeof(line), tr(UiTextId::ChannelFormat),
                          static_cast<unsigned>(observation->channel));
            setUiCursor(UiTextRole::Body, 14, 122);
            display.print(line);
            std::snprintf(line, sizeof(line), tr(UiTextId::FrequencyFormat),
                          static_cast<unsigned long>(observation->frequencyKhz));
            setUiCursor(UiTextRole::Body, 14, 148);
            display.print(line);
        }
        std::snprintf(line, sizeof(line), tr(UiTextId::RssiFormat),
                      static_cast<int>(observation->rssiDbm));
        setUiCursor(UiTextRole::Body, 14, 174);
        display.print(line);
        const ObservationHistory history = surveyController.selectedHistory();
        if (history.valid) {
            renderRssiHistory(history);
        } else {
            display.setTextColor(Palette::Positive, Palette::Canvas);
            setUiCursor(UiTextRole::Meta, 14, 203);
            display.print(surveyWorkflow.simulated()
                              ? tr(UiTextId::SimulatedData)
                              : tr(UiTextId::RealPassive));
        }
        return;
    }

