anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
UiRenderSnapshot captureUiRenderSnapshot() {
    return {
        true,
        uiController.page(),
        uiController.selection(),
        languageController.selection(),
        static_cast<std::uint8_t>(selfTestController.view()),
        selfTestController.selection(),
        static_cast<std::uint8_t>(rfSpectrumView),
        rfSpectrumSelection,
        static_cast<std::uint8_t>(surveyWorkflow.state()),
        static_cast<std::uint8_t>(surveySourceController.view()),
        surveySourceController.selection(),
        surveySourceController.selectedMask(),
        static_cast<std::uint8_t>(surveyController.view()),
        static_cast<std::uint8_t>(surveyController.filter()),
        static_cast<std::uint8_t>(surveyController.draftFilter()),
        surveyController.filterFocused(),
        surveyController.selection(),
        surveySession.size(),
        surveyController.visibleSize(),
        static_cast<std::uint8_t>(libraryController.view()),
        libraryController.selection(),
        libraryController.size(),
    };
}

bool renderSelectionDelta() {
    if (!renderedUi.valid || renderedUi.page != uiController.page()) return false;

    if (uiController.isRoot()) {
        const std::uint8_t current = uiController.selection();
        if (renderedUi.rootSelection == current) return false;
        const std::uint8_t oldFirst =
            homeFirstVisible(renderedUi.rootSelection);
        const std::uint8_t currentFirst = homeFirstVisible(current);
        if (oldFirst != currentFirst) {
            renderHome(false);
            return true;
        }
        renderHomeRow(renderedUi.rootSelection, currentFirst);
        renderHomeRow(current, currentFirst);
        return true;
    }

    if (uiController.page() == 2 &&
        rfSpectrumView == RfSpectrumView::SourceMenu &&
        renderedUi.rfSpectrumView ==
            static_cast<std::uint8_t>(RfSpectrumView::SourceMenu)) {
        const std::uint8_t current = rfSpectrumSelection;
        if (renderedUi.rfSpectrumSelection == current) return false;
        renderRfSpectrumSourceRow(renderedUi.rfSpectrumSelection);
        renderRfSpectrumSourceRow(current);
        renderNavigationFooter();
        return true;
    }

    if (uiController.page() == 2 &&
        surveyWorkflow.state() == SurveyWorkflowState::Setup &&
        renderedUi.surveyState ==
            static_cast<std::uint8_t>(SurveyWorkflowState::Setup) &&
        renderedUi.surveySetupView ==
            static_cast<std::uint8_t>(surveySourceController.view()) &&
        renderedUi.surveySourceMask == surveySourceController.selectedMask()) {
        const std::uint8_t current = surveySourceController.selection();
        if (renderedUi.surveySetupSelection == current) return false;
        if (surveySourceController.view() == SurveySetupView::Sources) {
            renderSurveySourceRow(renderedUi.surveySetupSelection);
            renderSurveySourceRow(current);
        } else {
            renderSurveyPlanRow(renderedUi.surveySetupSelection);
            renderSurveyPlanRow(current);
        }
        renderNavigationFooter();
        return true;
    }

    if (uiController.page() == 2 &&
        surveyWorkflow.state() == SurveyWorkflowState::Running &&
        surveyController.view() == SurveyView::Filter &&
        renderedUi.surveyState ==
            static_cast<std::uint8_t>(SurveyWorkflowState::Running) &&
        renderedUi.surveyView == static_cast<std::uint8_t>(SurveyView::Filter) &&
        renderedUi.surveySize == surveySession.size()) {
        const std::uint8_t current =
            static_cast<std::uint8_t>(surveyController.draftFilter());
        if (renderedUi.surveyDraftFilter == current) return false;
        renderSurveyFilterOption(renderedUi.surveyDraftFilter);
        renderSurveyFilterOption(current);
        renderNavigationFooter();
        return true;
    }

    if (uiController.page() == 2 &&
        surveyWorkflow.state() == SurveyWorkflowState::Running &&
        surveyController.view() == SurveyView::List &&
        renderedUi.surveyState ==
            static_cast<std::uint8_t>(SurveyWorkflowState::Running) &&
        renderedUi.surveyView == static_cast<std::uint8_t>(SurveyView::List) &&
        renderedUi.surveyFilter ==
            static_cast<std::uint8_t>(surveyController.filter()) &&
        renderedUi.surveySize == surveySession.size() &&
        renderedUi.surveyVisibleSize == surveyController.visibleSize()) {
        const std::size_t current = surveyController.selection();
        const bool currentFilterFocused = surveyController.filterFocused();
        if (renderedUi.surveySelection == current &&
            renderedUi.surveyFilterFocused == currentFilterFocused) return false;
        if (renderedUi.surveyFilterFocused != currentFilterFocused) {
            renderSurveyFilterBar();
            if (!renderedUi.surveyFilterFocused) {
                renderSurveyListRow(renderedUi.surveySelection,
                                    surveyFirstVisible(renderedUi.surveySelection));
            }
            if (!currentFilterFocused) {
                renderSurveyListRow(current, surveyFirstVisible(current));
            }
            renderNavigationFooter();
            return true;
        }
        const std::size_t oldFirst =
            surveyFirstVisible(renderedUi.surveySelection);
        const std::size_t currentFirst = surveyFirstVisible(current);
        if (oldFirst == currentFirst) {
            renderSurveyListRow(renderedUi.surveySelection, currentFirst);
            renderSurveyListRow(current, currentFirst);
        } else {
            display.fillRect(Layout::Edge, kSurveyRowsY, Layout::ContentWidth, 92,
                             Palette::Canvas);
            const std::size_t end =
                surveyController.visibleSize() < currentFirst + kVisibleSurveyRows
                    ? surveyController.visibleSize()
                    : currentFirst + kVisibleSurveyRows;
            for (std::size_t index = currentFirst; index < end; ++index) {
                renderSurveyListRow(index, currentFirst);
            }
        }
        return true;
    }

    if (uiController.page() == 3 &&
        libraryController.view() == LibraryView::SessionList &&
        renderedUi.libraryView ==
            static_cast<std::uint8_t>(LibraryView::SessionList) &&
        renderedUi.librarySize == libraryController.size()) {
        const std::size_t current = libraryController.selection();
        if (renderedUi.librarySelection == current) return false;
        renderLibraryListRow(renderedUi.librarySelection);
        renderLibraryListRow(current);
        return true;
    }

    if (uiController.page() == 5) {
        const std::uint8_t current = languageController.selection();
        if (renderedUi.languageSelection == current) return false;
        renderLanguageRow(renderedUi.languageSelection);
        renderLanguageRow(current);
        return true;
    }

