anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    if (uiController.page() == 6 &&
        selfTestController.view() == SelfTestView::ModeMenu &&
        renderedUi.selfTestView ==
            static_cast<std::uint8_t>(SelfTestView::ModeMenu)) {
        const std::uint8_t current = selfTestController.selection();
        if (renderedUi.selfTestSelection == current) return false;
        renderSelfTestModeRow(renderedUi.selfTestSelection);
        renderSelfTestModeRow(current);
        return true;
    }
    return false;
}

void renderInteractiveScreen(bool clearContent) {
    std::uint64_t startedUs = static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0) startedUs = 1;
    display.startWrite();
    const bool incremental = !clearContent && renderSelectionDelta();
    if (!incremental) {
        clearContent = true;
        if (uiController.isRoot()) {
            renderHome(clearContent);
        } else if (uiController.page() == 1) {
            renderOverview(clearContent);
        } else if (uiController.page() == 2) {
            renderInventoryPage(clearContent);
        } else if (uiController.page() == 3) {
            renderLibraryPage(clearContent);
        } else if (uiController.page() == 4) {
            renderCapturePage(clearContent);
        } else if (uiController.page() == 5) {
            renderLanguagePage(clearContent);
        } else {
            renderSelfTestPage(clearContent);
        }
        const Rect divider = Components::footerDivider();
        display.drawFastHLine(divider.x, divider.y, divider.width,
                              Palette::Divider);
        renderNavigationFooter();
        // As in 0.x MenuScreen::repaint, focus movement leaves chrome untouched.
        renderInput(lastInputRaw);
    }
    display.endWrite();
    renderedUi = captureUiRenderSnapshot();
    const std::uint64_t finishedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    lastUiRenderWasIncremental = incremental;
    lastUiRenderUs = finishedUs >= startedUs ? finishedUs - startedUs : 0;
}

bool startNrf24Spectrum() {
    nrf24SpectrumController.reset();
    nrf24SpectrumReport = {};
    std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0) startedUs = 1;
    const bool owned = resourceBroker.ownerOf(Resource::RadioSpi) ==
        AppRuntime::kForegroundOwner;
    const Nrf24PassiveSpectrumPlan plan =
        leshy1::drivers::radio::defaultNrf24PassiveSpectrumPlan();
    const bool hardwareReady = boardNrf24Spectrum.begin(
        owned, plan, &nrf24SpectrumReport);
    const bool started = hardwareReady && nrf24SpectrumController.start(
        nrf24SpectrumReport.detectedModules, startedUs);
    if (!started) {
        boardNrf24Spectrum.end();
        nrf24SpectrumController.fail();
    }
    rfSpectrumKind = RfSpectrumKind::Nrf24;
    rfSpectrumView = RfSpectrumView::Live;
    nextNrf24SpectrumSweepUs = startedUs;
    lastRuntimeEvent = started ? "nrf24_spectrum_running"
                               : "nrf24_spectrum_start_failed";
    return true;
}

bool stopNrf24Spectrum(bool returnToSourceMenu) {
    const bool cleanup = boardNrf24Spectrum.end();
    if (nrf24SpectrumController.state() != Nrf24SpectrumViewState::Idle) {
        nrf24SpectrumController.stop();
    }
    rfSpectrumView = returnToSourceMenu ? RfSpectrumView::SourceMenu
                                        : RfSpectrumView::None;
    nextNrf24SpectrumSweepUs = 0;
    lastRuntimeEvent = cleanup ? "nrf24_spectrum_stopped"
                               : "nrf24_spectrum_cleanup_failed";
    return true;
}

void serviceNrf24Spectrum() {
    if (rfSpectrumView != RfSpectrumView::Live ||
        rfSpectrumKind != RfSpectrumKind::Nrf24 ||
        nrf24SpectrumController.state() !=
            Nrf24SpectrumViewState::Running) {
        return;
    }
    const std::uint64_t nowUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (nowUs < nextNrf24SpectrumSweepUs) return;
    Nrf24PassiveSweep sweep;
    const bool valid = boardNrf24Spectrum.sweep(&sweep) &&
                       nrf24SpectrumController.ingest(sweep);
    if (!valid) {
        boardNrf24Spectrum.end();
        nrf24SpectrumController.fail();
        lastRuntimeEvent = "nrf24_spectrum_runtime_fault";
        renderInteractiveScreen(true);
        return;
    }
    nextNrf24SpectrumSweepUs =
        static_cast<std::uint64_t>(esp_timer_get_time()) + 40000ULL;
    if (!uiController.isRoot() && uiController.page() == 2) {
        display.startWrite();
        renderNrf24SpectrumPlot();
        renderNrf24SpectrumMetrics();
        display.endWrite();
    }
}

bool startCc1101Spectrum() {
    cc1101SpectrumController.reset();
    cc1101SpectrumReport = {};
    std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0) startedUs = 1;
    const bool owned = resourceBroker.ownerOf(Resource::RadioSpi) ==
        AppRuntime::kForegroundOwner;
    const bool hardwareReady = boardCc1101Spectrum.begin(
        owned, &cc1101SpectrumReport);
    const bool started = hardwareReady &&
        cc1101SpectrumController.start(startedUs);
    if (!started) {
        boardCc1101Spectrum.end();
        cc1101SpectrumController.fail();
    }
    rfSpectrumKind = RfSpectrumKind::Cc1101;
    rfSpectrumView = RfSpectrumView::Live;
    lastRuntimeEvent = started ? "cc1101_spectrum_running"
                               : "cc1101_spectrum_start_failed";
    return true;
}

bool stopCc1101Spectrum(bool returnToSourceMenu) {
    const bool cleanup = boardCc1101Spectrum.end();
    if (cc1101SpectrumController.state() !=
        Cc1101SpectrumViewState::Idle) {
        cc1101SpectrumController.stop();
    }
    rfSpectrumView = returnToSourceMenu ? RfSpectrumView::SourceMenu
                                        : RfSpectrumView::None;
    lastRuntimeEvent = cleanup ? "cc1101_spectrum_stopped"
                               : "cc1101_spectrum_cleanup_failed";
    return true;
}

bool stopCurrentSpectrum(bool returnToSourceMenu) {
    return rfSpectrumKind == RfSpectrumKind::Cc1101
        ? stopCc1101Spectrum(returnToSourceMenu)
        : stopNrf24Spectrum(returnToSourceMenu);
}

void serviceCc1101Spectrum() {
    if (rfSpectrumView != RfSpectrumView::Live ||
        rfSpectrumKind != RfSpectrumKind::Cc1101 ||
        cc1101SpectrumController.state() !=
            Cc1101SpectrumViewState::Running) {
        return;
    }
    Cc1101PassiveSample sample;
    const bool valid = boardCc1101Spectrum.sample(
        cc1101SpectrumController.plan(),
        cc1101SpectrumController.nextBin(), &sample) &&
        cc1101SpectrumController.ingest(sample);
    if (!valid) {
        boardCc1101Spectrum.end();
        cc1101SpectrumController.fail();
        lastRuntimeEvent = "cc1101_spectrum_runtime_fault";
        renderInteractiveScreen(true);
        return;
    }
    if (cc1101SpectrumController.nextBin() == 0 &&
        !uiController.isRoot() && uiController.page() == 2) {
        display.startWrite();
        renderCc1101SpectrumPlot();
        renderCc1101SpectrumMetrics();
        display.endWrite();
    }
}

