anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
                      leshy1::apps::self_test::selfTestResultStatusName(
                          selfTestReport.status),
                      static_cast<unsigned>(selfTestReport.checkCount),
                      static_cast<unsigned>(selfTestReport.passed),
                      static_cast<unsigned>(selfTestReport.failed),
                      static_cast<unsigned>(selfTestReport.blocked),
                      static_cast<unsigned>(selfTestReport.notApplicable),
                      selfTestReport.readOnly ? "true" : "false",
                      fullGuidedRfStepName(fullGuidedRfState.step),
                      static_cast<unsigned>(fullGuidedRfState.cc1101Bins),
                      fullGuidedArtifactStepName(
                          fullGuidedArtifactState.step),
                      fullGuidedArtifactState.recoveryComplete
                          ? "true" : "false",
                      fullGuidedArtifactState.libraryComplete
                          ? "true" : "false",
                      fullGuidedArtifactState.captureComplete
                          ? "true" : "false",
                      static_cast<unsigned>(
                          fullGuidedArtifactState.pcapFrames));
    }
    reply.println(line);
}

void emitWifiFrameCaptureState(Stream& reply) {
    const auto stats = wifiFrameCapture.stats();
    const auto& plan = wifiFrameCapture.capture().plan();
    const std::size_t pcapBytes =
        leshy1::apps::capture::radiotapPcapSize(wifiFrameCapture.capture());
    char line[1024] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.capture.wifi_frame.v1\",\"kind\":\"state\","
        "\"state\":\"%s\",\"passive_only\":true,\"rx_only\":true,"
        "\"application_connect_calls\":0,\"application_raw_tx_calls\":0,"
        "\"physical_no_tx_verified\":false,\"storage_written\":%s,"
        "\"volatile_ram\":true,\"immutable_after_stop\":true,"
        "\"persist_state\":\"%s\",\"persist_status\":\"%s\","
        "\"persist_generation\":%lu,"
        "\"channel_plan\":%u,\"current_channel\":%u,"
        "\"duration_ms\":%lu,\"channel_dwell_ms\":%u,"
        "\"snap_length\":%u,\"maximum_frames\":%u,"
        "\"started_us\":%llu,\"ended_us\":%llu,"
        "\"frames_reported\":%lu,\"frames_accepted\":%lu,"
        "\"frames_dropped_capacity\":%lu,"
        "\"frames_dropped_invalid\":%lu,\"payload_bytes\":%lu,"
        "\"driver_error\":%ld,\"pcap_available\":%s,"
        "\"pcap_bytes\":%u,\"pcap_linktype\":127,"
        "\"pcap_timebase\":\"monotonic_us\","
        "\"cleanup_complete\":%s,\"lease_mask\":%lu}",
        leshy1::apps::capture::wifiFrameCaptureStateName(stats.state),
        capturePersistState == CapturePersistState::Saved ? "true" : "false",
        capturePersistStateName(capturePersistState), capturePersistStatus,
        static_cast<unsigned long>(capturePersistGeneration),
        static_cast<unsigned>(plan.channel),
        static_cast<unsigned>(wifiFrameCapture.currentChannel()),
        static_cast<unsigned long>(plan.durationMs),
        static_cast<unsigned>(plan.channelDwellMs),
        static_cast<unsigned>(plan.snapLength),
        static_cast<unsigned>(plan.maximumFrames),
        static_cast<unsigned long long>(stats.startedUs),
        static_cast<unsigned long long>(stats.endedUs),
        static_cast<unsigned long>(stats.framesReported),
        static_cast<unsigned long>(stats.framesAccepted),
        static_cast<unsigned long>(stats.framesDroppedCapacity),
        static_cast<unsigned long>(stats.framesDroppedInvalid),
        static_cast<unsigned long>(stats.payloadBytes),
        static_cast<long>(stats.driverError),
        pcapBytes == 0U ? "false" : "true",
        static_cast<unsigned>(pcapBytes),
        wifiFrameCapture.cleanupComplete() ? "true" : "false",
        static_cast<unsigned long>(appRuntime.activeResources()));
    reply.println(line);
}

struct StreamPcapSink final {
    Stream* stream = nullptr;
};

bool writePcapBytes(const std::uint8_t* data, std::size_t size,
                    void* context) {
    auto* sink = static_cast<StreamPcapSink*>(context);
    return sink != nullptr && sink->stream != nullptr &&
           sink->stream->write(data, size) == size;
}

void emitWifiFrameCapturePcap(Stream& reply) {
    const auto stats = wifiFrameCapture.stats();
    const std::size_t expected =
        leshy1::apps::capture::radiotapPcapSize(wifiFrameCapture.capture());
    if (stats.state != WifiFrameCaptureState::Complete || expected == 0U) {
        reply.println(
            "{\"schema\":\"leshy.capture.pcap.v1\",\"kind\":\"error\","
            "\"reason\":\"capture_not_complete\"}");
        return;
    }
    char line[320] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.capture.pcap.v1\",\"kind\":\"pcap_begin\","
        "\"bytes\":%u,\"frames\":%u,\"linktype\":127,"
        "\"timebase\":\"monotonic_us\",\"streaming\":true,"
        "\"payload_retained_by_firmware\":true,"
        "\"storage_written\":false}",
        static_cast<unsigned>(expected),
        static_cast<unsigned>(wifiFrameCapture.capture().size()));
    reply.println(line);
    reply.flush();
    StreamPcapSink sink{&reply};
    const PcapExportResult result =
        leshy1::apps::capture::writeRadiotapPcap(
            wifiFrameCapture.capture(), writePcapBytes, &sink);
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.capture.pcap.v1\",\"kind\":\"pcap_end\","
        "\"status\":\"%s\",\"bytes\":%u,\"frames\":%u,"
        "\"storage_written\":false}",
        result.valid ? "valid" : "stream_failed",
        static_cast<unsigned>(result.bytesWritten),
        static_cast<unsigned>(result.framesWritten));
    reply.println(line);
    reply.flush();
}

void emitSurveyBrowser(Stream& reply) {
    const Observation* selected = surveyController.selected();
    const ObservationHistory history = surveyController.selectedHistory();
    char line[768] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.survey.browser.v1\",\"kind\":\"state\","
        "\"view\":\"%s\",\"filter\":\"%s\",\"draft_filter\":\"%s\","
        "\"filter_focused\":%s,\"total\":%u,\"visible\":%u,"
        "\"selection\":%u,\"selected\":%s,\"selected_radio\":\"%s\","
        "\"history_valid\":%s,\"history_samples\":%u,"
        "\"history_retained\":%u,\"history_min_rssi_dbm\":%d,"
        "\"history_max_rssi_dbm\":%d,\"history_latest_rssi_dbm\":%d,"
        "\"read_only_query\":true,\"radio_touched\":false,"
        "\"storage_touched\":false}",
        leshy1::apps::survey::surveyViewName(surveyController.view()),
        leshy1::apps::survey::surveyFilterName(surveyController.filter()),
        leshy1::apps::survey::surveyFilterName(surveyController.draftFilter()),
        surveyController.filterFocused() ? "true" : "false",
        static_cast<unsigned>(surveySession.size()),
        static_cast<unsigned>(surveyController.visibleSize()),
        static_cast<unsigned>(surveyController.selection()),
        selected == nullptr ? "false" : "true",
        selected == nullptr ? "none"
                            : (selected->radio == RadioKind::Ble ? "ble" : "wifi"),
        history.valid ? "true" : "false",
        static_cast<unsigned>(history.sampleCount),
        static_cast<unsigned>(history.retainedSamples),
        static_cast<int>(history.minimumRssiDbm),
        static_cast<int>(history.maximumRssiDbm),
        static_cast<int>(history.latestRssiDbm));
    reply.println(line);
}

