anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool selectionCanRepaintInPlace(UiAction action) {
    if (action != UiAction::Up && action != UiAction::Down) return false;
    if (uiController.isRoot()) return true;
    if (uiController.page() == 2) {
        if (rfSpectrumView == RfSpectrumView::Live) return false;
        if (rfSpectrumView == RfSpectrumView::SourceMenu) return true;
        return surveyWorkflow.state() == SurveyWorkflowState::Setup ||
               (surveyWorkflow.state() == SurveyWorkflowState::Running &&
                (surveyController.view() == SurveyView::List ||
                 surveyController.view() == SurveyView::Filter));
    }
    if (uiController.page() == 3) {
        return libraryController.view() == LibraryView::SessionList;
    }
    if (uiController.page() == 5) return true;
    return uiController.page() == 6 &&
           selfTestController.view() == SelfTestView::ModeMenu;
}

bool applyUiAction(UiAction action, bool render = true) {
    const bool incrementalCandidate = selectionCanRepaintInPlace(action);
    lastUiActionUsedIncrementalRender = false;
    const auto finish = [&](bool changed) {
        lastUiActionUsedIncrementalRender = changed && incrementalCandidate;
        if (changed && render) {
            renderInteractiveScreen(!lastUiActionUsedIncrementalRender);
        }
        return changed;
    };
    const AppMenuItem* selected = appCatalog.get(uiController.selection());
    const bool wasRoot = uiController.isRoot();
    if (!wasRoot && uiController.page() == 2) {
        bool handled = false;
        bool changed = false;
        if (rfSpectrumView == RfSpectrumView::SourceMenu) {
            handled = true;
            if (action == UiAction::Up && rfSpectrumSelection != 0) {
                rfSpectrumSelection = 0;
                changed = true;
            } else if (action == UiAction::Down && rfSpectrumSelection != 1) {
                rfSpectrumSelection = 1;
                changed = true;
            } else if ((action == UiAction::Select ||
                        action == UiAction::Right) &&
                       rfSpectrumSelection == 0) {
                changed = startNrf24Spectrum();
            } else if ((action == UiAction::Select ||
                        action == UiAction::Right) &&
                       rfSpectrumSelection == 1) {
                changed = startCc1101Spectrum();
            } else if (action == UiAction::Back || action == UiAction::Left) {
                rfSpectrumView = RfSpectrumView::None;
                lastRuntimeEvent = "survey_spectrum_plan";
                changed = true;
            }
        } else if (rfSpectrumView == RfSpectrumView::Live) {
            handled = true;
            if (action == UiAction::Back || action == UiAction::Left) {
                changed = stopCurrentSpectrum(true);
            } else if (rfSpectrumKind == RfSpectrumKind::Cc1101) {
                if (action == UiAction::Up || action == UiAction::Down) {
                    const bool idled = boardCc1101Spectrum.idle();
                    changed = idled &&
                        (action == UiAction::Up
                             ? cc1101SpectrumController.previousBand()
                             : cc1101SpectrumController.nextBand());
                    lastRuntimeEvent = changed
                        ? "cc1101_spectrum_band_changed"
                        : "cc1101_spectrum_band_failed";
                } else if ((action == UiAction::Select ||
                            action == UiAction::Right) &&
                           cc1101SpectrumController.togglePause()) {
                    changed = true;
                    if (cc1101SpectrumController.state() ==
                        Cc1101SpectrumViewState::Paused) {
                        if (!boardCc1101Spectrum.idle()) {
                            boardCc1101Spectrum.end();
                            cc1101SpectrumController.fail();
                            lastRuntimeEvent =
                                "cc1101_spectrum_pause_failed";
                        } else {
                            lastRuntimeEvent = "cc1101_spectrum_paused";
                        }
                    } else {
                        lastRuntimeEvent = "cc1101_spectrum_running";
                    }
                }
            } else if ((action == UiAction::Select ||
                        action == UiAction::Right) &&
                       nrf24SpectrumController.togglePause()) {
                changed = true;
                lastRuntimeEvent = nrf24SpectrumController.state() ==
                    Nrf24SpectrumViewState::Paused
                        ? "nrf24_spectrum_paused"
                        : "nrf24_spectrum_running";
                if (nrf24SpectrumController.state() ==
                    Nrf24SpectrumViewState::Running) {
                    nextNrf24SpectrumSweepUs =
                        static_cast<std::uint64_t>(esp_timer_get_time());
                }
            }
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Setup &&
            productSurveySourceUnavailableVisible() &&
            (action == UiAction::Select || action == UiAction::Right ||
             action == UiAction::Up || action == UiAction::Down)) {
            handled = true;
            lastRuntimeEvent = "source_unavailable_waiting_back";
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Setup &&
                   surveySourceController.view() ==
                       SurveySetupView::Sources) {
            if (action == UiAction::Up) {
                handled = true;
                changed = surveySourceController.previous();
            } else if (action == UiAction::Down) {
                handled = true;
                changed = surveySourceController.next();
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                handled = true;
                const SurveySetupActivation activation =
                    surveySourceController.activate();
                changed = activation ==
                    SurveySetupActivation::SourceChanged;
                lastRuntimeEvent = leshy1::apps::survey::
                    surveySetupActivationName(activation);
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                handled = true;
                changed = surveySourceController.back();
                if (changed) lastRuntimeEvent = "survey_source_plan";
            }
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Setup &&
                   (action == UiAction::Up || action == UiAction::Down)) {
            handled = true;
            changed = action == UiAction::Up
                ? surveySourceController.previous()
                : surveySourceController.next();
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Setup &&
                   (action == UiAction::Select ||
                    action == UiAction::Right)) {
            handled = true;
            const SurveySetupActivation activation =
                surveySourceController.activate();
            lastRuntimeEvent = leshy1::apps::survey::
                surveySetupActivationName(activation);
            if (activation == SurveySetupActivation::OpenedSources) {
                changed = true;
            } else if (activation ==
                       SurveySetupActivation::OpenedSpectrum) {
                const bool available = BoardProfile::kRfShieldDeclared &&
                    !BoardProfile::kGpsDeclared &&
                    !BoardProfile::kPn532Declared;
                if (available) {
                    rfSpectrumView = RfSpectrumView::SourceMenu;
                    rfSpectrumSelection = 0;
                    changed = true;
                }
            } else if (activation ==
                       SurveySetupActivation::StartRequested) {
                if (productSurveyRuntime.selected) {
                    if (productSurveyControl() ==
                        ProductSurveyWorkerControl::Idle) {
                        changed = startProductSurvey();
                    }
                } else {
                    std::uint64_t startedUs =
                        static_cast<std::uint64_t>(esp_timer_get_time());
                    if (startedUs == 0) startedUs = 1;
                    const SurveyPipelineStatus started = surveyPipeline.start(
                        "product-wifi-preview", startedUs);
                    changed = started == SurveyPipelineStatus::Started &&
                              publishGoldenObservations(surveyPipeline);
                    lastRuntimeEvent =
                        leshy1::apps::survey::surveyPipelineStatusName(
                            changed ? surveyPipeline.lastStatus() : started);
                }
            }
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Setup &&
                   (action == UiAction::Back || action == UiAction::Left)) {
            if (productSurveyRuntime.selected &&
                productSurveyControl() != ProductSurveyWorkerControl::Idle) {
                handled = true;
                changed = requestProductSurveyWorkerStop(true);
            } else {
                surveyPipeline.cancel();
                if (productSurveyRuntime.selected) {
                    const bool cleanup = closeProductSurveyBackend();
                    productSurveyRuntime.status = cleanup ? "cancelled"
                                                           : "cleanup_failed";
                }
                lastRuntimeEvent =
                    leshy1::apps::survey::surveyPipelineStatusName(
                        surveyPipeline.lastStatus());
            }
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Running &&
                   surveyController.view() == SurveyView::Filter) {
            handled = true;
            if (action == UiAction::Up) {
                changed = surveyController.previous();
            } else if (action == UiAction::Down) {
                changed = surveyController.next();
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                changed = surveyController.activateFilter();
                if (changed) lastRuntimeEvent = "survey_filter_applied";
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                changed = surveyController.back();
                if (changed) lastRuntimeEvent = "survey_filter_cancelled";
            } else {
                handled = false;
            }
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Running &&
                   surveyController.view() == SurveyView::Detail) {
            if (action == UiAction::Back || action == UiAction::Left) {
                handled = true;
                changed = surveyController.back();
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                handled = true;
                if (productSurveyRuntime.selected) {
                    changed =
                        productSurveyControl() ==
                                ProductSurveyWorkerControl::Paused
                            ? commitPausedProductSurvey()
                            : requestProductSurveyWorkerStop(false);
                } else {
                    const SurveyPipelineStatus status =
                        surveyPipeline.stopAndCommit(
                            static_cast<std::uint64_t>(esp_timer_get_time()));
                    changed = status == SurveyPipelineStatus::Committed;
                    lastRuntimeEvent =
                        leshy1::apps::survey::surveyPipelineStatusName(status);
                }
            }
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Running &&
                   surveyController.view() == SurveyView::List) {
            if (action == UiAction::Up) {
                handled = true;
                changed = surveyController.previous();
                if (changed && surveyController.filterFocused() &&
                    productSurveyRuntime.selected &&
                    productSurveyControl() ==
                        ProductSurveyWorkerControl::Running) {
                    changed = requestProductSurveyWorkerPause() || changed;
                }
            } else if (action == UiAction::Down) {
                handled = true;
                changed = surveyController.next();
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                handled = true;
                changed = surveyController.openSelected();
            } else if ((action == UiAction::Back || action == UiAction::Left) &&
                       surveyWorkflow.state() == SurveyWorkflowState::Running) {
                if (productSurveyRuntime.selected) {
                    handled = true;
                    if (productSurveyControl() ==
                        ProductSurveyWorkerControl::Paused) {
                        releaseProductSurveyAfterTerminal("cancelled", true);
                        changed = true;
                    } else {
                        changed = requestProductSurveyWorkerStop(true);
                    }
                } else {
                    surveyPipeline.cancel();
                    lastRuntimeEvent = "survey_cancelled";
                }
            }
        }
        if (handled) {
            uiController.recordHandledAction(action);
            return finish(changed);
        }
    }
    if (!wasRoot && uiController.page() == 3) {
        bool handled = false;
        bool changed = false;
        if (libraryController.view() == LibraryView::ExportReady &&
            (action == UiAction::Back || action == UiAction::Left)) {
            handled = true;
            changed = libraryController.back();
        } else if (libraryController.view() == LibraryView::SessionDetail &&
            (action == UiAction::Back || action == UiAction::Left)) {
            handled = true;
            changed = libraryController.back();
        } else if (libraryController.view() == LibraryView::SessionDetail &&
                   (action == UiAction::Select ||
                    action == UiAction::Right)) {
            handled = true;
            changed = libraryController.requestExport();
        } else if (libraryController.view() == LibraryView::SessionList) {
            if (action == UiAction::Up) {
                handled = true;
                changed = libraryController.previous();
            } else if (action == UiAction::Down) {
                handled = true;
                changed = libraryController.next();
            } else if (action == UiAction::Select || action == UiAction::Right) {
                handled = true;
                changed = libraryController.openSelected();
            }
        }
        if (handled) {
            uiController.recordHandledAction(action);
            return finish(changed);
        }
    }
    if (!wasRoot && uiController.page() == 4) {
        const auto state = wifiFrameCapture.stats().state;
        if (state == WifiFrameCaptureState::Idle &&
            (action == UiAction::Select || action == UiAction::Right)) {
            uiController.recordHandledAction(action);
            return finish(startWifiFrameCapture());
        }
        if (state == WifiFrameCaptureState::Running &&
            (action == UiAction::Select || action == UiAction::Right)) {
            uiController.recordHandledAction(action);
            return finish(stopWifiFrameCapture());
        }
        if (state == WifiFrameCaptureState::Complete &&
            capturePersistState == CapturePersistState::Result &&
            (action == UiAction::Select || action == UiAction::Right)) {
            capturePersistState = CapturePersistState::Confirm;
            capturePersistStatus = "awaiting_confirmation";
            lastRuntimeEvent = "capture_store_confirm";
            uiController.recordHandledAction(action);
            return finish(true);
        }
        if (state == WifiFrameCaptureState::Complete &&
            capturePersistState == CapturePersistState::Confirm &&
            (action == UiAction::Select || action == UiAction::Right)) {
            uiController.recordHandledAction(action);
            return finish(requestWifiFrameCapturePersist());
        }
        if (state == WifiFrameCaptureState::Complete &&
            capturePersistState == CapturePersistState::Confirm &&
            (action == UiAction::Back || action == UiAction::Left)) {
            capturePersistState = CapturePersistState::Result;
            capturePersistStatus = "volatile";
            lastRuntimeEvent = "capture_store_cancelled";
            uiController.recordHandledAction(action);
            return finish(true);
        }
        if (state == WifiFrameCaptureState::Complete &&
            capturePersistState == CapturePersistState::Saving) {
            uiController.recordHandledAction(action);
            return finish(false);
        }
        if (action == UiAction::Back || action == UiAction::Left) {
            if (state == WifiFrameCaptureState::Running) {
                stopWifiFrameCapture();
            }
            wifiFrameCapture.reset();
            capturePersistState = CapturePersistState::Result;
            capturePersistStatus = "volatile";
            capturePersistGeneration = 0;
            nextCaptureUiRefreshUs = 0;
        }
    }
    if (!wasRoot && uiController.page() == 5) {
        bool handled = false;
        bool changed = false;
        if (action == UiAction::Up) {
            handled = true;
            changed = languageController.previous();
        } else if (action == UiAction::Down) {
            handled = true;
            changed = languageController.next();
        } else if (action == UiAction::Select || action == UiAction::Right) {
            handled = true;
            const UiLanguage requested = languageController.selected();
            const bool persisted = saveUiLanguage(requested);
            changed = persisted && languageController.apply();
            lastRuntimeEvent = persisted ? "language_persisted"
                                         : "language_persist_failed";
        }
        if (handled) {
            uiController.recordHandledAction(action);
            return finish(changed);
        }
    }
    if (!wasRoot && uiController.page() == 6) {
        bool handled = false;
        bool changed = false;
        if (selfTestController.view() == SelfTestView::ModeMenu &&
            action == UiAction::Up) {
            handled = true;
            changed = selfTestController.previousMode();
        } else if (selfTestController.view() == SelfTestView::ModeMenu &&
                   action == UiAction::Down) {
            handled = true;
            changed = selfTestController.nextMode();
        } else if (action == UiAction::Select || action == UiAction::Right) {
            handled = true;
            const std::uint64_t startedUs =
                static_cast<std::uint64_t>(esp_timer_get_time());
            const bool completesFullPlan =
                selfTestController.view() == SelfTestView::VisualCheck &&
                selfTestController.visualState() + 1U >=
                    SelfTestController::kVisualStateCount;
            if (completesFullPlan) runShieldReceiverSelfTestProbe();
            changed = selfTestController.activate(snapshotSelfTestFacts(),
                                                   startedUs);
            if (changed &&
                selfTestController.view() == SelfTestView::ActiveChecks) {
                fullGuidedRfState = {};
                fullGuidedArtifactState = {};
                fullGuidedNrf24Report = {};
                fullGuidedCc1101Report = {};
                fullGuidedRfStartAfterUs = startedUs + 500000ULL;
                lastRuntimeEvent = "self_test_active_rf_pending";
            }
            if (selfTestController.runAwaitingFinish() &&
                selfTestController.view() == SelfTestView::Result) {
                selfTestController.finishRun(
                    static_cast<std::uint64_t>(esp_timer_get_time()));
                lastRuntimeEvent = leshy1::apps::self_test::
                    selfTestResultStatusName(selfTestController.report().status);
            } else if (selfTestController.view() == SelfTestView::VisualCheck) {
                lastRuntimeEvent = "self_test_visual_check";
            } else if (selfTestController.view() ==
                       SelfTestView::ActiveChecks) {
                lastRuntimeEvent = "self_test_active_rf_pending";
            } else if (changed) {
                lastRuntimeEvent = "self_test_preflight";
            }
        } else if (action == UiAction::Back || action == UiAction::Left) {
            bool cleanupReady = true;
            if (selfTestController.view() == SelfTestView::ActiveChecks) {
                cleanupReady = cancelFullGuidedRfChecks();
            }
            changed = cleanupReady && selfTestController.back();
            handled = changed;
            if (changed) {
                lastRuntimeEvent = "self_test_modes";
            } else if (!cleanupReady) {
                handled = true;
                lastRuntimeEvent = "self_test_cancel_cleanup_failed";
            }
        }
        if (handled) {
            uiController.recordHandledAction(action);
            return finish(changed);
        }
    }
    const bool wantsLaunch = wasRoot && (action == UiAction::Select || action == UiAction::Right);
    bool openable = selected != nullptr && selected->enabled;
    LaunchStatus launchStatus = LaunchStatus::InvalidDescriptor;
    if (wantsLaunch) {
        launchStatus = selected == nullptr
                           ? LaunchStatus::InvalidDescriptor
                           : appRuntime.launch(selected->id, selected->enabled, selected->resources);
        lastRuntimeEvent = leshy1::kernel::runtime::launchStatusName(launchStatus);
        openable = launchStatus == LaunchStatus::Started;
        if (openable && selected != nullptr &&
            std::strcmp(selected->id, "language") == 0) {
            languageController.enter();
        }
        if (openable && selected != nullptr &&
            std::strcmp(selected->id, "capture") == 0) {
            wifiFrameCapture.reset();
            capturePersistState = CapturePersistState::Result;
            capturePersistStatus = "volatile";
            capturePersistGeneration = 0;
            nextCaptureUiRefreshUs = 0;
        }
        if (openable && selected != nullptr &&
            std::strcmp(selected->id, "survey") == 0) {
            if (rfSpectrumView != RfSpectrumView::None ||
                boardNrf24Spectrum.active() ||
                boardCc1101Spectrum.active()) {
                stopCurrentSpectrum(false);
            } else {
                nrf24SpectrumController.reset();
                nrf24SpectrumReport = {};
                cc1101SpectrumController.reset();
                cc1101SpectrumReport = {};
            }
            rfSpectrumKind = RfSpectrumKind::Nrf24;
            rfSpectrumSelection = 0;
            if (surveyWorkflow.state() != SurveyWorkflowState::Setup) {
                surveyPipeline.resetToSetup();
            }
            closeProductSurveyBackend();
            productSurveyRuntime = {};
            productSurveyRuntime.selected = !selected->simulated;
            productSurveyRuntime.workerReady = productSurveyWorkerReady;
            surveySourceController.rebuild(inventory, selected->simulated);
            const SurveyWorkflowStatus configured = surveyWorkflow.configure(
