anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void emitStorageContract(Stream& reply) {
    char line[256] = {};
    std::snprintf(line, sizeof(line),
                  "{\"schema\":\"leshy.storage.contract.v1\",\"kind\":\"contract\","
                  "\"head_bytes\":%u,\"head_schema\":%u,\"commit_boundaries\":6,"
                  "\"write_enabled\":false}",
                  static_cast<unsigned>(leshy1::storage::kHeadWireSize),
                  static_cast<unsigned>(leshy1::storage::kHeadSchemaVersion));
    reply.println(line);
}

void emitStorageGuard(Stream& reply) {
    char line[320] = {};
    std::snprintf(line, sizeof(line),
                  "{\"schema\":\"leshy.storage.guard.v1\",\"kind\":\"policy\","
                  "\"scratch_root\":\"%s\",\"explicit_disposable\":true,"
                  "\"exact_fingerprint\":true,\"refuse_existing_scratch\":true,"
                  "\"mount_on_boot\":false,\"format_allowed\":false,"
                  "\"write_enabled\":false}",
                  leshy1::storage::kScratchRoot);
    reply.println(line);
}

void emitStorageDiscovery(Stream& reply) {
    static char line[768] = {};
    if (storageDiscoveryReady && leshy1::storage::formatMediaDiscoveryJson(
                                     storageDiscovery, line, sizeof(line))) {
        reply.println(line);
        return;
    }
    reply.println(
        "{\"schema\":\"leshy.storage.discovery.v1\",\"kind\":\"report\","
        "\"validation\":\"failed\",\"status\":\"fault\","
        "\"mount_attempted\":false,\"write_enabled\":false,"
        "\"guard_required\":true,\"reason\":\"invalid_discovery_record\"}");
}

void emitStorageMountPolicy(Stream& reply) {
    leshy1::storage::ReadOnlyMountRequest actual;
    actual.explicitlySelected = false;
    actual.driverReadOnlyGuaranteed = BoardStorageAdapter::kDriverReadOnlyGuaranteed;
    actual.formatRequested = false;
    actual.ownedResources = 0;
    actual.conflictingOwner = false;
    const leshy1::storage::ReadOnlyMountPermit actualPermit =
        leshy1::storage::authorizeReadOnlyMountAttempt(storageDiscovery, actual);
    leshy1::storage::ReadOnlyMountRequest ifSelected = actual;
    ifSelected.explicitlySelected = true;
    const leshy1::storage::ReadOnlyMountPermit selectedPermit =
        leshy1::storage::authorizeReadOnlyMountAttempt(storageDiscovery, ifSelected);
    char line[640] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.storage.mount.policy.v1\",\"kind\":\"report\","
        "\"driver\":\"arduino_sdfs\",\"driver_read_only_guaranteed\":%s,"
        "\"explicitly_selected\":false,\"actual_status\":\"%s\","
        "\"if_selected_status\":\"%s\",\"format_requested\":false,"
        "\"required_resources\":%lu,\"owned_resources\":0,"
        "\"mount_attempted\":%s,\"execution_enabled\":false,"
        "\"write_enabled\":false,\"guard_required\":true}",
        BoardStorageAdapter::kDriverReadOnlyGuaranteed ? "true" : "false",
        leshy1::storage::readOnlyMountStatusName(actualPermit.status),
        leshy1::storage::readOnlyMountStatusName(selectedPermit.status),
        static_cast<unsigned long>(actualPermit.requiredResources),
        storageDiscovery.mountAttempted ? "true" : "false");
    reply.println(line);
}

void emitProductSurveyAdmission(Stream& reply) {
    leshy1::storage::MediaIdentity media;
    leshy1::storage::ProductStoreRequest storeRequest;
    storeRequest.operation =
        leshy1::storage::ProductStoreOperation::RecoverCatalog;
    storeRequest.rootPath = leshy1::storage::kProductSessionStoreRoot;
    storeRequest.driverReadOnlyGuaranteed =
        BoardStorageAdapter::kDriverReadOnlyGuaranteed;
    const leshy1::storage::ProductStorePermit storePermit =
        leshy1::storage::authorizeProductStore(media, storeRequest);

    leshy1::apps::survey::ProductSurveyRequest surveyRequest;
    surveyRequest.explicitStart = false;
    surveyRequest.sourceAvailable = false;
    surveyRequest.scanPlan = leshy1::drivers::wifi::defaultPassivePlan();
    surveyRequest.storePermit = storePermit;
    const leshy1::apps::survey::ProductSurveyPermit surveyPermit =
        leshy1::apps::survey::authorizeProductSurvey(surveyRequest);

    char line[1024] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.survey.product_admission.v1\","
        "\"kind\":\"policy_state\",\"status\":\"%s\","
        "\"store_status\":\"%s\",\"store_operation\":\"%s\","
        "\"store_root\":\"%s\",\"required_resources\":%lu,"
        "\"explicit_start\":false,\"passive_only\":true,"
        "\"persistent_required\":true,\"simulated_fallback\":false,"
        "\"hardware_touched\":false,\"radio_started\":false,"
        "\"storage_mounted\":false,\"storage_written\":false,"
        "\"format_allowed\":false,"
        "\"application_connect_calls\":0,"
        "\"application_raw_tx_calls\":0,"
        "\"physical_no_tx_instrumented\":false}",
        leshy1::apps::survey::productSurveyAdmissionStatusName(
            surveyPermit.status),
        leshy1::storage::productStoreAccessStatusName(storePermit.status),
        leshy1::storage::productStoreOperationName(storePermit.operation),
        leshy1::storage::kProductSessionStoreRoot,
        static_cast<unsigned long>(surveyPermit.requiredResources));
    reply.println(line);
}

void emitProductSurveySourceUnavailableTest(Stream& reply,
                                            const char* command) {
    const bool arm = std::strcmp(
        command, "survey.product.test-source-unavailable once") == 0;
    const bool clear = std::strcmp(
        command, "survey.product.test-source-unavailable clear") == 0;
    const bool safeState = productSurveyControl() ==
            ProductSurveyWorkerControl::Idle &&
        uiController.isRoot() && !appRuntime.running();
    const char* status = "invalid_request";
    if (clear && productSurveyControl() == ProductSurveyWorkerControl::Idle) {
        setProductSurveySourceUnavailableInjection(false);
        status = "cleared";
    } else if (arm && safeState) {
        setProductSurveySourceUnavailableInjection(true);
        status = "armed";
    } else if (arm) {
        status = "unsafe_state";
    }
    char line[384] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.survey.source_unavailable_test.v1\","
        "\"kind\":\"state\",\"status\":\"%s\",\"one_shot\":true,"
        "\"armed\":%s,\"worker_idle\":%s,\"ui_home\":%s,"
        "\"runtime_owner\":\"%s\",\"lease_mask\":%lu,"
        "\"hardware_touched\":false,\"source_started\":false,"
        "\"storage_mounted\":false,\"storage_written\":false}",
        status,
        productSurveySourceUnavailableInjectionArmed() ? "true" : "false",
        productSurveyControl() == ProductSurveyWorkerControl::Idle
            ? "true" : "false",
        uiController.isRoot() ? "true" : "false",
        appRuntime.activeApp(),
        static_cast<unsigned long>(appRuntime.activeResources()));
    reply.println(line);
}

