anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void emitProductSurveyRuntimeUnavailableTest(Stream& reply,
                                             const char* command) {
    const bool wifi = std::strcmp(
        command, "survey.product.test-runtime-unavailable wifi") == 0;
    const bool ble = std::strcmp(
        command, "survey.product.test-runtime-unavailable ble") == 0;
    const bool clear = std::strcmp(
        command, "survey.product.test-runtime-unavailable clear") == 0;
    const bool safeState = productSurveyControl() ==
            ProductSurveyWorkerControl::Idle &&
        uiController.isRoot() && !appRuntime.running();
    const char* status = "invalid_request";
    if (clear && productSurveyControl() == ProductSurveyWorkerControl::Idle) {
        setProductSurveyRuntimeUnavailableInjection(0);
        status = "cleared";
    } else if ((wifi || ble) && safeState) {
        setProductSurveyRuntimeUnavailableInjection(
            leshy1::services::survey::sourceMask(
                wifi ? RadioKind::Wifi : RadioKind::Ble));
        status = "armed";
    } else if (wifi || ble) {
        status = "unsafe_state";
    }
    char line[384] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.survey.runtime_unavailable_test.v1\","
        "\"kind\":\"state\",\"status\":\"%s\",\"one_shot\":true,"
        "\"armed_mask\":%u,\"worker_idle\":%s,\"ui_home\":%s,"
        "\"runtime_owner\":\"%s\",\"lease_mask\":%lu,"
        "\"hardware_touched\":false,\"storage_mounted\":false,"
        "\"storage_written\":false}",
        status,
        static_cast<unsigned>(productSurveyRuntimeUnavailableInjectionMask()),
        productSurveyControl() == ProductSurveyWorkerControl::Idle
            ? "true" : "false",
        uiController.isRoot() ? "true" : "false",
        appRuntime.activeApp(),
        static_cast<unsigned long>(appRuntime.activeResources()));
    reply.println(line);
}

void emitSdReadOnlyProtocol(Stream& reply) {
    static char line[512] = {};
    const leshy1::storage::SdReadOnlyPlan plan =
        leshy1::storage::defaultSdIdentificationPlan();
    if (leshy1::storage::formatSdReadOnlyProtocolJson(plan, line, sizeof(line))) {
        reply.println(line);
        return;
    }
    reply.println(
        "{\"schema\":\"leshy.storage.sd.protocol.v1\",\"kind\":\"report\","
        "\"status\":\"invalid_plan\",\"write_commands\":false,"
        "\"execution_enabled\":false}");
}

void emitSdIdentificationFixture(Stream& reply) {
    static char line[640] = {};
    const leshy1::storage::SdReadOnlyPlan plan =
        leshy1::storage::defaultSdIdentificationPlan();
    const leshy1::storage::SdIdentificationTranscript transcript =
        leshy1::storage::goldenSdIdentificationTranscript();
    leshy1::storage::SdIdentity identity;
    const leshy1::storage::SdIdentificationStatus status =
        leshy1::storage::parseSdIdentification(plan, transcript, &identity);
    if (status == leshy1::storage::SdIdentificationStatus::Valid &&
        leshy1::storage::formatSdIdentificationJson(identity, line, sizeof(line))) {
        reply.println(line);
        return;
    }
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.storage.sd.identification.v1\",\"kind\":\"result\","
        "\"status\":\"%s\",\"transport\":\"golden_fake\","
        "\"physical_spi_executed\":false,\"commands_executed\":0,"
        "\"write_commands\":false,\"radio_touched\":false}",
        leshy1::storage::sdIdentificationStatusName(status));
    reply.println(line);
}

void emitSdTransportFixture(Stream& reply) {
    static char line[512] = {};
    const leshy1::storage::SdReadOnlyPlan plan =
        leshy1::storage::defaultSdIdentificationPlan();
    leshy1::storage::GoldenFakeSdTransport transport;
    const leshy1::storage::SdTransportRunResult result =
        leshy1::storage::runSdIdentificationStateMachine(plan, transport);
    if (leshy1::storage::formatSdTransportRunJson(result, line, sizeof(line))) {
        reply.println(line);
        return;
    }
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.storage.sd.transport.v1\",\"kind\":\"result\","
        "\"status\":\"%s\",\"transport\":\"golden_fake\","
        "\"physical_spi_executed\":false,\"commands_attempted\":%u,"
        "\"commands_completed\":%u,\"write_commands\":false,"
        "\"radio_touched\":false}",
        leshy1::storage::sdTransportRunStatusName(result.status),
        static_cast<unsigned>(result.commandsAttempted),
        static_cast<unsigned>(result.commandsCompleted));
    reply.println(line);
}

void emitSdWireContract(Stream& reply) {
    static char line[512] = {};
    if (leshy1::storage::formatSdWireContractJson(line, sizeof(line))) {
        reply.println(line);
        return;
    }
    reply.println(
        "{\"schema\":\"leshy.storage.sd.wire.v1\",\"kind\":\"report\","
        "\"status\":\"invalid_contract\",\"execution_enabled\":false,"
        "\"physical_spi_executed\":false,\"commands_executed\":0,"
        "\"write_commands\":false,\"radio_touched\":false}");
}

void emitPhysicalSdIdentification(Stream& reply) {
    static char line[1400] = {};
    static char cidHex[33] = {};
    static char csdHex[33] = {};
    cidHex[0] = '\0';
    csdHex[0] = '\0';

    const bool idleUi = uiController.isRoot() && !appRuntime.running();
    const bool resourcesAcquired = idleUi && resourceBroker.acquire(
        kSdIdentificationOwner, leshy1::storage::kSdIdentificationResources);
    const std::uint32_t ownedDuring =
        resourceBroker.ownedBy(kSdIdentificationOwner);
    BoardSdSpiTransport transport;
    const bool adapterBegun = resourcesAcquired && transport.begin();
    leshy1::storage::SdTransportRunResult result;
    if (!idleUi) {
        result.status = leshy1::storage::SdTransportRunStatus::ResourceConflict;
    } else if (!resourcesAcquired) {
        result.status = leshy1::storage::SdTransportRunStatus::ResourcesMissing;
    } else if (!adapterBegun) {
        result.status = leshy1::storage::SdTransportRunStatus::ExchangeFailed;
        result.physicalTransport = transport.physicalSpiStarted();
    } else {
        leshy1::storage::SdTransportRunPolicy policy;
        policy.allowPhysical = true;
        policy.explicitlySelected = true;
        policy.identificationOnly = true;
        policy.ownedResources = ownedDuring;
        result = leshy1::storage::runSdIdentificationStateMachine(
            leshy1::storage::defaultSdIdentificationPlan(), transport, policy);
        transport.end();
    }
    resourceBroker.releaseAll(kSdIdentificationOwner);
    const std::uint32_t ownedAfter =
        resourceBroker.ownedBy(kSdIdentificationOwner);

