anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    if (sector0Read && !leshy1::storage::formatSdSector0Json(
                           sector0Inspection, sector0Summary,
                           sizeof(sector0Summary))) {
        std::strcpy(sector0Summary, "{}");
        status = "format_failed";
    }
    if (bootRead && !leshy1::storage::formatSdFilesystemBootJson(
                        bootInspection, bootSummary, sizeof(bootSummary))) {
        std::strcpy(bootSummary, "{}");
        status = "format_failed";
    }
    if (directoryAggregate.sectorsInspected != 0 &&
        !leshy1::storage::formatSdFat32DirectoryAggregateJson(
                             directoryAggregate, directorySummary,
                             sizeof(directorySummary))) {
        std::strcpy(directorySummary, "{}");
        status = "format_failed";
    }
    for (std::size_t index = 0; index < identity.identity.cid.size(); ++index) {
        std::snprintf(cidHex + index * 2, sizeof(cidHex) - index * 2, "%02X",
                      static_cast<unsigned>(identity.identity.cid[index]));
    }
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.storage.sd.root_cluster_metadata.v1\","
        "\"kind\":\"result\","
        "\"status\":\"%s\",\"identity_status\":\"%s\","
        "\"sector0_permit\":\"%s\",\"boot_permit\":\"%s\","
        "\"directory_permit\":\"%s\",\"wire_status\":\"%s\","
        "\"privacy_policy\":\"counts_hash_only\","
        "\"explicitly_selected\":true,\"read_only\":true,"
        "\"blocks_requested_max\":%lu,\"blocks_read\":%u,"
        "\"sector0_lba\":0,\"boot_lba\":%lu,"
        "\"directory_lba\":%lu,\"directory_cluster_sectors\":%lu,"
        "\"directory_sectors_read\":%u,"
        "\"resource_acquired\":%s,\"owned_during\":%lu,\"owned_after\":%lu,"
        "\"spi_hz\":%lu,\"bytes_clocked\":%lu,"
        "\"identity_commands_completed\":%u,\"cid_hex\":\"%s\","
        "\"capacity_bytes\":%llu,\"sector0_wire_crc16\":%u,"
        "\"boot_wire_crc16\":%u,\"last_directory_wire_crc16\":%u,"
        "\"gpio21_stable_high\":%s,\"cleanup_complete\":%s,"
        "\"mount_attempted\":false,\"filesystem_api_touched\":false,"
        "\"filesystem_metadata_read\":true,\"directory_names_retained\":false,"
        "\"directory_buffer_zeroed\":%s,\"raw_sectors_retained\":false,"
        "\"root_end_marker_seen\":%s,\"fat_chain_followed\":false,"
        "\"file_data_read\":false,\"write_commands\":false,"
        "\"format_allowed\":false,\"nrf_ce_high_events\":0,"
        "\"radio_tx_commands\":0,\"sector0\":%s,\"boot\":%s,"
        "\"directory\":%s}",
        status, leshy1::storage::sdTransportRunStatusName(identity.status),
        leshy1::storage::sdSectorReadStatusName(sector0Permit),
        leshy1::storage::sdSectorReadStatusName(bootPermit),
        leshy1::storage::sdSectorReadStatusName(directoryPermit),
        leshy1::storage::sdWireStatusName(transport.lastWireStatus()),
        static_cast<unsigned long>(2U + bootInspection.sectorsPerCluster),
        static_cast<unsigned>(transport.dataBlockReads()),
        static_cast<unsigned long>(sector0Inspection.firstPartitionLba),
        static_cast<unsigned long>(rootDirectoryLba),
        static_cast<unsigned long>(bootInspection.sectorsPerCluster),
        static_cast<unsigned>(directoryAggregate.sectorsInspected),
        resourcesAcquired ? "true" : "false",
        static_cast<unsigned long>(ownedDuring),
        static_cast<unsigned long>(ownedAfter),
        static_cast<unsigned long>(BoardProfile::kSdIdentificationSpiHz),
        static_cast<unsigned long>(transport.bytesClocked()),
        static_cast<unsigned>(identity.commandsCompleted), cidHex,
        static_cast<unsigned long long>(identity.identity.capacityBytes),
        static_cast<unsigned>(sector0WireCrc16),
        static_cast<unsigned>(bootWireCrc16),
        static_cast<unsigned>(directoryWireCrc16),
        transport.gpio21StableHigh() ? "true" : "false",
        transport.cleanupComplete() ? "true" : "false",
        directoryBufferZeroed ? "true" : "false",
        directoryAggregate.endMarkerSeen ? "true" : "false",
        sector0Summary, bootSummary, directorySummary);
    reply.println(line);
}

leshy1::storage::CommitStage resetBoundaryStage(unsigned number) {
    switch (number) {
        case 1: return leshy1::storage::CommitStage::WritePayloads;
        case 2: return leshy1::storage::CommitStage::SyncPayloads;
        case 3: return leshy1::storage::CommitStage::WriteManifest;
        case 4: return leshy1::storage::CommitStage::SyncManifest;
        case 5: return leshy1::storage::CommitStage::WriteHead;
        case 6: return leshy1::storage::CommitStage::SyncHead;
        default: return leshy1::storage::CommitStage::Complete;
    }
}

const char* resetExpectedRecovery(unsigned boundary) {
    if (boundary <= 4) return "prior_generation";
    if (boundary == 5) return "prior_or_new_generation";
    if (boundary == 6) return "new_generation";
    return "invalid";
}

bool resetRecoveredGenerationAllowed(unsigned boundary,
                                     std::uint32_t generation) {
    if (boundary >= 1 && boundary <= 4) return generation == 1;
    if (boundary == 5) return generation == 1 || generation == 2;
    return boundary == 6 && generation == 2;
}

bool prepareLittleFsResetFixture() {
    littleFsResetSession.reset();
    return littleFsResetSession.start("littlefs-reset", 1000) ==
               SessionStatus::Started &&
        appendGoldenObservations(littleFsResetSession) &&
        littleFsResetSession.stop(3000) == SessionStatus::Stopped;
}

bool computeLittleFsResetToken(const char* fingerprint, const char* runId,
                               unsigned boundary,
                               std::uint8_t output[32]) {
    if (fingerprint == nullptr || std::strlen(fingerprint) != 64 ||
        runId == nullptr || runId[0] == '\0' || output == nullptr ||
        boundary < 1 || boundary > 6) {
        return false;
    }
    const std::uint8_t separator = 0;
    const std::uint8_t boundaryByte = static_cast<std::uint8_t>(boundary);
    mbedtls_sha256_context context;
    mbedtls_sha256_init(&context);
    bool valid = mbedtls_sha256_starts(&context, 0) == 0 &&
        mbedtls_sha256_update(
            &context, reinterpret_cast<const std::uint8_t*>(fingerprint),
            std::strlen(fingerprint)) == 0 &&
        mbedtls_sha256_update(&context, &separator, 1) == 0 &&
        mbedtls_sha256_update(
            &context, reinterpret_cast<const std::uint8_t*>(runId),
            std::strlen(runId)) == 0 &&
        mbedtls_sha256_update(&context, &separator, 1) == 0 &&
        mbedtls_sha256_update(&context, &boundaryByte, 1) == 0 &&
        mbedtls_sha256_finish(&context, output) == 0;
    mbedtls_sha256_free(&context);
    return valid;
}

bool armLittleFsResetContinuity(const char* fingerprint, const char* runId,
                                unsigned boundary) {
    littleFsResetRtcState.magic = 0;
    littleFsResetRtcState.boundary = boundary;
    if (!computeLittleFsResetToken(
            fingerprint, runId, boundary, littleFsResetRtcState.token)) {
        std::memset(littleFsResetRtcState.token, 0,
                    sizeof(littleFsResetRtcState.token));
        return false;
    }
    littleFsResetRtcState.magic = kLittleFsResetRtcMagic;
    return true;
}

bool littleFsResetContinuityValid(const char* fingerprint, const char* runId,
                                  unsigned boundary) {
    std::uint8_t expected[32] = {};
    const bool computed = computeLittleFsResetToken(
        fingerprint, runId, boundary, expected);
    const bool valid = computed &&
        littleFsResetRtcState.magic == kLittleFsResetRtcMagic &&
        littleFsResetRtcState.boundary == boundary &&
        std::memcmp(expected, littleFsResetRtcState.token,
                    sizeof(expected)) == 0;
    std::memset(expected, 0, sizeof(expected));
    return valid;
}

