anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool parseSdSessionResetCommand(const char* command, const char* prefix,
                                char* fingerprint,
                                std::size_t fingerprintCapacity, char* runId,
                                std::size_t runIdCapacity,
                                unsigned* boundaryNumber) {
    if (command == nullptr || prefix == nullptr || fingerprint == nullptr ||
        runId == nullptr || boundaryNumber == nullptr ||
        fingerprintCapacity < 33 || runIdCapacity < 33 ||
        std::strncmp(command, prefix, std::strlen(prefix)) != 0) {
        return false;
    }
    char extra = '\0';
    unsigned parsedBoundary = 0;
    const int parsed = std::sscanf(
        command + std::strlen(prefix),
        "%32[0-9A-F] %32[A-Za-z0-9_-] %u %c", fingerprint, runId,
        &parsedBoundary, &extra);
    if (parsed != 3 || std::strlen(fingerprint) != 32 || runId[0] == '\0' ||
        !leshy1::storage::isSessionStoreBoundary(
            resetBoundaryStage(parsedBoundary))) {
        return false;
    }
    *boundaryNumber = parsedBoundary;
    return true;
}

void emitPhysicalSdSessionResetArm(Stream& reply,
                                   const char* expectedFingerprint,
                                   const char* runId,
                                   unsigned boundaryNumber) {
    auto& line = sdPhysicalEvidence.line;
    auto& cidHex = sdPhysicalEvidence.cidHex;
    cidHex[0] = '\0';
    const leshy1::storage::CommitStage boundary =
        resetBoundaryStage(boundaryNumber);
    const bool idleUi = uiController.isRoot() && !appRuntime.running();
    const bool resourcesAcquired = idleUi && resourceBroker.acquire(
        kSdIdentificationOwner, leshy1::storage::kSdIdentificationResources);
    const std::uint32_t ownedDuring =
        resourceBroker.ownedBy(kSdIdentificationOwner);
    const char* status = "resource_unavailable";

    BoardSdSpiTransport identityTransport;
    const bool identityAdapterBegun = resourcesAcquired && identityTransport.begin();
    leshy1::storage::SdTransportRunResult identity;
    if (identityAdapterBegun) {
        leshy1::storage::SdTransportRunPolicy policy;
        policy.allowPhysical = true;
        policy.explicitlySelected = true;
        policy.identificationOnly = true;
        policy.ownedResources = ownedDuring;
        identity = leshy1::storage::runSdIdentificationStateMachine(
            leshy1::storage::defaultSdIdentificationPlan(), identityTransport,
            policy);
        identityTransport.end();
    }
    const bool identityCleanup = identityTransport.cleanupComplete();
    for (std::size_t index = 0; index < identity.identity.cid.size(); ++index) {
        std::snprintf(cidHex + index * 2, sizeof(sdPhysicalEvidence.cidHex) - index * 2,
                      "%02X", static_cast<unsigned>(identity.identity.cid[index]));
    }
    const bool fingerprintMatched =
        identity.status == leshy1::storage::SdTransportRunStatus::Valid &&
        std::strcmp(cidHex, expectedFingerprint) == 0;

    char scratchPath[leshy1::storage::kScratchPathMax] = {};
    std::snprintf(scratchPath, sizeof(scratchPath), "%s%s",
                  leshy1::storage::kScratchRoot, runId);
    BoardSdFilesystem filesystem;
    const bool mountAttempted = fingerprintMatched;
    const bool mounted = fingerprintMatched && filesystem.begin();
    const std::uint64_t cardCapacity =
        mounted ? filesystem.cardCapacityBytes() : 0;
    const std::uint64_t filesystemCapacity =
        mounted ? filesystem.filesystemCapacityBytes() : 0;
    const std::uint64_t freeBefore = mounted ? filesystem.freeBytes() : 0;
    const bool capacityMatched = mounted &&
        cardCapacity == identity.identity.capacityBytes &&
        filesystemCapacity != 0 && filesystemCapacity <= cardCapacity;
    const bool scratchPreexisting = mounted && filesystem.exists(scratchPath);

    leshy1::storage::MediaIdentity media;
    media.present = capacityMatched;
    media.kind = leshy1::storage::MediaKind::Sd;
    media.fingerprint = cidHex;
    media.capacityBytes = cardCapacity;
    media.freeBytes = freeBefore;
    leshy1::storage::WriteRequest request;
    request.explicitlyDisposable = true;
    request.expectedFingerprint = expectedFingerprint;
    request.runId = runId;
    request.scratchExists = scratchPreexisting;
    request.requiredBytes = 64U * 1024U;
    request.reserveBytes = 1024U * 1024U;
    const leshy1::storage::WritePermit permit =
        leshy1::storage::authorizeScratchWrite(media, request);

    leshy1::storage::SessionStoreCommitResult initialCommit;
    leshy1::storage::SessionStoreCommitResult interruptedCommit;
    leshy1::storage::SessionStoreRecoveryResult initialRecovery;
    StoredGenerationEvidence priorEvidence;
    bool prepared = false;
    bool scratchCreated = false;
    bool priorUnchanged = false;
    bool resetArmed = false;
    bool boundaryStopped = false;
    bool sequenceValid = false;
    std::size_t boundariesReached = 0;
    std::uint64_t bytesWritten = 0;
    std::uint32_t fileSyncs = 0;
    std::uint32_t directorySyncs = 0;
    const char* ioFailure = "not_started";
    unsigned ioFresult = 0;
    const char* ioFresultName = "not_started";
    std::uint64_t freeAfter = freeBefore;

    if (!leshy1::storage::isSessionStoreBoundary(boundary)) {
        status = "invalid_boundary";
    } else if (!idleUi) {
        status = "ui_not_idle";
    } else if (!resourcesAcquired) {
        status = "resources_unavailable";
    } else if (!identityAdapterBegun) {
        status = "identity_adapter_begin_failed";
    } else if (identity.status != leshy1::storage::SdTransportRunStatus::Valid) {
        status = "identity_failed";
    } else if (!fingerprintMatched) {
        status = "fingerprint_mismatch";
    } else if (!mounted) {
        status = "mount_failed";
    } else if (!capacityMatched) {
        status = "capacity_mismatch";
    } else if (!permit.allowed()) {
        status = "permit_rejected";
    } else {
        ArduinoFsSessionStoreIo io(filesystem.driveNumber(),
                                   sdSessionStoreIoWorkspace);
        prepared = io.prepare(permit);
        scratchCreated = prepared && filesystem.exists(permit.scratchPath);
        if (!prepared || !scratchCreated) {
            status = "scratch_prepare_failed";
        } else {
            initialCommit = leshy1::storage::commitNextSession(
                io, sessionStoreWorkspace, librarySession);
            initialRecovery = leshy1::storage::recoverSession(
                io, sessionStoreWorkspace,
                &sessionStoreWorkspace.validationSession);
            priorUnchanged = initialCommit.complete() &&
                initialCommit.generation == 1 && initialRecovery.valid() &&
                initialRecovery.generation == 1 &&
                inspectStoredGeneration(io, sessionStoreWorkspace, librarySession,
                                        1, &priorEvidence);
            if (!priorUnchanged) {
                status = "initial_generation_failed";
            } else {
                resetArmed = true;
                std::snprintf(
                    line, sizeof(sdPhysicalEvidence.line),
                    "{\"schema\":\"leshy.storage.sd.session_store_reset.v1\","
                    "\"kind\":\"armed\",\"status\":\"ready\","
                    "\"run_id\":\"%s\",\"boundary\":%u,"
                    "\"boundary_name\":\"%s\",\"expected_recovery\":\"%s\","
                    "\"cid_hex\":\"%s\",\"fingerprint_matched\":true,"
                    "\"scratch_path\":\"%s\",\"initial_generation\":1,"
                    "\"initial_observations\":%u,"
                    "\"prior_segment_bytes\":%u,\"prior_segment_crc32c\":%lu,"
                    "\"prior_manifest_bytes\":%u,\"prior_manifest_crc32c\":%lu,"
                    "\"filesystem_driver\":\"esp_idf_sdspi\","
                    "\"filesystem_spi_hz\":%lu,\"format_allowed\":false,"
                    "\"writes_bounded_to_scratch\":true,"
                    "\"reset_injection\":true,\"physical_power_cut\":false,"
                    "\"radio_tx_commands\":0}",
                    runId, boundaryNumber,
                    leshy1::storage::sessionStoreBoundaryName(boundary),
                    resetExpectedRecovery(boundaryNumber), cidHex,
                    permit.scratchPath,
                    static_cast<unsigned>(initialRecovery.observations),
                    static_cast<unsigned>(priorEvidence.observedSegmentSize),
                    static_cast<unsigned long>(priorEvidence.observedSegmentCrc),
                    static_cast<unsigned>(priorEvidence.observedManifestSize),
                    static_cast<unsigned long>(priorEvidence.observedManifestCrc),
                    static_cast<unsigned long>(filesystem.realFrequencyHz()));
                reply.println(line);
                reply.flush();
                ResetBoundaryHookContext hookContext{
                    &reply, runId, boundaryNumber};
                leshy1::storage::SessionStoreBoundaryIo injecting(
                    io, boundary, restartAtSessionStoreBoundary, &hookContext);
                interruptedCommit = leshy1::storage::commitNextSession(
                    injecting, sessionStoreWorkspace, librarySession);
                boundaryStopped = injecting.stopped();
                sequenceValid = injecting.sequenceValid();
                boundariesReached = injecting.boundariesReached();
                status = "reset_not_triggered";
            }
        }
        bytesWritten = io.bytesWritten();
        fileSyncs = io.fileSyncs();
        directorySyncs = io.directorySyncs();
        ioFailure = io.lastFailure();
        ioFresult = io.lastFresult();
        ioFresultName = io.lastFresultName();
        io.end();
        freeAfter = filesystem.freeBytes();
    }

    if (mountAttempted) filesystem.end();
    resourceBroker.releaseAll(kSdIdentificationOwner);
    const std::uint32_t ownedAfter =
        resourceBroker.ownedBy(kSdIdentificationOwner);
    const bool cleanupComplete = identityCleanup &&
        (!mountAttempted || filesystem.cleanupComplete()) && ownedAfter == 0;
    std::snprintf(
        line, sizeof(sdPhysicalEvidence.line),
        "{\"schema\":\"leshy.storage.sd.session_store_reset.v1\","
        "\"kind\":\"result\",\"mode\":\"arm\",\"status\":\"%s\","
        "\"run_id\":\"%s\",\"boundary\":%u,\"boundary_name\":\"%s\","
        "\"expected_recovery\":\"%s\",\"permit_status\":\"%s\","
        "\"cid_hex\":\"%s\",\"fingerprint_matched\":%s,"
        "\"scratch_path\":\"%s\",\"scratch_preexisting\":%s,"
        "\"scratch_created\":%s,\"reset_armed\":%s,"
        "\"boundary_stopped\":%s,\"sequence_valid\":%s,"
        "\"boundaries_reached\":%u,\"initial_commit_status\":\"%s\","
        "\"interrupted_commit_status\":\"%s\","
        "\"interrupted_commit_stage\":\"%s\",\"prior_unchanged\":%s,"
        "\"bytes_written\":%llu,\"file_syncs\":%lu,"
        "\"directory_syncs\":%lu,\"io_failure\":\"%s\","
        "\"io_fresult\":%u,\"io_fresult_name\":\"%s\","
        "\"card_capacity_bytes\":%llu,\"filesystem_capacity_bytes\":%llu,"
        "\"free_before\":%llu,\"free_after\":%llu,"
        "\"mounted\":%s,\"resource_acquired\":%s,"
        "\"owned_during\":%lu,\"owned_after\":%lu,"
        "\"cleanup_complete\":%s,\"format_allowed\":false,"
        "\"existing_paths_deleted\":false,\"reset_injection\":true,"
        "\"physical_power_cut\":false,\"radio_tx_commands\":0}",
        status, runId, boundaryNumber,
        leshy1::storage::sessionStoreBoundaryName(boundary),
        resetExpectedRecovery(boundaryNumber),
        leshy1::storage::permitStatusName(permit.status), cidHex,
        fingerprintMatched ? "true" : "false",
        permit.allowed() ? permit.scratchPath : scratchPath,
        scratchPreexisting ? "true" : "false",
        scratchCreated ? "true" : "false", resetArmed ? "true" : "false",
        boundaryStopped ? "true" : "false",
        sequenceValid ? "true" : "false",
        static_cast<unsigned>(boundariesReached),
        leshy1::storage::sessionStoreStatusName(initialCommit.status),
        leshy1::storage::sessionStoreStatusName(interruptedCommit.status),
        leshy1::storage::sessionStoreBoundaryName(interruptedCommit.stage),
        priorUnchanged ? "true" : "false",
        static_cast<unsigned long long>(bytesWritten),
        static_cast<unsigned long>(fileSyncs),
        static_cast<unsigned long>(directorySyncs), ioFailure, ioFresult,
        ioFresultName, static_cast<unsigned long long>(cardCapacity),
        static_cast<unsigned long long>(filesystemCapacity),
        static_cast<unsigned long long>(freeBefore),
        static_cast<unsigned long long>(freeAfter),
        mounted ? "true" : "false", resourcesAcquired ? "true" : "false",
        static_cast<unsigned long>(ownedDuring),
        static_cast<unsigned long>(ownedAfter),
        cleanupComplete ? "true" : "false");
    reply.println(line);
}

void emitPhysicalSdSessionResetRecovery(Stream& reply,
                                        const char* expectedFingerprint,
                                        const char* runId,
                                        unsigned boundaryNumber) {
    auto& line = sdPhysicalEvidence.line;
    auto& cidHex = sdPhysicalEvidence.cidHex;
    cidHex[0] = '\0';
    const leshy1::storage::CommitStage boundary =
        resetBoundaryStage(boundaryNumber);
    const esp_reset_reason_t resetReason = esp_reset_reason();
    const bool softwareReset = resetReason == ESP_RST_SW;
    const bool idleUi = uiController.isRoot() && !appRuntime.running();
    const bool resourcesAcquired = idleUi && resourceBroker.acquire(
        kSdIdentificationOwner, leshy1::storage::kSdIdentificationResources);
    const std::uint32_t ownedDuring =
        resourceBroker.ownedBy(kSdIdentificationOwner);

    BoardSdSpiTransport identityTransport;
    const bool identityAdapterBegun = resourcesAcquired && identityTransport.begin();
    leshy1::storage::SdTransportRunResult identity;
    if (identityAdapterBegun) {
        leshy1::storage::SdTransportRunPolicy policy;
        policy.allowPhysical = true;
        policy.explicitlySelected = true;
        policy.identificationOnly = true;
        policy.ownedResources = ownedDuring;
        identity = leshy1::storage::runSdIdentificationStateMachine(
            leshy1::storage::defaultSdIdentificationPlan(), identityTransport,
            policy);
        identityTransport.end();
    }
    const bool identityCleanup = identityTransport.cleanupComplete();
    for (std::size_t index = 0; index < identity.identity.cid.size(); ++index) {
        std::snprintf(cidHex + index * 2, sizeof(sdPhysicalEvidence.cidHex) - index * 2,
                      "%02X", static_cast<unsigned>(identity.identity.cid[index]));
    }
    const bool fingerprintMatched =
        identity.status == leshy1::storage::SdTransportRunStatus::Valid &&
        std::strcmp(cidHex, expectedFingerprint) == 0;

