anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void emitLibraryCsvExport(Stream& reply) {
    const LibraryEntry* entry = libraryController.selected();
    if (libraryController.view() != LibraryView::ExportReady || entry == nullptr ||
        entry->session == nullptr) {
        reply.println(
            "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"begin\","
            "\"status\":\"not_requested\",\"radio_touched\":false}");
        return;
    }
    char row[256] = {};
    const auto header = libraryController.formatSelectedCsvHeader(
        row, sizeof(row));
    if (!header.valid()) {
        std::snprintf(
            diagnosticJson, sizeof(diagnosticJson),
            "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"begin\","
            "\"status\":\"%s\",\"radio_touched\":false}",
            leshy1::apps::library::libraryExportStatusName(header.status));
        reply.println(diagnosticJson);
        return;
    }
    std::snprintf(
        diagnosticJson, sizeof(diagnosticJson),
        "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"begin\","
        "\"status\":\"valid\",\"generation\":%lu,\"session_id\":\"%s\","
        "\"records\":%u,\"columns\":9,\"line_endings\":\"crlf\","
        "\"identity_encoding\":\"lower_hex\",\"label_encoding\":\"lower_hex\","
        "\"radio_touched\":false}",
        static_cast<unsigned long>(entry->generation), entry->session->id(),
        static_cast<unsigned>(entry->session->size()));
    reply.println(diagnosticJson);
    reply.print(row);
    std::size_t bytes = header.bytes;
    std::size_t records = 0;
    for (std::size_t index = 0; index < entry->session->size(); ++index) {
        const auto formatted = libraryController.formatSelectedCsvRow(
            index, row, sizeof(row));
        if (!formatted.valid()) {
            std::snprintf(
                diagnosticJson, sizeof(diagnosticJson),
                "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"end\","
                "\"status\":\"%s\",\"records\":%u,\"bytes\":%u,"
                "\"radio_touched\":false}",
                leshy1::apps::library::libraryExportStatusName(formatted.status),
                static_cast<unsigned>(records), static_cast<unsigned>(bytes));
            reply.println(diagnosticJson);
            return;
        }
        reply.print(row);
        bytes += formatted.bytes;
        ++records;
    }
    std::snprintf(
        diagnosticJson, sizeof(diagnosticJson),
        "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"end\","
        "\"status\":\"complete\",\"records\":%u,\"bytes\":%u,"
        "\"radio_touched\":false}",
        static_cast<unsigned>(records), static_cast<unsigned>(bytes));
    reply.println(diagnosticJson);
}

void emitLibraryPcapStatus(Stream& reply) {
    if (libraryController.view() != LibraryView::ExportReady) {
        reply.println(
            "{\"schema\":\"leshy.library.pcap.v1\",\"kind\":\"artifact\","
            "\"status\":\"not_requested\",\"radio_touched\":false}");
        return;
    }
    const LibraryEntry* entry = libraryController.selected();
    if (entry == nullptr || entry->session == nullptr ||
        !entry->session->captureMetadata().framePayloadCaptured) {
        const auto result = libraryController.formatSelectedPcapStatus(
            diagnosticJson, sizeof(diagnosticJson));
        if (result.valid()) {
            reply.println(diagnosticJson);
        } else {
            std::snprintf(
                diagnosticJson, sizeof(diagnosticJson),
                "{\"schema\":\"leshy.library.pcap.v1\",\"kind\":\"artifact\","
                "\"status\":\"%s\",\"radio_touched\":false}",
                leshy1::apps::library::libraryExportStatusName(result.status));
            reply.println(diagnosticJson);
        }
        return;
    }
    if (entry->generation != sessionStoreWorkspace.generation) {
        reply.println(
            "{\"schema\":\"leshy.library.pcap.v1\",\"kind\":\"error\","
            "\"reason\":\"generation_not_loaded\",\"radio_touched\":false}");
        return;
    }
    leshy1::storage::PersistedWifiFrameCaptureView persisted;
    const auto opened = leshy1::storage::openPersistedWifiFrameCapture(
        *entry->session, sessionStoreWorkspace.segment.data(),
        sessionStoreWorkspace.segmentSize, &persisted);
    if (opened != leshy1::storage::SessionCodecStatus::Valid) {
        std::snprintf(
            diagnosticJson, sizeof(diagnosticJson),
            "{\"schema\":\"leshy.library.pcap.v1\",\"kind\":\"error\","
            "\"reason\":\"%s\",\"radio_touched\":false}",
            leshy1::storage::sessionCodecStatusName(opened));
        reply.println(diagnosticJson);
        return;
    }
    const auto& source = static_cast<
        const leshy1::domain::captures::WifiFrameSource&>(persisted);
    const std::size_t expected =
        leshy1::apps::capture::radiotapPcapSize(source);
    std::snprintf(
        diagnosticJson, sizeof(diagnosticJson),
        "{\"schema\":\"leshy.library.pcap.v1\",\"kind\":\"pcap_begin\","
        "\"status\":\"valid\",\"generation\":%lu,\"session_id\":\"%s\","
        "\"bytes\":%u,\"frames\":%u,\"linktype\":127,"
        "\"timebase\":\"monotonic_us\",\"streaming\":true,"
        "\"persistent\":true,\"radio_touched\":false}",
        static_cast<unsigned long>(entry->generation), entry->session->id(),
        static_cast<unsigned>(expected),
        static_cast<unsigned>(persisted.frameCount()));
    reply.println(diagnosticJson);
    reply.flush();
    StreamPcapSink sink{&reply};
    const PcapExportResult pcap = leshy1::apps::capture::writeRadiotapPcap(
        source, writePcapBytes, &sink);
    std::snprintf(
        diagnosticJson, sizeof(diagnosticJson),
        "{\"schema\":\"leshy.library.pcap.v1\",\"kind\":\"pcap_end\","
        "\"status\":\"%s\",\"bytes\":%u,\"frames\":%u,"
        "\"persistent\":true,\"radio_touched\":false}",
        pcap.valid ? "valid" : "stream_failed",
        static_cast<unsigned>(pcap.bytesWritten),
        static_cast<unsigned>(pcap.framesWritten));
    reply.println(diagnosticJson);
    reply.flush();
}

void emitHilSessionBegin(Stream& reply, const char* command) {
    constexpr const char* prefix = "hil.begin ";
    const char* arguments = command + std::strlen(prefix);
    const char* separator = std::strchr(arguments, ' ');
    char sessionId[HilSession::kSessionIdLength + 1] = {};
    char candidateIdentity[HilSession::kAppIdentityLength + 1] = {};
    HilSessionStatus status = HilSessionStatus::InvalidSessionId;
    if (separator != nullptr &&
        static_cast<std::size_t>(separator - arguments) ==
            HilSession::kSessionIdLength &&
        std::strlen(separator + 1) == HilSession::kAppIdentityLength) {
        std::memcpy(sessionId, arguments, HilSession::kSessionIdLength);
        std::memcpy(candidateIdentity, separator + 1,
                    HilSession::kAppIdentityLength + 1);
        status = hilSession.begin(sessionId, candidateIdentity,
                                  runningAppElfSha256);
    }
    char line[384] = {};
    if (status == HilSessionStatus::Begun) {
        std::snprintf(
            line, sizeof(line),
            "{\"schema\":\"leshy.hil.session.v1\",\"kind\":\"begun\","
            "\"status\":\"begun\",\"session_id\":\"%s\",\"active\":true,"
            "\"app_elf_sha256\":\"%s\",\"firmware_version\":\"%s\","
            "\"ui_revision\":%lu}",
            hilSession.id(), runningAppElfSha256, LESHY1_VERSION,
            static_cast<unsigned long>(uiController.revision()));
    } else {
        std::snprintf(
            line, sizeof(line),
            "{\"schema\":\"leshy.hil.session.v1\",\"kind\":\"error\","
            "\"operation\":\"begin\",\"status\":\"%s\",\"active\":%s}",
            leshy1::services::diagnostics::hilSessionStatusName(status),
            hilSession.active() ? "true" : "false");
    }
    reply.println(line);
}

void emitHilSessionEnd(Stream& reply, const char* command) {
    constexpr const char* prefix = "hil.end ";
    const char* sessionId = command + std::strlen(prefix);
    const HilSessionStatus status = hilSession.end(sessionId);
    char line[256] = {};
    if (status == HilSessionStatus::Ended) {
        std::snprintf(
            line, sizeof(line),
            "{\"schema\":\"leshy.hil.session.v1\",\"kind\":\"ended\","
            "\"status\":\"ended\",\"session_id\":\"%s\",\"active\":false,"
            "\"app_elf_sha256\":\"%s\",\"ui_revision\":%lu}",
            hilSession.id(), runningAppElfSha256,
            static_cast<unsigned long>(uiController.revision()));
    } else {
        std::snprintf(
            line, sizeof(line),
            "{\"schema\":\"leshy.hil.session.v1\",\"kind\":\"error\","
            "\"operation\":\"end\",\"status\":\"%s\",\"active\":%s}",
            leshy1::services::diagnostics::hilSessionStatusName(status),
            hilSession.active() ? "true" : "false");
    }
    reply.println(line);
}

void emitInputState(Stream& reply) {
    leshy1::ui::Pcf8574ButtonInputMetrics metrics;
    std::uint32_t queueDrops = 0;
    std::uint32_t queueHighWater = 0;
    portENTER_CRITICAL(&physicalInputMux);
    metrics = physicalButtonInput.metrics();
    queueDrops = physicalInputQueueDrops;
    queueHighWater = physicalInputQueueHighWater;
    portEXIT_CRITICAL(&physicalInputMux);
    const unsigned queueDepth = physicalInputEvents == nullptr
                                    ? 0U
                                    : static_cast<unsigned>(
                                          uxQueueMessagesWaiting(physicalInputEvents));
    char line[768] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.input.frontend.v1\",\"kind\":\"state\","
        "\"status\":\"%s\",\"task_started\":%s,"
        "\"poll_period_ms\":%lu,\"debounce_ms\":%lu,"
        "\"button_mask\":%u,\"latest_raw\":%u,\"stable_raw\":%u,"
        "\"valid_samples\":%lu,\"read_errors\":%lu,"
        "\"raw_transitions\":%lu,\"stable_transitions\":%lu,"
        "\"press_events\":%lu,\"release_events\":%lu,"
        "\"ambiguous_presses\":%lu,\"presses\":{"
        "\"select\":%lu,\"up\":%lu,\"down\":%lu,"
        "\"left\":%lu,\"right\":%lu},"
        "\"maximum_sample_gap_ms\":%lu,\"queue_capacity\":%u,"
        "\"queue_depth\":%u,\"queue_high_water\":%lu,"
        "\"queue_drops\":%lu,"
        "\"dispatched_press_events\":%lu,"
        "\"last_dispatched_action\":\"%s\","
        "\"last_dispatched_changed\":%s,"
        "\"last_queue_latency_us\":%llu,"
        "\"maximum_queue_latency_us\":%llu,"
        "\"last_repaint_us\":%llu,"
        "\"last_end_to_end_us\":%llu,"
        "\"maximum_end_to_end_us\":%llu,"
        "\"hot_path_serial_writes\":0}",
        physicalInputTaskStarted && bootMetrics.inputDetected ? "ready" : "unavailable",
        physicalInputTaskStarted ? "true" : "false",
        static_cast<unsigned long>(Pcf8574ButtonInput::kPollPeriodMs),
        static_cast<unsigned long>(Pcf8574ButtonInput::kDebounceMs),
        static_cast<unsigned>(Pcf8574ButtonInput::kButtonMask),
        static_cast<unsigned>(metrics.latestRaw),
        static_cast<unsigned>(metrics.stableRaw),
        static_cast<unsigned long>(metrics.validSamples),
        static_cast<unsigned long>(metrics.readErrors),
        static_cast<unsigned long>(metrics.rawTransitions),
        static_cast<unsigned long>(metrics.stableTransitions),
        static_cast<unsigned long>(metrics.pressEvents),
        static_cast<unsigned long>(metrics.releaseEvents),
        static_cast<unsigned long>(metrics.ambiguousPresses),
        static_cast<unsigned long>(metrics.selectPresses),
        static_cast<unsigned long>(metrics.upPresses),
        static_cast<unsigned long>(metrics.downPresses),
        static_cast<unsigned long>(metrics.leftPresses),
        static_cast<unsigned long>(metrics.rightPresses),
        static_cast<unsigned long>(metrics.maximumSampleGapMs),
        static_cast<unsigned>(kPhysicalInputQueueCapacity), queueDepth,
        static_cast<unsigned long>(queueHighWater),
        static_cast<unsigned long>(queueDrops),
        static_cast<unsigned long>(physicalInputDispatchedPresses),
        leshy1::ui::uiActionName(lastPhysicalInputAction),
        lastPhysicalInputChanged ? "true" : "false",
        static_cast<unsigned long long>(lastPhysicalInputQueueUs),
        static_cast<unsigned long long>(maximumPhysicalInputQueueUs),
        static_cast<unsigned long long>(lastPhysicalInputRenderUs),
        static_cast<unsigned long long>(lastPhysicalInputEndToEndUs),
        static_cast<unsigned long long>(maximumPhysicalInputEndToEndUs));
    reply.println(line);
}

void emitSelfTestReport(Stream& reply) {
    const SelfTestReport& report = selfTestController.report();
    const std::uint32_t radioTxCommands =
        shieldReceiverProbeReport.radioTxCommands +
        fullGuidedNrf24Report.txModeEntries +
        fullGuidedNrf24Report.txPayloadCommands +
        fullGuidedCc1101Report.txStrobes;
    auto& line = diagnosticJson;
    line[0] = '\0';
    const int prefix = std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.self_test.report.v1\",\"kind\":\"report\","
        "\"schema_version\":%u,\"plan_version\":%u,"
        "\"firmware_version\":\"%s\",\"app_elf_sha256\":\"%s\","
        "\"board_profile\":\"%s\",\"mode\":\"%s\",\"status\":\"%s\","
        "\"sequence\":%lu,\"started_us\":%llu,\"duration_us\":%llu,"
        "\"read_only\":%s,\"cancelled\":%s,"
        "\"passed\":%u,\"failed\":%u,\"blocked\":%u,"
        "\"not_applicable\":%u,"
        "\"side_effects\":{\"radio_tx_commands\":%lu,"
        "\"storage_write_commands\":%lu,"
        "\"storage_write_bytes\":%llu,"
        "\"product_storage_write_commands\":0,"
        "\"buzzer_activations\":0},"
        "\"facts\":{\"build_identity_present\":%s,"
        "\"profile_matched\":%s,\"display_ready\":%s,"
        "\"touch_frontend_ready\":%s,"
        "\"input_frontend_ready\":%s,\"input_queue_healthy\":%s,"
        "\"buzzer_inactive\":%s,\"resource_scope_clean\":%s,"
        "\"heap_free\":%lu,\"heap_minimum\":%lu,\"heap_floor\":%lu,"
        "\"input_queue_drops\":%lu,\"run_resource_mask\":%lu,"
        "\"persistent_survey_ready\":%s,\"passive_ble_ready\":%s,"
        "\"passive_wifi_capture_ready\":%s,"
        "\"enrolled_storage_ready\":%s,"
        "\"persistent_library_ready\":%s,"
        "\"persistent_wifi_capture_ready\":%s,"
        "\"gps_declared\":%s,\"pn532_declared\":%s,"
        "\"ir_declared\":%s,"
        "\"shield_receivers_applicable\":%s,"
        "\"shield_receiver_probe_complete\":%s,"
        "\"shield_receiver_probe_passed\":%s,"
        "\"nrf24_spectrum_exercise_complete\":%s,"
        "\"nrf24_spectrum_exercise_passed\":%s,"
        "\"cc1101_spectrum_exercise_complete\":%s,"
        "\"cc1101_spectrum_exercise_passed\":%s,"
        "\"persistent_recovery_audit_complete\":%s,"
        "\"persistent_recovery_audit_passed\":%s,"
        "\"library_export_audit_complete\":%s,"
        "\"library_export_audit_passed\":%s,"
        "\"capture_pcap_audit_complete\":%s,"
        "\"capture_pcap_audit_applicable\":%s,"
        "\"capture_pcap_audit_passed\":%s,"
        "\"disposable_commit_complete\":%s,"
        "\"disposable_commit_passed\":%s,"
        "\"disposable_remount_complete\":%s,"
        "\"disposable_remount_passed\":%s,"
        "\"disposable_export_complete\":%s,"
        "\"disposable_export_passed\":%s,"
        "\"disposable_cleanup_complete\":%s,"
        "\"disposable_cleanup_passed\":%s},"
        "\"checks\":[",
        static_cast<unsigned>(SelfTestReport::kSchemaVersion),
        static_cast<unsigned>(SelfTestReport::kPlanVersion), LESHY1_VERSION,
        runningAppElfSha256, BoardProfile::kId,
        leshy1::apps::self_test::selfTestModeName(report.mode),
        leshy1::apps::self_test::selfTestResultStatusName(report.status),
        static_cast<unsigned long>(report.sequence),
        static_cast<unsigned long long>(report.startedUs),
        static_cast<unsigned long long>(report.durationUs),
        report.readOnly ? "true" : "false",
        report.cancelled ? "true" : "false",
        static_cast<unsigned>(report.passed),
        static_cast<unsigned>(report.failed),
        static_cast<unsigned>(report.blocked),
        static_cast<unsigned>(report.notApplicable),
        static_cast<unsigned long>(radioTxCommands),
        static_cast<unsigned long>(
            report.mode == SelfTestMode::FullGuided
                ? report.facts.disposableStorageWriteCalls : 0),
        static_cast<unsigned long long>(
            report.mode == SelfTestMode::FullGuided
                ? report.facts.disposableStorageWriteBytes : 0),
        report.facts.buildIdentityPresent ? "true" : "false",
        report.facts.profileMatched ? "true" : "false",
        report.facts.displayReady ? "true" : "false",
        report.facts.touchFrontendReady ? "true" : "false",
        report.facts.inputFrontendReady ? "true" : "false",
        report.facts.inputQueueHealthy ? "true" : "false",
        report.facts.buzzerInactive ? "true" : "false",
        report.facts.resourceScopeClean ? "true" : "false",
        static_cast<unsigned long>(report.facts.heapFree),
        static_cast<unsigned long>(report.facts.heapMinimum),
        static_cast<unsigned long>(report.facts.heapFloor),
        static_cast<unsigned long>(report.facts.inputQueueDrops),
        static_cast<unsigned long>(report.facts.activeResources),
        report.facts.persistentSurveyReady ? "true" : "false",
        report.facts.passiveBleReady ? "true" : "false",
        report.facts.passiveWifiCaptureReady ? "true" : "false",
        report.facts.enrolledStorageReady ? "true" : "false",
        report.facts.persistentLibraryReady ? "true" : "false",
        report.facts.persistentWifiCaptureReady ? "true" : "false",
        report.facts.gpsDeclared ? "true" : "false",
        report.facts.pn532Declared ? "true" : "false",
        report.facts.irDeclared ? "true" : "false",
        report.facts.shieldReceiversApplicable ? "true" : "false",
        report.facts.shieldReceiverProbeComplete ? "true" : "false",
        report.facts.shieldReceiverProbePassed ? "true" : "false",
        report.facts.nrf24SpectrumExerciseComplete ? "true" : "false",
        report.facts.nrf24SpectrumExercisePassed ? "true" : "false",
        report.facts.cc1101SpectrumExerciseComplete ? "true" : "false",
        report.facts.cc1101SpectrumExercisePassed ? "true" : "false",
        report.facts.persistentRecoveryAuditComplete ? "true" : "false",
        report.facts.persistentRecoveryAuditPassed ? "true" : "false",
        report.facts.libraryExportAuditComplete ? "true" : "false",
        report.facts.libraryExportAuditPassed ? "true" : "false",
        report.facts.capturePcapAuditComplete ? "true" : "false",
        report.facts.capturePcapAuditApplicable ? "true" : "false",
        report.facts.capturePcapAuditPassed ? "true" : "false",
        report.facts.disposableCommitComplete ? "true" : "false",
        report.facts.disposableCommitPassed ? "true" : "false",
        report.facts.disposableRemountComplete ? "true" : "false",
        report.facts.disposableRemountPassed ? "true" : "false",
        report.facts.disposableExportComplete ? "true" : "false",
        report.facts.disposableExportPassed ? "true" : "false",
        report.facts.disposableCleanupComplete ? "true" : "false",
        report.facts.disposableCleanupPassed ? "true" : "false");
    if (prefix < 0 || static_cast<std::size_t>(prefix) >= sizeof(line)) {
        reply.println("{\"schema\":\"leshy.self_test.report.v1\","
                      "\"kind\":\"error\",\"reason\":\"format_failed\"}");
        return;
    }
    std::size_t used = static_cast<std::size_t>(prefix);
    for (std::size_t index = 0; index < report.checkCount; ++index) {
        const auto& check = report.checks[index];
        const int written = std::snprintf(
            line + used, sizeof(line) - used,
            "%s{\"id\":\"%s\",\"status\":\"%s\"}",
            index == 0 ? "" : ",", check.id == nullptr ? "missing" : check.id,
            leshy1::apps::self_test::selfTestResultStatusName(check.status));
        if (written < 0 || static_cast<std::size_t>(written) >= sizeof(line) - used) {
            reply.println("{\"schema\":\"leshy.self_test.report.v1\","
                          "\"kind\":\"error\",\"reason\":\"format_failed\"}");
            return;
        }
        used += static_cast<std::size_t>(written);
    }
    const int suffix = std::snprintf(
        line + used, sizeof(line) - used,
        "],\"current_owner\":\"%s\",\"current_lease_mask\":%lu}",
        appRuntime.activeApp(),
        static_cast<unsigned long>(appRuntime.activeResources()));
    if (suffix < 0 || static_cast<std::size_t>(suffix) >= sizeof(line) - used) {
        reply.println("{\"schema\":\"leshy.self_test.report.v1\","
                      "\"kind\":\"error\",\"reason\":\"format_failed\"}");
        return;
    }
    reply.println(line);
}

