anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void poll(Stream& stream, char* command, std::size_t& length, std::size_t capacity) {
    while (stream.available() > 0) {
        const char value = static_cast<char>(stream.read());
        if (value == '\r') continue;
        if (value == '\n') {
            command[length] = '\0';
            handleCommand(stream, command);
            length = 0;
        } else if (length + 1 < capacity) {
            command[length++] = value;
        } else {
            length = 0;
        }
    }
}

}  // namespace

void setup() {
    bootMetrics.setupEnterUs = static_cast<std::uint64_t>(esp_timer_get_time());
    BoardSafeOutputs::establishBootInvariant();
    Serial.begin(kConsoleBaud);
    Serial0.begin(kConsoleBaud);
    // ESP-IDF lazily allocates the newlib stream and UART VFS locks on the
    // first system log write.  A Wi-Fi scan can otherwise make that first
    // write while the radio heaps are at their low-water mark, where the
    // lock allocator aborts instead of returning an error.  Pre-warm the
    // locks while the boot heap is unconstrained.
    std::fputc('\n', stdout);
    std::fflush(stdout);
    BoardSdSpiTransport::holdRadioTransmitPathsInactive();

    const bool flashMatches = ESP.getFlashChipSize() == BoardProfile::kExpectedFlashBytes;
    const bool psramMatches = psramFound() == BoardProfile::kExpectedPsram;

    bootMetrics.version = LESHY1_VERSION;
    bootMetrics.profile = BoardProfile::kId;
    bootMetrics.profileRevision = BoardProfile::kEnvelopeRevision;
    const esp_app_desc_t* appDescription = esp_app_get_description();
    if (appDescription != nullptr &&
        appDescription->magic_word == ESP_APP_DESC_MAGIC_WORD) {
        constexpr char kHex[] = "0123456789abcdef";
        for (std::size_t i = 0; i < sizeof(appDescription->app_elf_sha256); ++i) {
            const std::uint8_t value = appDescription->app_elf_sha256[i];
            runningAppElfSha256[i * 2] = kHex[value >> 4U];
            runningAppElfSha256[i * 2 + 1] = kHex[value & 0x0FU];
        }
        runningAppElfSha256[64] = '\0';
    }
    bootMetrics.appElfSha256 = runningAppElfSha256;
    bootMetrics.resetReason = static_cast<std::uint32_t>(esp_reset_reason());
    bootMetrics.flashBytes = ESP.getFlashChipSize();
    bootMetrics.psramFound = psramFound();
    bootMetrics.psramBytes = ESP.getPsramSize();
    bootMetrics.heapTotal = ESP.getHeapSize();
    bootMetrics.buzzerSafetyConfigured = true;
    bootMetrics.buzzerInactive = BoardSafeOutputs::buzzerHeldInactive();
    bootMetrics.runtimeReadyUs = static_cast<std::uint64_t>(esp_timer_get_time());

    ledcAttach(BoardProfile::kBacklightPin, 5000, 8);
    ledcWrite(BoardProfile::kBacklightPin, 255);
    display.init();
    display.setRotation(2);
    boardTouchInput.begin(display, millis());
    touchCalibrationRequiredAtBoot =
        boardTouchInput.calibrationSource() ==
        leshy1::platform::arduino::TouchCalibrationSource::DefaultProfile;
    touchCalibrationSucceededAtBoot = !touchCalibrationRequiredAtBoot;
    languageController.restore(loadUiLanguage());
    bootMetrics.displayReadyUs = static_cast<std::uint64_t>(esp_timer_get_time());

    Wire.begin(BoardProfile::kI2cSdaPin, BoardProfile::kI2cSclPin, kI2cHz);
    bootMetrics.inputDetected =
        probeInputAtBoot(&lastInputRaw, &bootMetrics.inputProbeAttempts);
    bootMetrics.inputProbeTransientRetries =
        bootMetrics.inputProbeAttempts == 0
            ? 0
            : static_cast<std::uint8_t>(bootMetrics.inputProbeAttempts - 1U);
    bootMetrics.inputRaw = lastInputRaw;
    physicalButtonInput.reset(lastInputRaw, millis());
    physicalInputEvents = xQueueCreate(kPhysicalInputQueueCapacity,
                                       sizeof(PhysicalInputEvent));
    if (physicalInputEvents != nullptr) {
        physicalInputTaskStarted =
            xTaskCreatePinnedToCore(pollPhysicalInput, "leshy-input", 4096,
                                    nullptr, 2, &physicalInputTaskHandle, 0) == pdPASS;
    }
    bootMetrics.inputDetected =
        bootMetrics.inputDetected && physicalInputTaskStarted;
    bootMetrics.inputReadyUs = static_cast<std::uint64_t>(esp_timer_get_time());
    surveyDemoReady = prepareSurveyDemo();
    libraryDemoReady = prepareLibraryDemo();
    recoverProductCatalogAtBoot();
    storageDiscovery = boardStorageAdapter.discoverReadOnly();
    storageDiscoveryReady = leshy1::storage::validateMediaDiscovery(storageDiscovery) ==
                            leshy1::storage::MediaDiscoveryValidation::Valid;
    productSurveyWorkerReady = initializeProductSurveyWorker();
    captureStoreEvents = xQueueCreate(1, sizeof(CaptureStoreEvent));

    inventory.add({"board.profile",
                   flashMatches && psramMatches ? CapabilityState::Available
                                                : CapabilityState::Fault,
                   "runtime_flash_psram",
                   flashMatches && psramMatches ? "profile_match" : "profile_mismatch"});
    inventory.add({"display.tft", CapabilityState::Declared, "render_attempted",
                   "awaiting_visual_observation"});
    inventory.add({"output.buzzer.safe",
                   bootMetrics.buzzerInactive ? CapabilityState::Available
                                              : CapabilityState::Fault,
                   "gpio2_output_low_runtime_check",
                   bootMetrics.buzzerInactive ? "inactive_boot_invariant"
                                              : "unsafe_level_or_mode"});
    inventory.add({"input.pcf8574",
                   bootMetrics.inputDetected ? CapabilityState::Detected
                                             : CapabilityState::Unknown,
                   "i2c_read_only_0x20",
                   bootMetrics.inputDetected ? "raw_byte_available" : "no_read_response"});
    inventory.add({
        "input.touch",
        boardTouchInput.ready() ? CapabilityState::Available
                                : CapabilityState::Declared,
        leshy1::platform::arduino::touchCalibrationSourceName(
            boardTouchInput.calibrationSource()),
        boardTouchInput.calibrationSource() == TouchCalibrationSource::Leshy1
            ? "v1_calibration_loaded"
            : (boardTouchInput.calibrationSource() ==
                       TouchCalibrationSource::Legacy0x
                   ? "legacy_0x_calibration_loaded"
                   : "calibration_required")});
    inventory.add({"radio.wifi", CapabilityState::Declared, "esp32_s3_builtin",
                   "passive_contract_ready_driver_not_started"});
    inventory.add({
        "capture.wifi_passive",
        flashMatches && psramMatches ? CapabilityState::Available
                                     : CapabilityState::Fault,
        "explicit_promiscuous_rx_only_adapter",
        flashMatches && psramMatches ? "bounded_ram_capture_ready"
                                     : "board_profile_mismatch"});
    inventory.add({
        "capture.wifi_persistent",
        captureStoreEvents != nullptr && productBootRecovery.catalogAdmitted
            ? CapabilityState::Available : CapabilityState::Fault,
        "schema_v4_exact_media_background_commit",
        captureStoreEvents != nullptr && productBootRecovery.catalogAdmitted
            ? "privacy_confirmed_atomic_capture_ready"
            : "capture_worker_or_exact_media_unavailable"});
    inventory.add({
        "radio.ble",
        productSurveyWorkerReady && productBootRecovery.catalogAdmitted
            ? CapabilityState::Available : CapabilityState::Declared,
        "esp32_s3_builtin_receive_only",
        productSurveyWorkerReady && productBootRecovery.catalogAdmitted
            ? "passive_ble_worker_ready" : "product_worker_or_media_unavailable"});
    inventory.add({"survey.simulated",
                   surveyDemoReady ? CapabilityState::Available : CapabilityState::Fault,
                   "E-SURVEY-001_golden_trace",
                   surveyDemoReady ? "golden_data_rf_off" : "golden_data_invalid"});
    inventory.add({"library.simulated",
                   libraryDemoReady ? CapabilityState::Available : CapabilityState::Fault,
                   "E-STORAGE-005_ram_reopen",
                   libraryDemoReady ? "volatile_offline_fixture" : "ram_fixture_invalid"});
    if (productBootRecovery.catalogAdmitted) {
        inventory.add({"library.persistent_session", CapabilityState::Available,
                       "boot_readonly_product_catalog",
                       "validated_session_open"});
        inventory.add({
            "survey.persistent_passive",
            productSurveyWorkerReady ? CapabilityState::Available
                                     : CapabilityState::Fault,
            "boot_catalog_plus_bounded_worker",
            productSurveyWorkerReady
                ? "exact_media_and_cancellable_worker_ready"
                : "worker_initialization_failed"});
    }
    inventory.add({"storage.sd", CapabilityState::Unknown,
                   "E-STORAGE-006_gpio38_non_authoritative",
                   storageDiscoveryReady ? storageDiscovery.reason
                                         : "invalid_discovery_record"});
    inventory.add({"storage.atomicity", CapabilityState::Declared,
                   "E-STORAGE-001+guard_policy", "filesystem_backend_not_started"});
    inventory.add({"assembly.gps", CapabilityState::Unknown, "default_profile",
                   "not_declared_no_autodetect"});
    inventory.add({"assembly.pn532", CapabilityState::Unknown, "default_profile",
                   "not_declared_no_autodetect"});
    inventory.add({"shield.ir", CapabilityState::Unknown, "HW-U09",
                   "explicit_profile_required"});
    inventory.add({"shield.receivers",
                   BoardProfile::kRfShieldDeclared ? CapabilityState::Declared
                                                   : CapabilityState::Unknown,
                   "board_profile_full_guided_identity_probe",
                   BoardProfile::kRfShieldDeclared
                       ? "nrf1_nrf2_cc1101_read_only_probe_available"
                       : "rf_shield_not_declared"});

