anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    appCatalog.rebuild(inventory);
    renderInteractiveScreen();
    bootMetrics.interactiveReadyUs = static_cast<std::uint64_t>(esp_timer_get_time());

    emitMetrics();
    emitInventory();
    broadcast("{\"schema\":\"leshy.boot.v1\",\"kind\":\"help\",\"commands\":["
              "\"hil.begin <session-id> <app-elf-sha256>\","
              "\"hil.end <session-id>\","
              "\"metrics\",\"inventory\",\"hardware.safe-outputs\",\"ping\","
              "\"hardware.shield.receivers\","
              "\"hardware.nrf24.spectrum\","
              "\"hardware.cc1101.spectrum\","
              "\"ui.state\",\"ui.key <action>\",\"survey.browser\","
              "\"capture.state\",\"capture.export.pcap\","
              "\"input.state\",\"touch.state\","
              "\"ui.touch <x> <y>\",\"touch.calibrate confirm\","
              "\"self-test.report\",\"self-test.active-rf\","
              "\"self-test.active-artifact\","
              "\"ui.capture\",\"storage.contract\",\"storage.guard\","
              "\"storage.discovery\",\"storage.mount.policy\","
              "\"storage.product.boot-recovery\","
              "\"storage.product.boot-watchdog-test confirm\","
              "\"storage.product.unenroll confirm\","
              "\"survey.product.admission\","
              "\"survey.product.test-source-unavailable once|clear\","
              "\"survey.product.test-runtime-unavailable wifi|ble|clear\","
              "\"storage.littlefs.parity disposable-ota1 <OTA1-SHA256> <run-id>\","
              "\"storage.littlefs.reset disposable-ota1 <OTA1-SHA256> <run-id> <1..6>\","
              "\"storage.littlefs.reset recover read-only <OTA1-SHA256> <run-id> <1..6>\","
              "\"storage.sd.protocol\",\"storage.sd.identification.fixture\","
              "\"storage.sd.transport.fixture\","
              "\"storage.sd.wire\","
              "\"storage.sd.identify disposable-read-only\","
              "\"storage.sd.inspect-lba0 disposable-read-only\","
              "\"storage.sd.inspect-boot disposable-read-only\","
              "\"storage.sd.inspect-fsinfo disposable-read-only\","
              "\"storage.sd.inspect-fat-reserved disposable-read-only\","
              "\"storage.sd.inspect-root-cluster disposable-read-only\","
              "\"storage.sd.readonly-mount disposable-read-only <CID32>\","
              "\"storage.product.enroll disposable-read-only <CID32>\","
              "\"storage.product.bootstrap disposable-write <CID32>\","
              "\"storage.sd.session-store disposable-write <CID32> <run-id>\","
              "\"storage.sd.session-store throughput disposable-write <CID32> <run-id>\","
              "\"storage.sd.session-store batch-throughput disposable-write <CID32> <run-id>\","
              "\"survey.wifi.passive-persist disposable-write <CID32> <run-id> <1..8>\","
              "\"survey.wifi.passive-ingress measure passive-only <1..32>\","
              "\"survey.contract\",\"session.fixture\",\"session.store.fixture\","
              "\"library.fixture\",\"library.export\",\"library.capture\","
              "\"library.export.csv\",\"library.export.pcap\"]}");
}

void loop() {
    serviceProductSurveyWorker();
    serviceWifiFrameCapture();
    serviceWifiFrameCapturePersist();
    serviceFullGuidedRfChecks();
    serviceNrf24Spectrum();
    serviceCc1101Spectrum();
    poll(Serial, usbCommand, usbLength, sizeof(usbCommand));
    poll(Serial0, uartCommand, uartLength, sizeof(uartCommand));
    TouchPoint touchPress;
    if (boardTouchInput.poll(millis(), &touchPress)) {
        dispatchTouchPoint(touchPress);
    }
    PhysicalInputEvent inputEvent;
    // Preserve the 0.x one-key/one-repaint order even when presses are queued.
    if (physicalInputEvents != nullptr &&
        xQueueReceive(physicalInputEvents, &inputEvent, 0) == pdTRUE) {
        const std::uint64_t dequeuedUs =
            static_cast<std::uint64_t>(esp_timer_get_time());
        lastPhysicalInputQueueUs = dequeuedUs >= inputEvent.atUs
            ? dequeuedUs - inputEvent.atUs : 0;
        if (lastPhysicalInputQueueUs > maximumPhysicalInputQueueUs) {
            maximumPhysicalInputQueueUs = lastPhysicalInputQueueUs;
        }
        lastInputRaw = inputEvent.raw;
        bootMetrics.inputRaw = inputEvent.raw;
        const bool changed = applyUiAction(inputEvent.action, false);
        lastPhysicalInputAction = inputEvent.action;
        lastPhysicalInputChanged = changed;
        ++physicalInputDispatchedPresses;
        if (changed) {
            renderInteractiveScreen(!lastUiActionUsedIncrementalRender);
        }
        lastPhysicalInputRenderUs = changed ? lastUiRenderUs : 0;
        const std::uint64_t finishedUs =
            static_cast<std::uint64_t>(esp_timer_get_time());
        lastPhysicalInputEndToEndUs = finishedUs >= inputEvent.atUs
            ? finishedUs - inputEvent.atUs : 0;
        if (lastPhysicalInputEndToEndUs > maximumPhysicalInputEndToEndUs) {
            maximumPhysicalInputEndToEndUs = lastPhysicalInputEndToEndUs;
        }
        portENTER_CRITICAL(&physicalInputMux);
        lastInputRaw = physicalButtonInput.stableRaw();
        portEXIT_CRITICAL(&physicalInputMux);
        bootMetrics.inputRaw = lastInputRaw;
    }
    delay(2);
}
